{
    "post": {
        "title": "Formula 1 Is Creating a 100% Sustainable Fuel to Keep Internal Combustion Alive",
        "author": "jseams",
        "score": 3241,
        "url": "https://www.caranddriver.com/news/a37872650/formula-1-auto-racing-sustainable-fuel/",
        "selftext": "",
        "num_comments": 453
    },
    "comments": [
        {
            "author": "RhinestoneTaco",
            "score": 1442,
            "body": "Turns out it's mostly just moonshine Keke Rosberg cooks in a shed out back.",
            "created_utc": 1633537279.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "bkussow",
            "score": 518,
            "body": "Call it Allinol.",
            "created_utc": 1633536798.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "_homage_",
            "score": 104,
            "body": "Watch out for those cameras!",
            "created_utc": 1633542932.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 339,
            "body": "Fine. Then bring back the V10s.",
            "created_utc": 1633540073.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.735,
                "pos": 0.265,
                "compound": 0.2023
            }
        },
        {
            "author": "trickster55",
            "score": 229,
            "body": "Can you do that for ice engines across the world plz\n\nPorsche plz",
            "created_utc": 1633537806.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.809,
                "pos": 0.191,
                "compound": 0.1531
            }
        },
        {
            "author": "YouAreMentalM8",
            "score": 852,
            "body": "The sentiment is good, but practically it's going to do almost nothing to offset the largest source of emissions in F1 which is travel. 100 kg of fuel burnt per car per race is nothing comparatively.",
            "created_utc": 1633535532.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.947,
                "pos": 0.053,
                "compound": 0.2382
            }
        },
        {
            "author": "BS_Is_Annoying",
            "score": 75,
            "body": "The problem with ethanol is the way ethanol is produced. \n\nIt is produced in a field using monocultured corn, usually. That means one type plant in a big ass fucking field. Since that one type of plant has zero biodiversity, it's vulnerable to bugs, weather, fungus, and competing plants. Basically, it needs to be babied by tractors, fungicides, fertilizer, irrigation, and pesticides. All that means is to produce corn, you need A LOT of other energy, usually oil derivatives. That other energy *could* be produced renewable, however, that's not scalable if your fertilizer factory and tractors run on the same fuel they are trying to produce.\n\nAnd then a monocultured field has the problem that even when babying it, it goes through different yields. One year, you could have 100% yields, the next year, you could have 130%, and the next year 10%. You can't run an economy on that type of unpredictability unless you have years of storage. And people bitch about wind and solar not being available all the time. Imagine how fucked our economy would be if we had to run on 75% of the oil this year vs last year. \n\nThen you have a refining problem. Turning corn into ethanol is a process that takes A LOT of energy. Nobody has figured out a way to do it efficiently, aka, without using A LOT of energy to make the ethanol.\n\nOkay, put those two problems together, and we will NEVER have an ethanol economy. It just won't happen. It's like growing 10 acres of corn and 5 acres goes to making the ethanol to grow the corn and the other 5 is what you sell. EROEI (Energy return on energy investment) is only about 2-3 for ethanol, and that is really shitty. Worse than solar and wind by a factor of 3-10x (Wind/solar are closer to 10-30). Even the shittiest oil recovery techniques are 10x. \n\nBut a shitty EROEI investment has a niche. That's IF the fuel is more valuable in liquid form, and we don't need a huge volume. AKA specialize uses like long range air travel or rockets.\n\nOkay, now that all of that is discussed, what formula one is probably going to do is buy some corn off the market, grown using diesel burning tractors, transported using diesel trucks, refined using natural gas, and then delivered to the track using diesel trucks. MAYBE they'll use electric trucks and tractors, but it's worth pointing out that electric tractors don't exist right now. And MAYBE they'll use a refining process that uses renewable energy, but they'll have to source those refineries close to their tracks. \n\nThe bottom line, if they are just using ethanol, it's a fucking marketing scam. If they are going through the effort to actually make the entire supply chain zero emissions, it's worth listening to.",
            "created_utc": 1633543182.0,
            "sentiment": {
                "neg": 0.074,
                "neu": 0.859,
                "pos": 0.067,
                "compound": -0.732
            }
        },
        {
            "author": "an_actual_lawyer",
            "score": 110,
            "body": "While I applaud the thought of eliminating fossil fuels, the reality is that there are countless products made with fossil fuels that will still be made with them because it is cheaper and consumers overwhelmingly choose cheaper products over more expensive products.",
            "created_utc": 1633542168.0,
            "sentiment": {
                "neg": 0.034,
                "neu": 0.899,
                "pos": 0.067,
                "compound": 0.3612
            }
        },
        {
            "author": "None",
            "score": 34,
            "body": "If they want to make a difference they should develop a clean sustainable jet fuel, the cars during the race probably make up less than 3% of emissions of the sport. The electricity to keep a machine shop running is crazy high in itself, it’s a shame the cars have to take the fall for the downfalls of every other part of human life.",
            "created_utc": 1633541383.0,
            "sentiment": {
                "neg": 0.079,
                "neu": 0.863,
                "pos": 0.058,
                "compound": -0.3612
            }
        },
        {
            "author": "Cheekyweeshite",
            "score": 9,
            "body": "Porsche is working on a very similar fuel.",
            "created_utc": 1633546085.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "amazing_wanderr",
            "score": 21,
            "body": "So bring back the V10s then?",
            "created_utc": 1633546207.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "dishwashersafe",
            "score": 29,
            "body": "I mean when your team's budget is $145 million, the cost of sustainable fuel is nothing, so sure why not. Let's not pretend this is much more than greenwashing. The emissions of the cars themselves are a drop in the bucket compared to the carbon footprint of everything else involved.",
            "created_utc": 1633543235.0,
            "sentiment": {
                "neg": 0.14,
                "neu": 0.86,
                "pos": 0.0,
                "compound": -0.6674
            }
        },
        {
            "author": "Wizard-In-Disguise",
            "score": 4,
            "body": "Ethanol\nAlways was there, you could drive a Model T with hooch, I almost wrote a tirade about how it stopped but It's common knowledge what happened.",
            "created_utc": 1633558602.0,
            "sentiment": {
                "neg": 0.053,
                "neu": 0.947,
                "pos": 0.0,
                "compound": -0.1154
            }
        },
        {
            "author": "None",
            "score": 19,
            "body": "I highly doubt even F1 can make a perfect combustible fuel that doesn't emit anything.\n\n> it will have zero net carbon dioxide emissions.\n\nTechnically they could already achieve this by planting a couple hundred thousand trees per race.",
            "created_utc": 1633544681.0,
            "sentiment": {
                "neg": 0.064,
                "neu": 0.851,
                "pos": 0.085,
                "compound": 0.228
            }
        },
        {
            "author": "The_Scarf_Ace",
            "score": 6,
            "body": "Toyota is already into hydrogen combustion (no I dont mean hydrogen ev fuel cells). Is it netting 300 hp? no not even close, but in it's early stages it is very promising with how little time it has taken.",
            "created_utc": 1633551910.0,
            "sentiment": {
                "neg": 0.038,
                "neu": 0.869,
                "pos": 0.094,
                "compound": 0.5251
            }
        },
        {
            "author": "bobj33",
            "score": 3,
            "body": "We obviously need to do something about climate change so I think this is a positive step but what how is this going to affect sponsors and race locations?\n\nBahrain, Azerbaijan, Qatar, Saudi Arabia, and Abu Dhabi have economies heavily dependent on petroleum.  Will they still want to have a race when it is promoting sustainable fuel?\n\nWho is actually going to develop this fuel?  The article says \"Formula 1\" but they don't really have research scientists.\n\nPetronas, Shell, Aramco, and other petroleum companies currently sponsor teams and F1 itself.  Are they going to help develop this sustainable fuel or fight against it?  Will they still want to sponsor a team or sports series that is actively working against their business?",
            "created_utc": 1633544435.0,
            "sentiment": {
                "neg": 0.026,
                "neu": 0.864,
                "pos": 0.111,
                "compound": 0.8485
            }
        },
        {
            "author": "MicaLovesKPOP",
            "score": 3,
            "body": "Fucking finally. I'll gladly pay more in order to have an ICE instead of EV! Besides, currently ICE vehicles are HEAVILY taxed here in The Netherlands. If that could be replaced simply with more expensive fuel then hell to the yes, please!\n\nThe only worry I have is that they specifically mention it won't require any modifications... that's going to make it really tough to market.\n\nGovernments will instead have to make it cheaper than regular gas in this case... I hope that's attainable.",
            "created_utc": 1633598226.0,
            "sentiment": {
                "neg": 0.115,
                "neu": 0.777,
                "pos": 0.108,
                "compound": -0.1811
            }
        },
        {
            "author": "elbers",
            "score": 19,
            "body": "Just seems like hot air, but I really hope it isn't.",
            "created_utc": 1633536714.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.598,
                "pos": 0.402,
                "compound": 0.7218
            }
        },
        {
            "author": "ed1380",
            "score": 2,
            "body": "so E100?",
            "created_utc": 1633546954.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "matejcraft100yt",
            "score": 2,
            "body": "Oh shit, allinol is coming to life, cars 2 showed us what happens next",
            "created_utc": 1633551369.0,
            "sentiment": {
                "neg": 0.217,
                "neu": 0.783,
                "pos": 0.0,
                "compound": -0.5574
            }
        },
        {
            "author": "speedbomb",
            "score": 2,
            "body": "Ok that's iinteresting but won't electric cars eventually dominate?  Serious question.",
            "created_utc": 1633552070.0,
            "sentiment": {
                "neg": 0.25,
                "neu": 0.625,
                "pos": 0.125,
                "compound": -0.1531
            }
        },
        {
            "author": "italianredditor",
            "score": 2,
            "body": "Probably just as sustainable as electric cars.",
            "created_utc": 1633572673.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "TheDutchTexan",
            "score": 1,
            "body": "So pretty much what Porsche is doing. Scrubbing CO2 out of the atmosphere and then hydrogen from water. The great thing is it takes electricity to do and if there is a wind farm production or a hydro electric dam this could be 100% sustainable. Plus? You can burn it in all combustion engines with minimal changes. Another plus? All the infrastructure is already there. I can't see the electric grid keeping pace at all.",
            "created_utc": 1633576477.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.902,
                "pos": 0.098,
                "compound": 0.8382
            }
        },
        {
            "author": "memostothefuture",
            "score": 3,
            "body": "Honestly, I struggle to stay with any Formula 1 races these days. I tried but I grew up watching Senna and Mansell and Hill and Schumacher and now it's all just even more silly rules. \n\nI'd be way more interested if they went balls-to-the-walls crazy again like in the 70's, which I missed. sure, you would see massive decrease in money as sponsors would hate this but I want to see what engineers can come up with and what drivers can sustain. \n\ncrazy 12-bangers? I'm in. insane AI-assist systems? show me what you can do. tires the size of picnic tables? let's have a feast. aero everything without ground clearance at all? uh, fun. turbo everything? alrighty. shit, for all I care let NEVs and otto engines battle it out. I want this to be a feast of brawn and brain, I want to see who can cross the finish line first, no matter what they have to do. I want the Nurburgring unlimited class in an F1 setting. \n\nI'm all for Formula 1 regulating the tracks. if people are too fast put in challenging slow sections and blind turns a'la Laguna Seca. this is not about how much of the wall drivers can take with them, this is about how much cool tech they can develop that I get in my car and how much wit and bravery I can enjoy looking to. \n\nI wished F1 was a hackaton just as much as an \"I drive harder than you\" series like nothing else.",
            "created_utc": 1633595549.0,
            "sentiment": {
                "neg": 0.105,
                "neu": 0.745,
                "pos": 0.15,
                "compound": 0.8952
            }
        },
        {
            "author": "Tooluka",
            "score": 4,
            "body": "***NET*** zero carbon emissions is such a bullshit name used everywhere. There is a ton of CO2 emissions in any such case, offset with some lies and misnamings. Unless you (company) is not actually scrubbing CO2 from the atmosphere permanently it is not zero or green or sustainable.  \n\nMauna Kea CO2 monitoring station confirms my points every year - CO2 emissions are ONLY rising at the same rate. It's not even slowing visibly.",
            "created_utc": 1633548119.0,
            "sentiment": {
                "neg": 0.085,
                "neu": 0.915,
                "pos": 0.0,
                "compound": -0.765
            }
        },
        {
            "author": "Vik1ng",
            "score": 2,
            "body": "While this stuff is cool for edge cases like racing and researching it to also be used in planes or big machinery is also valuable I really hope it doesn't get more people to believe that synthetic fuel is the future, because it just doesn't make economic sense compared to EVs. Unless maybe you drive in some very remote areas.",
            "created_utc": 1633540347.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.835,
                "pos": 0.165,
                "compound": 0.8777
            }
        },
        {
            "author": "usernameuna",
            "score": 1,
            "body": "While the people who are trying to outlaw usage of fossil fuels fly in private jets. Fucking clown world full of meaningless virtue signaling.",
            "created_utc": 1633584720.0,
            "sentiment": {
                "neg": 0.105,
                "neu": 0.794,
                "pos": 0.101,
                "compound": -0.0258
            }
        },
        {
            "author": "Ghepardo",
            "score": 1,
            "body": "Bring back natural aspiration and ditch the hybrids. Until that happens theres nothing to get excited about a simple fuel change.",
            "created_utc": 1633567697.0,
            "sentiment": {
                "neg": 0.087,
                "neu": 0.807,
                "pos": 0.106,
                "compound": 0.119
            }
        },
        {
            "author": "ChippyVonMaker",
            "score": -1,
            "body": "What a stupid virtue signal. I like F1 because of the ridiculous tech, performance and risk, but anyone that believes this effort is anything besides marketing, is a fool.",
            "created_utc": 1633613398.0,
            "sentiment": {
                "neg": 0.26,
                "neu": 0.639,
                "pos": 0.101,
                "compound": -0.6908
            }
        },
        {
            "author": "Heisenbugg",
            "score": -17,
            "body": "LOL completely missing the point. The problem is eliminating carbon dioxide production, not where do we get our Oil.",
            "created_utc": 1633541484.0,
            "sentiment": {
                "neg": 0.21,
                "neu": 0.647,
                "pos": 0.143,
                "compound": -0.168
            }
        },
        {
            "author": "None",
            "score": -1,
            "body": "[deleted]",
            "created_utc": 1633585840.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "johnknockout",
            "score": -1,
            "body": "Zero NET carbon means the hilarious carbon offset scam is in play.",
            "created_utc": 1633606946.0,
            "sentiment": {
                "neg": 0.208,
                "neu": 0.506,
                "pos": 0.287,
                "compound": 0.1027
            }
        },
        {
            "author": "None",
            "score": -52,
            "body": "[deleted]",
            "created_utc": 1633536957.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": -10,
            "body": "[deleted]",
            "created_utc": 1633540613.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[removed]",
            "created_utc": 1633539878.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "Hooch from Toto's wine cellar",
            "created_utc": 1633540821.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "weelluuuu",
            "score": 1,
            "body": "would like to see a additive for biodiesel to keep it from gumming up or gelling in cold temperatures",
            "created_utc": 1633541575.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.878,
                "pos": 0.122,
                "compound": 0.3612
            }
        },
        {
            "author": "Papapene-bigpene",
            "score": 1,
            "body": "Godbless the man who makes the chemical formula for carbon neutral-biofuel",
            "created_utc": 1633567768.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "turboash78",
            "score": 1,
            "body": "Wood fired, old school.",
            "created_utc": 1633569053.0,
            "sentiment": {
                "neg": 0.545,
                "neu": 0.455,
                "pos": 0.0,
                "compound": -0.5574
            }
        },
        {
            "author": "LiveWrestlingAnalyst",
            "score": 1,
            "body": "No such thing as 100% sustainable fuel. Even if you grow it, growing mass corn takes fertilizers, deplete the soil overtime, etc\n\nThey would be better off simply funding a large reforestation program across Europe.",
            "created_utc": 1633573305.0,
            "sentiment": {
                "neg": 0.057,
                "neu": 0.825,
                "pos": 0.119,
                "compound": 0.34
            }
        },
        {
            "author": "Cohen19",
            "score": 1,
            "body": "F1 should go back to using 121 octane fuel that was carcinogenic.",
            "created_utc": 1633589669.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "luccasmenoncin",
            "score": 1,
            "body": "Here we run cars on ethanol since the 70s",
            "created_utc": 1633609805.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Professional_B638",
            "score": 1,
            "body": "Now this is news I like to hear.",
            "created_utc": 1633616991.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.737,
                "pos": 0.263,
                "compound": 0.3612
            }
        },
        {
            "author": "totalnewbie",
            "score": 1,
            "body": "The biggest problem right now isn't with technology, it's with regulation.\n\nRegulators only recognize tank-to-wheel emissions - that is, they measure the exhaust coming out of your tailpipe and make a determination based on that alone. So long as you're BURNING fuel, whether it's hydrocarbons or even hydrogen (there's still some emissions due to lubricating oils and just natural NOx formation), it's not zero emissions - which is another important distinction regulators are going to have to make (whether they target very, very low or zero emissions).\n\nBut as regulations are written right now, you could have the most efficient fuel production method in the world that takes 10x CO2 out of the atmosphere than it puts out when it's burned and uses only magic fairy dust for energy, those cars are STILL not going to be allowed current proposed future regulations because the benefits of the fuel production cycle is not recognized at the vehicle-emission level.\n\nThat said, if that technology existed, I'm sure regulators would be extremely likely to amend proposed regulations to take advantage of that. But, unfortunately, that doesn't exist and what we have now are still not-very-efficient ways of producing synthetic fuel which, although the analysis shows they are cleaner than conventional petroleum fuel, it's not quite so easy to just say \"Yeah, let's do it.\"\n\nSo if regulators aren't prepared to amend regulations to move vehicle emissions to a well-to-wheel (i.e. consider the fuel production cycle) basis then there is very little incentive for anyone to invest heavily in that technology or to bring it to market on a large scale because you'd be making a huge investment for cars that will soon (15-20 years) not be able to be legally sold or driven. And it doesn't mean 15-20 years of vehicle sales because you still have to develop the technology, ramp up production, and roll everything out, which is by itself going to take years.\n\nFinally, combustion is combustion. Removing CO2 is good and all, but there will always be the matter of NOx, particulate matter, and other forms of emissions that is not CO2 that you cannot avoid with combustion. You can remove most of it with aftertreatment but you still have cold-start emissions (which already makes up the bulk of emissions) and emissions due to catalyst degradation, etc. So are we deciding that we're okay with that? Or do we want to target zero? Another difficult question for regulators to decide which will have a huge impact on the idea of renewable fuels for ICE.",
            "created_utc": 1633627758.0,
            "sentiment": {
                "neg": 0.042,
                "neu": 0.843,
                "pos": 0.115,
                "compound": 0.984
            }
        },
        {
            "author": "F1_Geek",
            "score": 1,
            "body": "F1 has the capability of changing car technology as we know it on its head.\n\nHope they can influence some great change from this.",
            "created_utc": 1633631386.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.759,
                "pos": 0.241,
                "compound": 0.7906
            }
        },
        {
            "author": "Clareth_GIF",
            "score": 1,
            "body": "I think speed is overrated in motorsports. Vehicles are as fast as it is safe for a human to drive them, and it’s been that way for a very long time now. Cars can go way faster, but it won’t be safe for drivers to compete in them anymore at those speeds. The various world series should now work on affordability and environmental sustainability. And stop beating the dead horse of absolute speeds.",
            "created_utc": 1634116112.0,
            "sentiment": {
                "neg": 0.147,
                "neu": 0.786,
                "pos": 0.067,
                "compound": -0.8381
            }
        },
        {
            "author": "Slimy_Shart_Socket",
            "score": 296,
            "body": "NASCAR Fans\n\nBubba had been making this stuff in his shed for years! You mean we can race on it??",
            "created_utc": 1633541855.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 121,
            "body": "[deleted]",
            "created_utc": 1633542658.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "gHHqdm5a4UySnUFM",
            "score": 104,
            "body": "One for you, one for me",
            "created_utc": 1633538502.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "SuperKettle",
            "score": 8,
            "body": "Kimi retired in the worst moment possible",
            "created_utc": 1633547168.0,
            "sentiment": {
                "neg": 0.406,
                "neu": 0.594,
                "pos": 0.0,
                "compound": -0.6249
            }
        },
        {
            "author": "HuudaHarkiten",
            "score": 6,
            "body": "[kekekekeke ruuspäri ruuspäri](https://www.youtube.com/watch?v=8chhQ2ZPT0o)",
            "created_utc": 1633543709.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Papapene-bigpene",
            "score": 2,
            "body": "Naw it’s just the stuff that kimi raikonen drinks when he’s thirsty",
            "created_utc": 1633567814.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "421p",
            "score": 138,
            "body": "Mazepin will change his name to jackson storm",
            "created_utc": 1633539208.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "YODA0786",
            "score": 48,
            "body": "It's gonna be funny if the cars start exploding because someones trying to prove Allinol is not safe.",
            "created_utc": 1633539464.0,
            "sentiment": {
                "neg": 0.113,
                "neu": 0.751,
                "pos": 0.136,
                "compound": 0.1265
            }
        },
        {
            "author": "railbeast",
            "score": 13,
            "body": "Allinol, allinol is not that bad of a name.",
            "created_utc": 1633554397.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.737,
                "pos": 0.263,
                "compound": 0.431
            }
        },
        {
            "author": "Yestromo",
            "score": 6,
            "body": "Allinol is all we are.",
            "created_utc": 1633553011.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "rusticoaf",
            "score": 1,
            "body": "Ka-chow",
            "created_utc": 1633605293.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "EatKillFuck",
            "score": 178,
            "body": "I say make it a volume rule instead of cylinder. You can have a V8, V10, or V12 as long as its no larger than 3.0 liters. Or 2.0 liter w/ turbos",
            "created_utc": 1633542741.0,
            "sentiment": {
                "neg": 0.066,
                "neu": 0.934,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "MartiniPolice21",
            "score": 8,
            "body": "The engine size is more cost related than emissions",
            "created_utc": 1633552840.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "davewritescode",
            "score": 4,
            "body": "If the rumors are to be believed and we’re really getting 2 stroke synthetic fuel engines than I suspect  a V6 firing twice as often is going to sound suspiciously like a V12",
            "created_utc": 1633560474.0,
            "sentiment": {
                "neg": 0.188,
                "neu": 0.747,
                "pos": 0.064,
                "compound": -0.5859
            }
        },
        {
            "author": "Some_Weeaboo",
            "score": 4,
            "body": "The V8's and V12's sounded better",
            "created_utc": 1633555413.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.633,
                "pos": 0.367,
                "compound": 0.4404
            }
        },
        {
            "author": "ZenithRepairman",
            "score": 1,
            "body": "Bring back the fucking V12.",
            "created_utc": 1633615018.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "slushboxer",
            "score": 1,
            "body": "I support a bill to ban all combustion engines that aren’t V10s. They don’t even have to be high output, give me a 1.5L V10 that makes 150hp in a Civic and screams like a banshee on helium and I’ll be happy.",
            "created_utc": 1633628519.0,
            "sentiment": {
                "neg": 0.112,
                "neu": 0.716,
                "pos": 0.172,
                "compound": 0.4767
            }
        },
        {
            "author": "220mtm",
            "score": 114,
            "body": "Zero chance of that happening, also Porsche isn't doing this out of the goodness of their hearts, they're doing this so they can stay relevant and not have their 911 lineup compete with Hyundai EV crossovers",
            "created_utc": 1633541794.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.78,
                "pos": 0.22,
                "compound": 0.8519
            }
        },
        {
            "author": "morelsupporter",
            "score": 458,
            "body": "they’re not doing it to reduce emissions, they’re doing it so they can keep using and promoting internal combustion",
            "created_utc": 1633537776.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.878,
                "pos": 0.122,
                "compound": 0.3612
            }
        },
        {
            "author": "pursuer_of_simurg",
            "score": 646,
            "body": "The point of formula 1 (and more importantly le mans) is to test these kind of technologies to trickle down to real world.",
            "created_utc": 1633535887.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.895,
                "pos": 0.105,
                "compound": 0.3804
            }
        },
        {
            "author": "None",
            "score": 119,
            "body": "The fact that the synthetic fuel emits no net carbon emissions (no NEW co2 introduced into the atmosphere) means keeping ICE engines around and viable much longer. Yes, over time, we will gradually transition more and more market share to EV, but this is a solid viable short to intermediate solution to maintain, practically, a predominantly ICE vehicle population. Also, most consumer vehicle technology is vetted through Motorsport.",
            "created_utc": 1633536714.0,
            "sentiment": {
                "neg": 0.022,
                "neu": 0.863,
                "pos": 0.116,
                "compound": 0.704
            }
        },
        {
            "author": "CatoMulligan",
            "score": 12,
            "body": "Well, about that...there are pilot programs in various countries already to produce synthetic aviation fuel that is also carbon-neutral. \n\n[Here's](https://www.bbc.com/news/business-49725741) one article.  And [here](https://airlinegeeks.com/2021/02/09/klm-operates-world-s-first-flight-using-synthetic-kerosene/) is another.  And [here's](https://www.shell.com/business-customers/aviation/the-future-of-energy/sustainable-aviation-fuel/synthetic-kerosene.html) one more.\n\nAlso, Porsche is working on a synthetic fuel with similar intent.",
            "created_utc": 1633543832.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.95,
                "pos": 0.05,
                "compound": 0.2732
            }
        },
        {
            "author": "colin_staples",
            "score": 20,
            "body": "I think the idea is that they use F1 as a development ground and test bed for this synthetic fuel, and if it is successful then it can be rolled out to the wider world.\n\nHypothetically we could end up with all non-electric cars and planes running on synthetic fuel.\n\n*If* it is technically and economically viable.",
            "created_utc": 1633539366.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.936,
                "pos": 0.064,
                "compound": 0.5859
            }
        },
        {
            "author": "LeveragedTiger",
            "score": 3,
            "body": "Yup. Need BEV and FCEV ground transportation to start.\n\nLord knows decarbonized air travel is still decades away. I read a stat that the entire on-track fuel consumption of F1 cars (practice, qualy, and races) produces less carbon emissions than ONE transatlantic flight. That blew my mind.",
            "created_utc": 1633561106.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Daiephir",
            "score": 8,
            "body": "F1 has been carbon neutral since '97. https://www.reddit.com/r/formula1/comments/9u28vc/til_that_fia_has_purchased_credits_to_offset/",
            "created_utc": 1633543769.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "hughesj94",
            "score": 7,
            "body": "If the series went electric, they'd still need to somehow get the vehicles to the track still",
            "created_utc": 1633538084.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Beachdaddybravo",
            "score": 2,
            "body": "That’s not the point at all of F1. They exist to test as much new tech as possible, and as a result we see tech that trickles down into road cars eventually. For example, an F1 engine is by a significant margin the most efficient internal combustion engined car there is. They squeeze out as much power as possible from every drop. Since it’s not feasible to just shut of every gas pump on the planet overnight, we need to keep working on efficiency while phasing in new solutions over time.",
            "created_utc": 1633545613.0,
            "sentiment": {
                "neg": 0.022,
                "neu": 0.873,
                "pos": 0.106,
                "compound": 0.7346
            }
        },
        {
            "author": "MrDankky",
            "score": 1,
            "body": "Did you even read the article?",
            "created_utc": 1633552793.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Bau5_Sau5",
            "score": 0,
            "body": "I think you’re missing the point entirely",
            "created_utc": 1633560613.0,
            "sentiment": {
                "neg": 0.268,
                "neu": 0.732,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "Starky513",
            "score": 0,
            "body": "It's not about that.",
            "created_utc": 1633916742.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "tropical_fusion",
            "score": -1,
            "body": "Optics",
            "created_utc": 1633546696.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Some_Weeaboo",
            "score": -1,
            "body": "The amount you're missing the point of this is more baffling than the 3 mufflers on an old car",
            "created_utc": 1633555485.0,
            "sentiment": {
                "neg": 0.109,
                "neu": 0.891,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "topherhead",
            "score": 1,
            "body": "How are you liking the 718?  I'm currently saving and on the in general. But if I do go 718, I'm also not sure between the GTS and the GT4.  The GTS being tuned to be slightly torquey-er sounds nice.  \n\nBut additionally the fact lots of options aren't available on the GT4 at any cost is a little worrisome for me.  I don't actually need anything crazy but like, I want the keyless entry, and I've grown accustomed to automatic wipers.  And Bluetooth audio.  Those are about all i need but it looks like you can't get keyless entry on the GT4 at all?  Maybe i should just talk to a dealer about it.\n\nAlso how are you finding the long gear ratios?  The only complaint anyone ever has about the GT4 is the gear ratios.",
            "created_utc": 1633578500.0,
            "sentiment": {
                "neg": 0.075,
                "neu": 0.835,
                "pos": 0.09,
                "compound": 0.2939
            }
        },
        {
            "author": "deja_geek",
            "score": 26,
            "body": "The problem isn't ethanol, it's that ethanol mostly made out of corn.  There are far better plants that can be used to produce ethanol, but since the US government heavily subsidizes corn, corn is what the US uses.",
            "created_utc": 1633553372.0,
            "sentiment": {
                "neg": 0.046,
                "neu": 0.905,
                "pos": 0.049,
                "compound": 0.0258
            }
        },
        {
            "author": "thesleepofdeath",
            "score": 28,
            "body": "Holy shit someone in /r/cars understands ethanol production! Its probably not relevant to this discussion, but the other thing that gets me about ethanol is that corn is a terrible plant to use for it. I was recently reading that we've know for decades that willow and poplar can produce up to 10 times as much bio mass on a similar plot of land with less inputs. But farmers are already setup for corn growing so lets just do that...",
            "created_utc": 1633552162.0,
            "sentiment": {
                "neg": 0.079,
                "neu": 0.898,
                "pos": 0.024,
                "compound": -0.69
            }
        },
        {
            "author": "danbfree",
            "score": 6,
            "body": "You write all that but the article is not about using ethanol but capturing carbon and using that to make fuel so it's no new additional carbon from the ground. They will be taking what's in the air already,  make fuel from it, then putting it back in the air hence making it carbon neutral.",
            "created_utc": 1633564558.0,
            "sentiment": {
                "neg": 0.056,
                "neu": 0.944,
                "pos": 0.0,
                "compound": -0.4969
            }
        },
        {
            "author": "rlyx6x",
            "score": 13,
            "body": "\\^\\^\\^\\^\\^\\^\n\n&#x200B;\n\nIf you think Biofuels are the green option right now you're mistaken. I highly recommend Real Engineering's video on it. I hope the process improves in the future, because we are destroying a lot of forests for this \n\n&#x200B;\n\nhttps://youtu.be/OpEB6hCpIGM",
            "created_utc": 1633544615.0,
            "sentiment": {
                "neg": 0.118,
                "neu": 0.717,
                "pos": 0.165,
                "compound": 0.3384
            }
        },
        {
            "author": "None",
            "score": 2,
            "body": "[deleted]",
            "created_utc": 1633555164.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 2,
            "body": "From a climate standpoint you would be much better off doing away with ethanol for fuel and using that farmland for CO2 biosequestration with hemp.",
            "created_utc": 1633592158.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.892,
                "pos": 0.108,
                "compound": 0.4404
            }
        },
        {
            "author": "None",
            "score": 0,
            "body": "True, now imagine how many kgs of vegetables we need to produce to produce 1 kg of meat.",
            "created_utc": 1633545007.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.859,
                "pos": 0.141,
                "compound": 0.4215
            }
        },
        {
            "author": "ToastyMozart",
            "score": 1,
            "body": "It'd be nice if wide-scale hydroponics could get started on it to reduce some of those issues, but I guess the initial cost is still too high.",
            "created_utc": 1633561853.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.932,
                "pos": 0.068,
                "compound": 0.2263
            }
        },
        {
            "author": "jawnlerdoe",
            "score": 67,
            "body": "There are countless products made from fossil fuels that will still because from them because they HAVE to be made with them. It’s pretty hard to source organic building blocks from non-petroleum feedstocks.",
            "created_utc": 1633548150.0,
            "sentiment": {
                "neg": 0.09,
                "neu": 0.822,
                "pos": 0.088,
                "compound": 0.2263
            }
        },
        {
            "author": "spicybright",
            "score": 5,
            "body": "Heavy taxes and tax credit incentives will drive industry towards clean fuel cheaper than fossil fuel.\n\nIt sucks, but I can't see any other way.",
            "created_utc": 1633553362.0,
            "sentiment": {
                "neg": 0.062,
                "neu": 0.749,
                "pos": 0.189,
                "compound": 0.3716
            }
        },
        {
            "author": "D4rkr4in",
            "score": 4,
            "body": ">consumers overwhelmingly choose cheaper products over more expensive products.\n\nwell yeah, not all of us can be Whole Foods treehugger trust fund babies",
            "created_utc": 1633556384.0,
            "sentiment": {
                "neg": 0.053,
                "neu": 0.67,
                "pos": 0.277,
                "compound": 0.7479
            }
        },
        {
            "author": "Gilclunk",
            "score": 1,
            "body": "But so what? You can continue to make plastics and chemicals from oil if you want-- it doesn't go into the air, so it's not relevant from a climate change perspective.",
            "created_utc": 1633560452.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.954,
                "pos": 0.046,
                "compound": 0.1154
            }
        },
        {
            "author": "ApoptosisPending",
            "score": 1,
            "body": "Who gives a duck about that. We obviously can't control it but if we can have our hobby then it's good enough for me. Plastic, for example, which is synthesized with petroleum will never be done away with so long as we still need to package things because like you said it's cheaper",
            "created_utc": 1633584331.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.878,
                "pos": 0.122,
                "compound": 0.7964
            }
        },
        {
            "author": "Stankia",
            "score": 0,
            "body": "Yeah I'm fucking tired of it, the cars are always taking the brunt of everything.",
            "created_utc": 1633555083.0,
            "sentiment": {
                "neg": 0.174,
                "neu": 0.707,
                "pos": 0.12,
                "compound": -0.2484
            }
        },
        {
            "author": "RedSteadEd",
            "score": 4,
            "body": "This could be step one in fixing the problem though. Limit flights where possible, develop a fleet of electric semis... those are the only two that immediately come to my mind, but maybe this will become part of a trend.",
            "created_utc": 1633545839.0,
            "sentiment": {
                "neg": 0.045,
                "neu": 0.955,
                "pos": 0.0,
                "compound": -0.2144
            }
        },
        {
            "author": "CoyotePuncher",
            "score": 8,
            "body": "Yes, but unfortunately regulators have decided that cars are an easy thing to go after. I will never be made to \"feel bad\" about car emissions because they just do not matter. EVs arent going to save the planet anytime soon.",
            "created_utc": 1633552114.0,
            "sentiment": {
                "neg": 0.234,
                "neu": 0.659,
                "pos": 0.107,
                "compound": -0.7719
            }
        },
        {
            "author": "MajorProblem50",
            "score": 2,
            "body": "This isn't an \"either/or\" problem. Converting cars to no longer being dependant on fossil fuel is easily the most important step.",
            "created_utc": 1633552480.0,
            "sentiment": {
                "neg": 0.085,
                "neu": 0.655,
                "pos": 0.26,
                "compound": 0.5501
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "The problem is we dont have enough ground to grow corn and canola (yeah, biodiesel is also a thing) and feed people and feed the livestock. Ethanol is in you regular gas today, about 5 to 8% most of the times so its not like we dont know it can be used as fuel, but there is just too many cars to fuel. Meybe if we stop eating meat we could drive ice cars on biofuels but i dont think its possible in near future.",
            "created_utc": 1633605867.0,
            "sentiment": {
                "neg": 0.071,
                "neu": 0.911,
                "pos": 0.018,
                "compound": -0.5771
            }
        },
        {
            "author": "None",
            "score": 5,
            "body": "> Technically they could already achieve this by planting a couple hundred thousand trees per race.\n\nThey literally do this already, F1 has been carbon neutral for over 20 years",
            "created_utc": 1633570477.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "MartiniPolice21",
            "score": 0,
            "body": "There's going to be a power trade off, but will make up the difference with more powerful electric apparently",
            "created_utc": 1633552895.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.813,
                "pos": 0.187,
                "compound": 0.6297
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "Hydrogen combustion creates heavy NOx pollution which is a much worse greenhouse gas than CO2. The power output per displacement is terrible as well. In a world where EVs are getting faster and faster who is going to want a technology that is abjectly worse than the current one being replaced?",
            "created_utc": 1633592480.0,
            "sentiment": {
                "neg": 0.156,
                "neu": 0.753,
                "pos": 0.092,
                "compound": -0.7003
            }
        },
        {
            "author": "MagneticGray",
            "score": 3,
            "body": "I believe Qatar, Saudi Arabia and Abu Dhabi are in the midst of restructuring their economies to be much less dependent on the fossil fuel industry and at least Saudi Arabia is [investing heavily](https://www.climatechangenews.com/2021/03/31/saudi-arabia-aims-50-renewable-energy-2030-backs-huge-tree-planting-initiative/) in clean energy initiatives. \n\nAlso, if you look at the Twitter feeds of companies like Shell you would think that they’re exclusively “clean energy” companies already because it’s the only thing they tweet about these days.\n\nIf any of those countries or companies fights with F1 over this announcement then it would certainly fuck up the narrative they’re all trying to push recently.",
            "created_utc": 1633549152.0,
            "sentiment": {
                "neg": 0.058,
                "neu": 0.851,
                "pos": 0.091,
                "compound": 0.3612
            }
        },
        {
            "author": "gumol",
            "score": 80,
            "body": "> Just seems like hot air\n\nwhy? \n\nIsn't creating hot air the point of ICE engines anyway?",
            "created_utc": 1633536874.0,
            "sentiment": {
                "neg": 0.096,
                "neu": 0.76,
                "pos": 0.145,
                "compound": 0.2434
            }
        },
        {
            "author": "acideater",
            "score": 7,
            "body": "Why is it hot air? Sustainability of a fuel is no problem when you x virtually have unlimited cost per gallon. \n\n$100 gallon of fuel is nothing for a F1 team.",
            "created_utc": 1633541142.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.93,
                "pos": 0.07,
                "compound": 0.3089
            }
        },
        {
            "author": "noisymime",
            "score": 9,
            "body": "One day the tech will probably get there, but it's a long, long way off F1 levels at the moment. No F1 fan would want to see it switch to something like Formula E in its current state, it's a snooze fest (sorry FE fans)",
            "created_utc": 1633554534.0,
            "sentiment": {
                "neg": 0.13,
                "neu": 0.778,
                "pos": 0.091,
                "compound": -0.2484
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "it’s more of an issue of limiting costs and competitive parity rather than speed or safety.  yes in an ideal world manufacturer would throw in unlimited money to develop unique cars that provide entertaining races but that’s not what would happen.",
            "created_utc": 1633610905.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.796,
                "pos": 0.204,
                "compound": 0.7391
            }
        },
        {
            "author": "danbfree",
            "score": 6,
            "body": "> Unless you (company) is not actually scrubbing CO2 from the atmosphere permanently it is not zero or green or sustainable.\n\nThat's exactly what the article says they are doing. Scrubbing carbon from the air, making fuel from it and then the carbon going back into the air when used.",
            "created_utc": 1633564995.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 10,
            "body": "Or simply want freedom from the grid in general.",
            "created_utc": 1633541544.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.56,
                "pos": 0.44,
                "compound": 0.6705
            }
        },
        {
            "author": "danbfree",
            "score": 1,
            "body": "But until we get more renewable and clean energy sources, EV's are being charged a lot of the time by dirty energy anyway. So why not look at alternatives to any kind of carbon neutral energy that will work in ICE vehicles? I mean, yes, it's more likely and important to create our energy itself carbon neutral but it doesn't hurt to research solutions from the other side either.",
            "created_utc": 1633564866.0,
            "sentiment": {
                "neg": 0.066,
                "neu": 0.619,
                "pos": 0.315,
                "compound": 0.9683
            }
        },
        {
            "author": "None",
            "score": -1,
            "body": "Sure but just because those people exist doesn't mean we still don't try to mitigate the damage.",
            "created_utc": 1633593124.0,
            "sentiment": {
                "neg": 0.205,
                "neu": 0.716,
                "pos": 0.079,
                "compound": -0.5647
            }
        },
        {
            "author": "junkmiles",
            "score": 17,
            "body": ">LOL completely missing the point. The problem is eliminating carbon dioxide production\n\nDid you read the article?\n\n>but unlike a gasoline engine, there is no net carbon dioxide emitted. As F1 Chief Technical Officer Pat Symonds explained: \"We're not producing any CO2 that is not already in the atmosphere at the moment; we're taking it out of the atmosphere, we're using it, and we're putting it back in the atmosphere.\"",
            "created_utc": 1633543224.0,
            "sentiment": {
                "neg": 0.086,
                "neu": 0.884,
                "pos": 0.03,
                "compound": -0.4819
            }
        },
        {
            "author": "Sailfish35",
            "score": -6,
            "body": "The point is just ridiculous virtue signaling.",
            "created_utc": 1633541786.0,
            "sentiment": {
                "neg": 0.243,
                "neu": 0.485,
                "pos": 0.272,
                "compound": 0.0772
            }
        },
        {
            "author": "gumol",
            "score": 44,
            "body": "> it still produces green house gasses\n\noverall it doesn't\n\n> emissions that are harmful to humans.\n\nyep, but it's always a step forward. Anyway, current F1 engines have terrible NOx emissions because of the intense focus on fuel efficiency.",
            "created_utc": 1633537113.0,
            "sentiment": {
                "neg": 0.089,
                "neu": 0.775,
                "pos": 0.136,
                "compound": 0.0387
            }
        },
        {
            "author": "ellWatully",
            "score": 9,
            "body": "The whole principle behind this type of fuel is to capture carbon emissions to create hydrocarbons that can be burned again without adding carbon into the atmosphere. It'll take careful planning to make that process carbon neutral, but burning the fuel will not produce any green house gasses.",
            "created_utc": 1633539489.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.942,
                "pos": 0.058,
                "compound": 0.2144
            }
        },
        {
            "author": "SeeminglyUselessData",
            "score": 2,
            "body": "I like harming humans, it makes cool noises",
            "created_utc": 1633539718.0,
            "sentiment": {
                "neg": 0.269,
                "neu": 0.373,
                "pos": 0.358,
                "compound": 0.0516
            }
        },
        {
            "author": "megacookie",
            "score": 14,
            "body": "Show me a 100kg (or hell, even 500kg) battery that can allow an electric F1 car to complete a 300km race while putting out up to 1000hp. Until that sort of battery technology exists, pure electric power simply isn't good enough yet for F1. \n\nIf you want to see electric formula cars race, there's Formula E for now. They are quite fast and capable themselves, but they make about 1/3 the power of an F1 car and race less than 1/3 the distance.",
            "created_utc": 1633542208.0,
            "sentiment": {
                "neg": 0.052,
                "neu": 0.896,
                "pos": 0.052,
                "compound": -0.2432
            }
        },
        {
            "author": "saint__ultra",
            "score": 13,
            "body": "Then you'd have invented Formula E, which is a different motorsport than F1. \n\nthis is a real \"if my grandmother had wheels, she'd be a bicycle\" moment. https://www.youtube.com/watch?v=A-RfHC91Ewc",
            "created_utc": 1633541216.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "elbers",
            "score": -1,
            "body": "They should but formula E has an exclusivity deal until 2050 for being the only fia motorsport powered by electric motors. When electric was discussed sometime ago it was rejected mostly cause \"muh sound\" This is basically F1's bid to stay alive and relevant. Even though you find a single fan that wants to hear that. Alive might be overstating it, but what's known as the world's most legendary racing series might not be for much longer.",
            "created_utc": 1633541838.0,
            "sentiment": {
                "neg": 0.051,
                "neu": 0.837,
                "pos": 0.112,
                "compound": 0.6486
            }
        },
        {
            "author": "AutoModerator",
            "score": -4,
            "body": "If your post involves politics AND CARS, please consider submitting to /r/CarsOffTopic.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cars) if you have any questions or concerns.*",
            "created_utc": 1633539917.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.881,
                "pos": 0.119,
                "compound": 0.5574
            }
        },
        {
            "author": "Mental_Medium3988",
            "score": 33,
            "body": "[Boss asks if Jesse remembers how they once ran out of gas and Jesse used his moonshine to run Boss’ car](https://dukesofhazzard.fandom.com/wiki/High_Octane) they made an episode of duke of hazzard about it. im sure nascar fans know.",
            "created_utc": 1633560854.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.938,
                "pos": 0.062,
                "compound": 0.3182
            }
        },
        {
            "author": "spongebob_meth",
            "score": 139,
            "body": "Just don't tell NASCAR fans that its ethanol, the evil obama liquid that killed their firstborn and turns the frogs gay",
            "created_utc": 1633550646.0,
            "sentiment": {
                "neg": 0.319,
                "neu": 0.681,
                "pos": 0.0,
                "compound": -0.872
            }
        },
        {
            "author": "cmmgreene",
            "score": 3,
            "body": "Idk, Nascar fans are well aware of their moonshine lineage, there's been more than a few shine runners that used a bit of shine to run the cars on.",
            "created_utc": 1633557671.0,
            "sentiment": {
                "neg": 0.046,
                "neu": 0.885,
                "pos": 0.069,
                "compound": 0.1779
            }
        },
        {
            "author": "TheThunderbird",
            "score": 81,
            "body": "They’ve already moved on from fermented biofuel to a sustainable amphetamine-based alternative.",
            "created_utc": 1633543412.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "weelluuuu",
            "score": 44,
            "body": "3 for the car",
            "created_utc": 1633541419.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "DrunkenPenguinRacing",
            "score": 55,
            "body": "Storm was fast though...",
            "created_utc": 1633540137.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Page_Won",
            "score": 10,
            "body": "Allinol we're just a, 'nother brick in the wall.",
            "created_utc": 1633567151.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "bstyledevi",
            "score": 1,
            "body": "Alan Alda's all we are?",
            "created_utc": 1633556570.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "italia06823834",
            "score": 129,
            "body": "I do wish the regs were a bit more open like that.  Displacement rule and fuel flow/fuel amount limits.  Could see some very interesting difference like we had in WEC a few years back.",
            "created_utc": 1633544060.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.728,
                "pos": 0.272,
                "compound": 0.8816
            }
        },
        {
            "author": "uberdosage",
            "score": 57,
            "body": "A 2.0L V12 Twin Turbo???",
            "created_utc": 1633543636.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "asshatnowhere",
            "score": 11,
            "body": "Sadly won't happen to control costs and help make the sport more competitive",
            "created_utc": 1633553843.0,
            "sentiment": {
                "neg": 0.16,
                "neu": 0.572,
                "pos": 0.268,
                "compound": 0.2247
            }
        },
        {
            "author": "karankshah",
            "score": 11,
            "body": "3 liter W3000. That's right - four banks of 750 single CC bores with tiny little cylinders twitching up and down. \n\nWill it work? We won't know till we try",
            "created_utc": 1633561307.0,
            "sentiment": {
                "neg": 0.073,
                "neu": 0.927,
                "pos": 0.0,
                "compound": -0.3182
            }
        },
        {
            "author": "RobertM525",
            "score": 3,
            "body": "Sadly, they would all just optimize themselves into having the exact same engine configuration. Like how almost all production cars are ending up around 500 cc per ~~liter~~cylinder.\n\nThe FIA would have to find some way to deliberately incentivize different engine configurations for different teams. And then balance of performance them to make sure that they are competitive with one another. People would hate it.",
            "created_utc": 1633571329.0,
            "sentiment": {
                "neg": 0.086,
                "neu": 0.785,
                "pos": 0.129,
                "compound": 0.296
            }
        },
        {
            "author": "Clareth_GIF",
            "score": 1,
            "body": "I can’t find the source for you right now, but it was always a volume rule. 3 litres to be exact, down from 3.5 litres after the FIA banned turbos. The builders just figured out in the early 90s that a V10 will give a lighter weight but with most of the power of a V12. That’s how the whole grid ended up using V10’s.",
            "created_utc": 1634116367.0,
            "sentiment": {
                "neg": 0.059,
                "neu": 0.941,
                "pos": 0.0,
                "compound": -0.6124
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "that and marketing.",
            "created_utc": 1633609454.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Dr_Death_Defy24",
            "score": 6,
            "body": "Unfortunately the twin stroke idea is almost certainly dead. I actually think it's the best case moving forward for Formula 1, but there's one massive group that disagrees: the actual engine manufacturers. Most of them want to develop technology that can eventually be brought down to road cars, and nobody is clamoring for a two-stroke car, so it's a no-go.",
            "created_utc": 1633569238.0,
            "sentiment": {
                "neg": 0.107,
                "neu": 0.804,
                "pos": 0.089,
                "compound": -0.2873
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[deleted]",
            "created_utc": 1633586626.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "ZenAndTheArtOfTC",
            "score": 3,
            "body": "Haha, this guy.",
            "created_utc": 1633556712.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.4,
                "pos": 0.6,
                "compound": 0.4588
            }
        },
        {
            "author": "waszumfickleseich",
            "score": 36,
            "body": "> and not have their 911 lineup compete with Hyundai EV crossovers\n\nthey wouldn't anyways. there's way more to Porsche cars than 0-100 times on a straight lol",
            "created_utc": 1633548874.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.847,
                "pos": 0.153,
                "compound": 0.5719
            }
        },
        {
            "author": "None",
            "score": 62,
            "body": "What do you mean zero chance? There is nothing stopping the fuel being used for other vehicles.",
            "created_utc": 1633543683.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.813,
                "pos": 0.187,
                "compound": 0.3493
            }
        },
        {
            "author": "CoyotePuncher",
            "score": 1,
            "body": "You say this like its a bad thing.",
            "created_utc": 1633551823.0,
            "sentiment": {
                "neg": 0.283,
                "neu": 0.485,
                "pos": 0.232,
                "compound": -0.1593
            }
        },
        {
            "author": "digitalcriminal",
            "score": 1,
            "body": "Ahem…\n\nhttps://www.caranddriver.com/news/a35577611/porsche-synthetic-efuel-clean-emissions-testing/",
            "created_utc": 1633572178.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "digitalcriminal",
            "score": 1,
            "body": "Ahem…\n\nhttps://www.caranddriver.com/news/a35577611/porsche-synthetic-efuel-clean-emissions-testing/",
            "created_utc": 1633572190.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "One_Wheel_Drive",
            "score": 95,
            "body": "Exactly. If emissions was a priority then they'd likely work to phase out ICE altogether.",
            "created_utc": 1633544819.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Stankia",
            "score": 13,
            "body": "What's wrong with using regular race gas? That shit ain't going anywhere any time soon.",
            "created_utc": 1633554776.0,
            "sentiment": {
                "neg": 0.34,
                "neu": 0.66,
                "pos": 0.0,
                "compound": -0.7717
            }
        },
        {
            "author": "BannedFromRcars",
            "score": 291,
            "body": "Exactly, they mention that key transportation they use (planes, trucks, etc.) would hopefully also be able to use these fuels down the line.",
            "created_utc": 1633536406.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.891,
                "pos": 0.109,
                "compound": 0.4019
            }
        },
        {
            "author": "Ftpini",
            "score": 6,
            "body": "It’s not. That is purely a side benefit. It’s about ego. Always has been and always will be.",
            "created_utc": 1633557411.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.839,
                "pos": 0.161,
                "compound": 0.5046
            }
        },
        {
            "author": "Tooluka",
            "score": 11,
            "body": "Except that is seems that KERS+ICE tech was specifically selected as to be least possibly usable technology in the real world of commuter cars.",
            "created_utc": 1633548519.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "LowSkyOrbit",
            "score": 4,
            "body": "For what two or three more generations? EV is the desired future with most manufacturers. Too few want regular cars now. Ford wouldn't have built a $20k Hybrid Truck if they could sell a Hybrid Fiesta or Focus",
            "created_utc": 1633554316.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.843,
                "pos": 0.157,
                "compound": 0.6705
            }
        },
        {
            "author": "DEATH-BY-CIRCLEJERK",
            "score": 27,
            "body": "Is that really the \"point\"? Seems like more of a byproduct",
            "created_utc": 1633539984.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.8,
                "pos": 0.2,
                "compound": 0.3612
            }
        },
        {
            "author": "Respectable_Answer",
            "score": 2,
            "body": "The point is to make entertainment industry money",
            "created_utc": 1633555691.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.714,
                "pos": 0.286,
                "compound": 0.4215
            }
        },
        {
            "author": "snbrd512",
            "score": 11,
            "body": "... You mean like EV?",
            "created_utc": 1633538822.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.615,
                "pos": 0.385,
                "compound": 0.3612
            }
        },
        {
            "author": "Big-Baby-Jesus-",
            "score": -72,
            "body": "There is no chance that synthetic fuels will power normal passenger vehicles.\n\nEdit- I'm sorry that the laws of physics upset you people so much.",
            "created_utc": 1633536904.0,
            "sentiment": {
                "neg": 0.204,
                "neu": 0.796,
                "pos": 0.0,
                "compound": -0.5632
            }
        },
        {
            "author": "Pixelplanet5",
            "score": 1,
            "body": "the thing is synthetic fuel is not something that will trickle down to the average person as it will be too expensive regardless of what they do.\n\nFormular E would to more of what will trickle down to the average person but then again realistically most advancements we have on the road today are from race series that are closer to normal cars like GT2, GT3, GT4 or the AM classes at Lemans.\n\nBut all of these will need to change their regulations or create new classes for alternative vehicles as outside of Lemans there is still basically nothing that is hybrid at all and that would be a first step to something that the world needs in the future.",
            "created_utc": 1633590389.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.952,
                "pos": 0.048,
                "compound": 0.7096
            }
        },
        {
            "author": "ChiggaOG",
            "score": 53,
            "body": "There's going to be a small percentage of cars by collectors using gasoline. The majority of gasoline will still be used by boats and airplanes.",
            "created_utc": 1633540450.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Bensemus",
            "score": 40,
            "body": "This fuel won't be available to average people. No e-fuel has plans to be distributed to pumps. It's all being created to keep a few gas cars running for people who can afford what will be expensive fuel.",
            "created_utc": 1633540672.0,
            "sentiment": {
                "neg": 0.055,
                "neu": 0.896,
                "pos": 0.05,
                "compound": -0.0516
            }
        },
        {
            "author": "muggsybeans",
            "score": 2,
            "body": "> The fact that the synthetic fuel emits no net carbon emissions (no NEW co2 introduced into the atmosphere) means keeping ICE engines around and viable much longer.\n\nThis would make ICE actually more environmentally friendly than EVs. This is why we should be shifting to hybrids and not EVs.",
            "created_utc": 1633549994.0,
            "sentiment": {
                "neg": 0.041,
                "neu": 0.894,
                "pos": 0.065,
                "compound": 0.3134
            }
        },
        {
            "author": "Wabbit_Wampage",
            "score": 7,
            "body": "Indeed, we will most likely need some type(s) of e-fuel for most air travel and ocean shipping.\n\nI hope the Porsche e-fuel program works. I would love to keep my Mustang and run it responsibly, even if the cost of fuel means it's only for weekend or occasional drives.",
            "created_utc": 1633554894.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.869,
                "pos": 0.131,
                "compound": 0.7964
            }
        },
        {
            "author": "GhostReddit",
            "score": 1,
            "body": "The problem is it takes more energy producing a synthetic fuel than just charging a battery. It doesn't make sense for average passenger cars, but some vehicles (ships and aircraft) can use fuel much more efficiently and it may make sense there.\n\nA jet turbine at altitude can reach 50% thermal efficiency, and airplanes are extremely sensitive to weight so we'll be seeing them using liquid fuels for a while.",
            "created_utc": 1633624980.0,
            "sentiment": {
                "neg": 0.024,
                "neu": 0.845,
                "pos": 0.131,
                "compound": 0.804
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "Per race or is one transatlantic fight an entire F1 season's worth?",
            "created_utc": 1633634708.0,
            "sentiment": {
                "neg": 0.179,
                "neu": 0.69,
                "pos": 0.131,
                "compound": -0.1779
            }
        },
        {
            "author": "codename_wizard",
            "score": 2,
            "body": "Buying credits is not really what people mean when they are talking about doing sustainable development for the world  \n\n\nThe marketing value of \"buying green credit\" is not as high as showing you can race the fastest and best cars in the world on renewable or synthetic fuels",
            "created_utc": 1633591158.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.79,
                "pos": 0.21,
                "compound": 0.8934
            }
        },
        {
            "author": "prho1",
            "score": 1,
            "body": "Thanks for sharing this! I always try and post it whenever people complain about F1 not trying to be green, also worth saying they plan to be net carbon zero by 2030.\n\nPeople also forget about all the emissions saved over the years outside of F1 from the research on power units, fuels and lubricants that has come from it",
            "created_utc": 1633608243.0,
            "sentiment": {
                "neg": 0.064,
                "neu": 0.782,
                "pos": 0.155,
                "compound": 0.7424
            }
        },
        {
            "author": "Xygen8",
            "score": 4,
            "body": "The Extreme E offroad racing series uses a single big ship to transport all the equipment:\n\nhttps://www.extreme-e.com/en/the-ship",
            "created_utc": 1633543596.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "YouAreMentalM8",
            "score": 1,
            "body": "No, you're missing the point. This is a PR initiative with little weight behind it to gain positive attention from people who fail to understand the difficulties in scaling up production of synthetic fuels. Porsche is backing the same idea, is over 10x the size of F1, and is backed by VAG (25x the size of F1), so if anything they are going to be the main drivers (in the automotive space) behind synthetic fuels EVER possibly making it to road cars. F1 is very unlikely to make any sort of meaningful impact in that respect given the absolutely enormous up front capital costs required to pursue the technology (ones F1 cannot afford to make - the pilot plant alone was $45M and F1 has had difficulty maintaining revenues let alone profits during the pandemic).\n\nSo in summary, this is like saying you're going to put a solar panel on your house and then all the potential future solar power generation on Earth is somehow attributed to you because of buzzwords such as \"trickle down.\"",
            "created_utc": 1633556950.0,
            "sentiment": {
                "neg": 0.073,
                "neu": 0.826,
                "pos": 0.101,
                "compound": 0.6605
            }
        },
        {
            "author": "YouAreMentalM8",
            "score": 1,
            "body": "I'm loving it so far, I get asked the question a fair bit and I think this brief comparison I wrote up (GT4 vs. 992 Carrera) sums up most of the key points: https://old.reddit.com/r/cars/comments/p56wxd/can_you_make_any_car_handle_like_a_supercar_race/h94c3p9/\n\n> I don't actually need anything crazy but like, I want the keyless entry, and I've grown accustomed to automatic wipers. And Bluetooth audio. Those are about all i need but it looks like you can't get keyless entry on the GT4 at all?\n\nKeyless entry isn't available on any Porsche GT (2/3/4) car actually, as far as I know. That's just how it has always been. Automatic wipers are available as an option (paired with auto dimming mirrors), which I have. Bluetooth audio is standard, and Apple Carplay is an option. \n\n>Also how are you finding the long gear ratios? The only complaint anyone ever has about the GT4 is the gear ratios.\n\nRegarding gearing it's not great for the street, and unfortunately all manual 718s (as far as I know) share the same gearing. The problem is exasperated by the higher redline on the 4.0 engine cars. But this is really the norm for high powered manual cars and Porsche products (even 987s and 997s had long gears, they're geared for near 200 mph top speeds on the autobahn). The engine has plenty of torque though, so you don't feel the need to redline it, but it sure encourages it. 2nd tops out above the highest speed limit in all of Canada, so I would say that self control / punishments for speeding should be considerations.\n\nMy take is that the gear ratios only ever come up as a problem because in North America they're really the \"only\" shortcoming of the car. Every high powered manual transmission car has this same issue, a lot of people don't realize the 992 GT3 has the same or higher top speed in every gear (manual v manual) as the GT4. The Lotus Evora 400/GT has similar gearing as well. (And is another car I HIGHLY recommend checking out if you like the GT4). \n\nHope that helps.",
            "created_utc": 1633964205.0,
            "sentiment": {
                "neg": 0.066,
                "neu": 0.804,
                "pos": 0.13,
                "compound": 0.975
            }
        },
        {
            "author": "BS_Is_Annoying",
            "score": 7,
            "body": "Palm oil is the one that everybody points out to. Maybe you know another. \n\nWell they have the issue of being only viable in tropical climates. Well, the arible land in tropical places is a premium. Basically cut down rainforests for monoculture palm fields. Instead of replacing grass lands in Iowa. \n\nSo not great either.",
            "created_utc": 1633563486.0,
            "sentiment": {
                "neg": 0.093,
                "neu": 0.838,
                "pos": 0.069,
                "compound": -0.3553
            }
        },
        {
            "author": "BS_Is_Annoying",
            "score": 2,
            "body": "That's how ethanol is made. Every plant that does photosynthesis takes carbon out of the air. That includes corn. \n\nExcept the process to take the carbon out of the air burns a lot of diesel and natural gas.",
            "created_utc": 1633593675.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.937,
                "pos": 0.063,
                "compound": 0.3612
            }
        },
        {
            "author": "invisible_babysitter",
            "score": 1,
            "body": "This is the video I immediately think of when the topic comes up. There’s still a lot of problems with manufacturing, plus the energy investment compared to what one gets in the end product is usually a net negative. The tech needs to be developed much further so we’ll see where this all ends up.",
            "created_utc": 1633614762.0,
            "sentiment": {
                "neg": 0.106,
                "neu": 0.86,
                "pos": 0.035,
                "compound": -0.6486
            }
        },
        {
            "author": "BS_Is_Annoying",
            "score": 1,
            "body": "That's the eroei investment bit. Basically, if you want to produce 3 gallons of ethanol, you have to burn 1. That's eroei if 2. \n\nIt's crappy because it's really inefficient. That means huuuuge expensive refineries, huge fields to grow the ethanol, and high prices at the pump.",
            "created_utc": 1633563723.0,
            "sentiment": {
                "neg": 0.07,
                "neu": 0.859,
                "pos": 0.07,
                "compound": -0.25
            }
        },
        {
            "author": "Drzhivago138",
            "score": 2,
            "body": "I assume you're taking into account the foods livestock can consume besides vegetables, the foods not edible by humans?",
            "created_utc": 1633550090.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "BS_Is_Annoying",
            "score": 1,
            "body": "Yeah, exactly. That's why meat substitutes are pretty much a no brainer. You can get about 10x the protein out of the same area of land. \n\nThe only reason it hasn't happened is because of the backwardfuckingass way the USA approaches food. We've been subsidizing corn to make it cheap AF to fatten up a bunch of pig, cows, and chickens. That has been under the thinly vailed bullshit idea that we need to feed the world. Ignoring that 95% of the grain goes right into the mouth of an animal to make expensive meat. But that meat is heavily subsidized because Iowa. The US has really created a monopoly on itself because it doesn't allow other countries to subsidize their meat in the same way using \"free\" trade agreements. \n\nThat makes US meat super cheap. But growing a full blown animal will never be able to compete with the real cost of production of meat substitutes. That's because you can get rid of all the waste of growing a pig leg or hair or whatever. And you don't have to wait 1-5 years for the animal to grow to harvest size. Instead, you stick some plants in a vat and 3 days later you have a meat substitute. We're probably looking at in 3-5 years buying meat-substitute ground beef for around 1/2 the cost of the real thing. \n\nIt's only a matter of time before impossible meats and beyond meat and whoeverbeantypeburger ends up pushing out beef manufacturers for a McDonnalds burger. Most likely, you aren't buying McDonnalds because of their care in making a Michellen star burger. You are buying it because it offers good value. A filling, tasty meal on a few dollars. Meat substitutes will be able to do that better than the US beef industry. And there is no way traditional beef manufacturers are going to be able to cut costs to stay in business. \n\nRural America is sooooo fucked in like 5-10 years. Maybe not though.",
            "created_utc": 1633550787.0,
            "sentiment": {
                "neg": 0.062,
                "neu": 0.827,
                "pos": 0.111,
                "compound": 0.9551
            }
        },
        {
            "author": "Moron_Labias",
            "score": 46,
            "body": "Am I having a stroke? Realistic, civil, nuanced discourse on the harsh realities of energy transition and current fossil fuel necessity on Reddit? I must be dreaming.",
            "created_utc": 1633548940.0,
            "sentiment": {
                "neg": 0.107,
                "neu": 0.823,
                "pos": 0.069,
                "compound": -0.2869
            }
        },
        {
            "author": "Hencq",
            "score": 6,
            "body": "That's true, but it's also a bit of a chicken and egg problem. Most plastics are cheap, because they're effectively a byproduct of making fuel. Kind of insane when you think about it: we have this miracle stuff that we pump out of the ground that allows us to make essentially anything we can think of, but the main thing we do with it is burning it.",
            "created_utc": 1633557228.0,
            "sentiment": {
                "neg": 0.092,
                "neu": 0.76,
                "pos": 0.147,
                "compound": 0.6663
            }
        },
        {
            "author": "ToastyMozart",
            "score": 1,
            "body": "On the bright side, with declining fossil fuel use upping the costs we might see polylactic acid or other bioplastics getting use for more than just printing filament.",
            "created_utc": 1633561731.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.903,
                "pos": 0.097,
                "compound": 0.4404
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "If you live in the US they are 17% of the annual carbon polution. Thats significant. The reason you hear soo much about the topic is because its a major source of pollution that an individual has direct control over",
            "created_utc": 1633592280.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.956,
                "pos": 0.044,
                "compound": 0.2023
            }
        },
        {
            "author": "ToastyMozart",
            "score": 5,
            "body": "There's a \"new\" type of cargo ship that's supposed to be finished soon that [uses sails for everything](https://newatlas.com/marine/oceanbird-wallenius-wing-sail-cargo-ship/) but maneuvering into and out of port. Changes an 8-day crossing into 12 but with any luck due to the fuel savings (and perhaps some international pressure) that can become the new standard.",
            "created_utc": 1633562092.0,
            "sentiment": {
                "neg": 0.05,
                "neu": 0.878,
                "pos": 0.072,
                "compound": 0.296
            }
        },
        {
            "author": "dishwashersafe",
            "score": -5,
            "body": "Light duty vehicles account for 17% of all US greenhouse gas emissions. That's definitely enough to matter.",
            "created_utc": 1633553810.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.798,
                "pos": 0.202,
                "compound": 0.4215
            }
        },
        {
            "author": "None",
            "score": 0,
            "body": "Have you ever driven across Illinois lol? There is literally nothing but corn, in the entire 95% of the state that isn't Chicagoland or the East St. Louis area. Now imagine almost the entire state of Iowa added to the mix, and many other states could be turned into corn-producing powerhouses. \n\nThe REAL challenge is water. It takes a lot of water to grow corn, and while we have to land for it, we don't have the water needed to grow them, especially for states very far inland.",
            "created_utc": 1633608195.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.963,
                "pos": 0.037,
                "compound": 0.3291
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[removed]",
            "created_utc": 1633571153.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[removed]",
            "created_utc": 1633571167.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": -1,
            "body": "[deleted]",
            "created_utc": 1633546482.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "elbers",
            "score": -17,
            "body": "If this technology was promising it wouldn't need F1. We wouldn't be in the middle of a fundamental shift in automobile technology.",
            "created_utc": 1633540503.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.886,
                "pos": 0.114,
                "compound": 0.4019
            }
        },
        {
            "author": "BatteryRock",
            "score": -16,
            "body": "No......not really.",
            "created_utc": 1633539286.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "speedbomb",
            "score": 2,
            "body": "Thanks",
            "created_utc": 1633554913.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.0,
                "pos": 1.0,
                "compound": 0.4404
            }
        },
        {
            "author": "Tooluka",
            "score": 3,
            "body": "Nah, it says that ”it's one option”, which in practice translates to either we won't do this or we'll do small lab experiments constantly and issue PR statements that it will happen soon.  \nMy guess is that they will go with regular path planting trees or recycling or something similar - useful? Yes. Actually removing CO2 from atmosphere? No.",
            "created_utc": 1633590682.0,
            "sentiment": {
                "neg": 0.022,
                "neu": 0.884,
                "pos": 0.094,
                "compound": 0.6767
            }
        },
        {
            "author": "Vik1ng",
            "score": 6,
            "body": "[Because they are created with electricity](https://marketresearchtelecast.com/wp-content/uploads/2021/09/E-fuels-Porsche-and-Siemens-build-synthetic-gasoline-factory.png). And at the end of the day you need like 3x or so more electricity to go the same distance when you \"convert\" it into synthetic fuel instead of just putting it into a battery.",
            "created_utc": 1633585347.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.897,
                "pos": 0.103,
                "compound": 0.5423
            }
        },
        {
            "author": "9238749924247",
            "score": 4,
            "body": "All of these synthetic fuels still require energy to manufacture. And it will almost always be more efficient to put that energy 'directly' into a battery rather than use it to make a synthetic fuel and then put that fuel in a very inefficient combustion engine.",
            "created_utc": 1633575931.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.855,
                "pos": 0.145,
                "compound": 0.7425
            }
        },
        {
            "author": "None",
            "score": 3,
            "body": "Nope. An EV, even on a dirty grid still has a lower carbon footprint than ICE. Numerous studies have already gone over this.",
            "created_utc": 1633592802.0,
            "sentiment": {
                "neg": 0.195,
                "neu": 0.805,
                "pos": 0.0,
                "compound": -0.6249
            }
        },
        {
            "author": "25521177",
            "score": 0,
            "body": "How are they gonna fix the particulate and non CO2 pollution that comes from burning oil? Better off using hydrogen. They got put up solar fields in Qatar, Bahrain, Saudia Arabia, and Australia. Clean hydrogen from electrolysis. They could generate and transport hydrogen for a whole season during the off season",
            "created_utc": 1633557591.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.897,
                "pos": 0.103,
                "compound": 0.6808
            }
        },
        {
            "author": "junkmiles",
            "score": 9,
            "body": "> overall it doesn't\n\nFrom the article:\n\n>F1 expects the new fuel to achieve greenhouse-gas-emissions savings of at least 65 percent, compared to traditional gasoline.\n\nSo yes, it still does.",
            "created_utc": 1633543297.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.893,
                "pos": 0.107,
                "compound": 0.541
            }
        },
        {
            "author": "ElJamoquio",
            "score": -7,
            "body": ">overall it doesn't\n\nburning it does.  CO2 isn't the only, or even remotely the most potent, greenhouse gas.\n\nThis is complete greenwashing.",
            "created_utc": 1633539577.0,
            "sentiment": {
                "neg": 0.062,
                "neu": 0.938,
                "pos": 0.0,
                "compound": -0.1027
            }
        },
        {
            "author": "SF90Reeve",
            "score": 2,
            "body": "F1 cars make 1000hp and race for 300km . The electric tech is nowhere near there yet to do that . Fully electric F1 cars simply aren't feasible yet it's not because of \"muh sound\" as you incorrectly claim .\n\nand F1 is doing quite well currently infact they're doing better at finding new viewers than FE . F1 isn't going anywhere .",
            "created_utc": 1633580679.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.92,
                "pos": 0.08,
                "compound": 0.6478
            }
        },
        {
            "author": "blamethemeta",
            "score": 40,
            "body": "Ethanol kills rubber fuel lines.\n\nAlso race fuel is e85. Race fans are not adverse to ethanol one bit.",
            "created_utc": 1633559565.0,
            "sentiment": {
                "neg": 0.155,
                "neu": 0.752,
                "pos": 0.093,
                "compound": -0.3378
            }
        },
        {
            "author": "shewy92",
            "score": 1,
            "body": "You know that NASCAR has been using American Ethanol (15% ethanol) for about a decade now, right? And literally no fan cares.\n\n Even the famous [number 3](https://www.pyramidracing.com/contents/media/2020-austin-darlington-3.jpg) was sponsored by the company",
            "created_utc": 1633581911.0,
            "sentiment": {
                "neg": 0.128,
                "neu": 0.835,
                "pos": 0.037,
                "compound": -0.484
            }
        },
        {
            "author": "FuriousGorilla",
            "score": 1,
            "body": "Every NASCAR fan with a turbo LS fucking loves ethanol.",
            "created_utc": 1633612497.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.56,
                "pos": 0.44,
                "compound": 0.7425
            }
        },
        {
            "author": "CyberianSun",
            "score": 20,
            "body": "They even got a bump in power by +60bhp!",
            "created_utc": 1633550591.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "blamethemeta",
            "score": 0,
            "body": "So Nitrometh? Its a real thing. The Hoonicorn runs on it",
            "created_utc": 1633559603.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "R_V_Z",
            "score": 20,
            "body": "5 for Kimi.",
            "created_utc": 1633552736.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Mental_Medium3988",
            "score": 7,
            "body": "Officer: Are you drinking and driving?\n\nPerson: No but my car is.",
            "created_utc": 1633560928.0,
            "sentiment": {
                "neg": 0.127,
                "neu": 0.873,
                "pos": 0.0,
                "compound": -0.1531
            }
        },
        {
            "author": "ChiggaOG",
            "score": 21,
            "body": "But there's one place he could be faster...",
            "created_utc": 1633540296.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "hannahranga",
            "score": 30,
            "body": "I'd be curious what the results of just a fuel flow rule would be",
            "created_utc": 1633551441.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.85,
                "pos": 0.15,
                "compound": 0.3182
            }
        },
        {
            "author": "GoblinEngineer",
            "score": 17,
            "body": "I don't think it's a good idea... The closest we had to that I'm recent times is having multiple tire manufacturers... And what ended up happening is that the the team that chose the right manufacturer ended up winning.\n\nI'm worried that with something as open ended as this, we'd end up with one team getting the right formula and have an even bigger gulf than we currently have with Mercedes today",
            "created_utc": 1633557217.0,
            "sentiment": {
                "neg": 0.028,
                "neu": 0.89,
                "pos": 0.081,
                "compound": 0.6249
            }
        },
        {
            "author": "exolomus",
            "score": 78,
            "body": "Best I can do is a [supercharged Ferrari 1.5L V12](https://en.m.wikipedia.org/wiki/Ferrari_Colombo_engine#125)",
            "created_utc": 1633544055.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.682,
                "pos": 0.318,
                "compound": 0.6369
            }
        },
        {
            "author": "None",
            "score": 2,
            "body": "I feel like \"9 women can't have a baby in a month\" applies here",
            "created_utc": 1633688267.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.839,
                "pos": 0.161,
                "compound": 0.3612
            }
        },
        {
            "author": "EatKillFuck",
            "score": 1,
            "body": "Lancia has entered the chat",
            "created_utc": 1633872330.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "RRFroste",
            "score": 2,
            "body": "Umm… production cars are ending up with *half a litre per litre?*",
            "created_utc": 1634151930.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Gallade475",
            "score": 2,
            "body": "Even donut said it wouldn't happen.",
            "created_utc": 1633594709.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "davewritescode",
            "score": 1,
            "body": "No, it’s been written about by a few folks and throw about on reddit before but if you’ve ever spent time around marine engines you know what that it’s not crazy.\n\nBut yeah, when I googled 2 stroke V6 donut media was like the 3rd video so I get it.",
            "created_utc": 1633616843.0,
            "sentiment": {
                "neg": 0.042,
                "neu": 0.852,
                "pos": 0.105,
                "compound": 0.538
            }
        },
        {
            "author": "220mtm",
            "score": 7,
            "body": "of course there is... on a track. But how would you feel if the lights turned green and grandma smoked you in a minivan ? probably not very good. At the end of the day they're not exotics, they're sports cars. You can drive around a f355 and feel special all day but a 911.. not so much. \n\n\nWanna know how i know this? because as i was feeling special in my 550hp fully specced out Cayenne Turbo, a fucking VW Polo GTI beat me at a red light. By the time my turbos started spinning, this little thing was gone, I enjoyed the car after that but that moment is burned in my memory, made me realize that even if you have a powerful car, you can't keep up with the new ones coming out.",
            "created_utc": 1633549323.0,
            "sentiment": {
                "neg": 0.023,
                "neu": 0.862,
                "pos": 0.115,
                "compound": 0.9316
            }
        },
        {
            "author": "alexkidd03",
            "score": 34,
            "body": "Whatever fuel the come up with will likey cost lots of money and not scalable for world wide use.",
            "created_utc": 1633544406.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Activehannes",
            "score": 3,
            "body": "Price, infrastructure, scalability is. \n\nthere is Zero chance. Like actual 0%. This tech is not gonna happen. This is not even a debate.",
            "created_utc": 1633589564.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.824,
                "pos": 0.176,
                "compound": 0.5423
            }
        },
        {
            "author": "efficientcatthatsred",
            "score": 0,
            "body": "Politicians are too stupid",
            "created_utc": 1633547256.0,
            "sentiment": {
                "neg": 0.531,
                "neu": 0.469,
                "pos": 0.0,
                "compound": -0.5267
            }
        },
        {
            "author": "ToastyMozart",
            "score": 1,
            "body": "Probably more a matter of scale than anything. Synthesizing fuel takes a substantial amount of electricity, there's not enough generation capacity to swap gasoline for synth fuel. Once ICE cars become less prevalent, and if we finally wind up with a surplus of renewable energy, *then* it would be viable to swap it in globally.",
            "created_utc": 1633561227.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.908,
                "pos": 0.092,
                "compound": 0.507
            }
        },
        {
            "author": "maaaatttt_Damon",
            "score": 43,
            "body": "Formula E has a contract with the FIA that they're the sole sanctioned electric race series until something like 2035.  Formula 1 isn't allowed to fully electrify until that ends.",
            "created_utc": 1633559927.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.921,
                "pos": 0.079,
                "compound": 0.3612
            }
        },
        {
            "author": "None",
            "score": 108,
            "body": "[deleted]",
            "created_utc": 1633547146.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "tkuiper",
            "score": 1,
            "body": "? Ethanol is a net 0 emission fuel ?",
            "created_utc": 1633604140.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "morelsupporter",
            "score": 48,
            "body": "the concept of F1 is the pinnacle of ICE engineering and limits.\n\nthe things they do trickle down to consumer cars via sports cars and then eventually into practicals.\n\nthey have a vested interest in keeping the ICE alive, and if the trend is moving toward renewable resources like electricity to power vehicles, then instead of rolling over and dying, proponents of ICE need to counter it, and if that means a fuel that is sustainable then that is the natural progression of internal combustion platforms at the top level of auto racing.\n\n\nFormula One isn’t doing it to be green, they’re doing it to stay alive and relevant as a business and perhaps provide a path for the beautiful exhaust sounds and shiftable transmissions we love to stick around longer.",
            "created_utc": 1633561447.0,
            "sentiment": {
                "neg": 0.015,
                "neu": 0.818,
                "pos": 0.167,
                "compound": 0.9661
            }
        },
        {
            "author": "7Seyo7",
            "score": 3,
            "body": "Marketability I guess? Much of F1 is about marketing",
            "created_utc": 1633559460.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "dwerg85",
            "score": 2,
            "body": "It comes from underground. You can never really claim your racing is carbon neutral then. The new fuel would most probably not require anything to come out of the ground, and if possible uses captured CO2 in the process too. That's why they want the new fuel to be drop-in. Gasoline burning ICE cars aren't going aways anytime soon and replacing them is a cost a lot of people can't afford. Just changing the fuel to something cleaner without having to change anything on the car would be a great boon.",
            "created_utc": 1633561429.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.925,
                "pos": 0.075,
                "compound": 0.7269
            }
        },
        {
            "author": "Shadow703793",
            "score": 68,
            "body": "They likely won't do it voluntarily due to cost. Just look at the shipping industry. Sulphur content for fuel oil was capped at 0.5% globally in 2020 instead of even lower due to cost. And if the shipping industry had their way, they'll still be running old school Bunker C.",
            "created_utc": 1633554923.0,
            "sentiment": {
                "neg": 0.043,
                "neu": 0.957,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "Westnest",
            "score": 24,
            "body": "Planes will never use lithium ion batteries, especially not the long haul airliners. The energy density of kerosene is *barely* enough for them let alone any chemical battery, so much that fuel weight is a significant part of the aircraft weight before a long flight, and the aircraft gets more efficient and is able to fly higher as it burns more fuel and gets lighter towards the middle and end of the flight. Very different situation than any road vehicle",
            "created_utc": 1633555309.0,
            "sentiment": {
                "neg": 0.024,
                "neu": 0.894,
                "pos": 0.082,
                "compound": 0.6115
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "and marketing.",
            "created_utc": 1633609754.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Cannablessed112",
            "score": 1,
            "body": "Yet KERS is kind of used in alot of EVS as regen braking (I may be very wrong on this)",
            "created_utc": 1633605595.0,
            "sentiment": {
                "neg": 0.152,
                "neu": 0.848,
                "pos": 0.0,
                "compound": -0.5256
            }
        },
        {
            "author": "xarune",
            "score": 4,
            "body": "Those who live in apartments/condos and renters will likely be without mass charging for a decade or two. Hybrids still have a long market life expectancy. Not to mention many 2 car household that will likely move to EV [commuter] and hybrid/PHEV trip car.\n\nFully electrictifed is going is going to take a big chunk of marketshare over the next 10-20 years, but hybrids, and plug-in hybrids, still have a fairly long life ahead of them.",
            "created_utc": 1633593852.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "roarRAWRarghREEEEEEE",
            "score": 118,
            "body": "It sort of is the point. It is the way many of the manufacturers justify spending money on the sport.",
            "created_utc": 1633542035.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "_SkeletonJelly",
            "score": 32,
            "body": "That is absolutely the point. Why else would manufacturers spend millions upon millions of dollars to go participate in a sport that most of society doesn't care about?",
            "created_utc": 1633544859.0,
            "sentiment": {
                "neg": 0.089,
                "neu": 0.911,
                "pos": 0.0,
                "compound": -0.3875
            }
        },
        {
            "author": "AFrozen_1",
            "score": 2,
            "body": "in a way it is the point.  A big part of motorsport in general and F1 in particular is to pioneer new technologies to improve everyday cars.  Think about mid-engines layouts, semi-auto transmissions, etc. All found their start in motorsport.",
            "created_utc": 1633559746.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.931,
                "pos": 0.069,
                "compound": 0.4404
            }
        },
        {
            "author": "PKS_5",
            "score": 81,
            "body": "Yeah, hence Formula-E.",
            "created_utc": 1633540053.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.476,
                "pos": 0.524,
                "compound": 0.296
            }
        },
        {
            "author": "ApoIIoCreed",
            "score": 22,
            "body": "That's a nice solution for the developed world. \n\nBut go tell a 1970s-era mini-Bus driver making $4/day in West Africa that he needs to switch to a 2020 EV. Even an insanely cheap one would be like 10+ years of his salary. \n\nWe need carbon-neutral combustion fuels so that people in developing nations can continue to use their existing petroleum vehicles, but with using a carbon-neutral fuel alternative instead (like a synthetic hydrocarbon made with electrolysis).",
            "created_utc": 1633544930.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.878,
                "pos": 0.122,
                "compound": 0.8422
            }
        },
        {
            "author": "None",
            "score": 16,
            "body": "[deleted]",
            "created_utc": 1633543947.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "pursuer_of_simurg",
            "score": 54,
            "body": "Sure. EV's are much better for commuter roles, but having a clean high-energy density fuel is very useful for many situations.",
            "created_utc": 1633537524.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.598,
                "pos": 0.402,
                "compound": 0.887
            }
        },
        {
            "author": "PirelliUltraSofts",
            "score": 6,
            "body": "How? The whole point of this is to literally put them in the current engines with no modifications, they currently run 99 percent pump fuel anyway",
            "created_utc": 1633541201.0,
            "sentiment": {
                "neg": 0.081,
                "neu": 0.919,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "rockhopper92",
            "score": 9,
            "body": "That is the entire point of the development they're doing though. Literally a drop in replacement for gasoline in existing cars.\n\nAre you saying that is physically impossible for some reason?",
            "created_utc": 1633542133.0,
            "sentiment": {
                "neg": 0.065,
                "neu": 0.935,
                "pos": 0.0,
                "compound": -0.2732
            }
        },
        {
            "author": "willtron3000",
            "score": 13,
            "body": "Theres no chance the motorcar will replace the horse and cart.",
            "created_utc": 1633540194.0,
            "sentiment": {
                "neg": 0.148,
                "neu": 0.852,
                "pos": 0.0,
                "compound": -0.1877
            }
        },
        {
            "author": "Stunt_Vist",
            "score": 13,
            "body": "Battery EV's are completely useless for mass transit, expecially intercity transit, cargo transport, planes, boats etc. Batteries are heavy, energy density of those batteries is much less than that of chemical fuels, and is much more dangerous than chemical fuels because battery fires don't require oxygen. In all of those applications having a synthetic fuel would be a a major net benefit for the environment without having to do away not having any trucks or boats or planes around. Mass transit could just all be moved to trolleys, but it's expensive short term (cheaper long term) which is why governments are reluctant to adopt it. \n\nOtherwise trolleys are much better than Battery EV's because you can get similar energy efficiency without the massive weight penalty. And trust me, no one is going to trolley the entire motorway system. Synthetic fuels will likely be used in instances where that isn't possible and will likely use the existing petrol pump infrastructure for that purpose, so why not let people use synthetic fuels in their passenger vehicles until battery tech advances far enough to make replacing all ICE cars with BEV's?",
            "created_utc": 1633538712.0,
            "sentiment": {
                "neg": 0.065,
                "neu": 0.84,
                "pos": 0.095,
                "compound": 0.7503
            }
        },
        {
            "author": "skinnyskinch",
            "score": 2,
            "body": "Laws of physics have absolutely nothing to do with your comment. My god",
            "created_utc": 1633569803.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.851,
                "pos": 0.149,
                "compound": 0.2732
            }
        },
        {
            "author": "Subieworx",
            "score": 1,
            "body": "Ethanol based fuels already do.",
            "created_utc": 1633560251.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "codename_wizard",
            "score": 1,
            "body": "A lot of short distance airtravel will be electric very soon too though. Anything which is around hundreds of km's. Which is a large part of European air travel to be fair",
            "created_utc": 1633591005.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.931,
                "pos": 0.069,
                "compound": 0.3182
            }
        },
        {
            "author": "AntiGravityBacon",
            "score": 40,
            "body": "It would likely be available at race tracks.  That will put ICE cars in essentially the same place as horses which is oddly poetic in a way.",
            "created_utc": 1633543918.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "dwerg85",
            "score": 14,
            "body": "Did you read the articles? It's literally the point to produce an e-fuel and make sure it can be scaled to a point where average people can buy it at the pump.",
            "created_utc": 1633561488.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.931,
                "pos": 0.069,
                "compound": 0.3182
            }
        },
        {
            "author": "KITTYONFYRE",
            "score": 15,
            "body": "no, there's no chance making and using e-fuel will be more efficient than charging a battery",
            "created_utc": 1633552906.0,
            "sentiment": {
                "neg": 0.092,
                "neu": 0.743,
                "pos": 0.164,
                "compound": 0.3298
            }
        },
        {
            "author": "Sunfuels",
            "score": 1,
            "body": "The truth is that if everyone is using electrics for their daily drivers, running your Mustang once a weekend would be perfectly acceptable. A 90% decrease in CO2 emissions is a good target and what we should really be focusing on. Trying to ban every single last use of gasoline kind of detracts from the bigger picture goal.",
            "created_utc": 1633611591.0,
            "sentiment": {
                "neg": 0.053,
                "neu": 0.776,
                "pos": 0.171,
                "compound": 0.7964
            }
        },
        {
            "author": "LeveragedTiger",
            "score": 2,
            "body": "One flight = whole seasons worth",
            "created_utc": 1633658592.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.725,
                "pos": 0.275,
                "compound": 0.2263
            }
        },
        {
            "author": "Daiephir",
            "score": 1,
            "body": "The point is that there is no \"largest source of emissions\" in F1 because it's bought for. They've been ahead of the curve in terms of emissions compliance even during a time where no one else was doing it.",
            "created_utc": 1633607093.0,
            "sentiment": {
                "neg": 0.106,
                "neu": 0.894,
                "pos": 0.0,
                "compound": -0.5267
            }
        },
        {
            "author": "thepanduhhh",
            "score": 24,
            "body": "Extreme E has 9 teams total running 1 car each for five races. The logistics are not at all the same.",
            "created_utc": 1633544197.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[removed]",
            "created_utc": 1633557276.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "topherhead",
            "score": 1,
            "body": "Oh yes the Evora GT is high on the list.  My main concern there is that the nearest dealer is a 3.5 hour drive away and I worry about parts support etc.  I also hear issues with the leather pulling back from the dash in the sun (and I'm in Texas), though that might have been fixed.  \n\nBut I do love the way it looks. And I love Lotus as a company in principle.  I also love that it still has hydraulic power steering.  I haven't driven a modern Porsche but I'm yet to find an electric rack that feels as good as my E90.\n\nI didn't realize the Evora had similar gearing to the 718 though.  So that's something to consider.\n\nI'll also need to decide if the cabin noise is something I can deal with, won't know until I drive one.  \n\nBut yes, most people concede that the only reason the gearing is brought up for the GT4 is that the car is otherwise so achingly perfect you have a find a nit to pick.\n\nThanks for the info!",
            "created_utc": 1633968150.0,
            "sentiment": {
                "neg": 0.009,
                "neu": 0.802,
                "pos": 0.189,
                "compound": 0.9912
            }
        },
        {
            "author": "danbfree",
            "score": 1,
            "body": "> Except the process to take the carbon out of the air burns a lot of diesel and natural gas.\n\nFor sure, I just hope that maybe out of this that atmospheric carbon capture tech can be advanced to be far more efficient at least!",
            "created_utc": 1633624237.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.754,
                "pos": 0.246,
                "compound": 0.9019
            }
        },
        {
            "author": "None",
            "score": 0,
            "body": "Most dairy eats is cultivated corn and wheat.",
            "created_utc": 1633591714.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 13,
            "body": "[deleted]",
            "created_utc": 1633549995.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "CoyotePuncher",
            "score": 6,
            "body": "This is /r/cars, not /r/news. Talking about cars that enthusiasts car about. Nobody is going to complain when the camry goes EV.\n\nIn fact, making all the regular cars EV is a perfect justification for leaving fun cars as ICE.",
            "created_utc": 1633554081.0,
            "sentiment": {
                "neg": 0.052,
                "neu": 0.752,
                "pos": 0.196,
                "compound": 0.7845
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "Im not saying there is not enough corn, im saying there is not enough to feed people (and livestock) and fuel cars at the same time. The amount of fuel cars use is this big.",
            "created_utc": 1633608569.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "AutoModerator",
            "score": 1,
            "body": "Your comment has been automatically removed because you posted a shortened or redirected (usually google) URL. Post a direct link to your source, not search results, AMP, or MSN.com. [Please see the rules in the sidebar, or by clicking here.](http://www.reddit.com/r/cars/wiki/rules)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cars) if you have any questions or concerns.*",
            "created_utc": 1633571164.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.931,
                "pos": 0.069,
                "compound": 0.5574
            }
        },
        {
            "author": "AutoModerator",
            "score": 1,
            "body": "Your comment has been automatically removed because you posted a shortened or redirected (usually google) URL. Post a direct link to your source, not search results, AMP, or MSN.com. [Please see the rules in the sidebar, or by clicking here.](http://www.reddit.com/r/cars/wiki/rules)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cars) if you have any questions or concerns.*",
            "created_utc": 1633571182.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.931,
                "pos": 0.069,
                "compound": 0.5574
            }
        },
        {
            "author": "gumol",
            "score": 2,
            "body": "It expands because of heat. Volume is proportional to temperature.",
            "created_utc": 1633546743.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.865,
                "pos": 0.135,
                "compound": 0.1027
            }
        },
        {
            "author": "Alph_A__",
            "score": 11,
            "body": "It wouldn't need a large donor and tester that has a financial interest in it's applications? This makes no sense. Because the majority of cars are going EV? No reason to stop innovation for those who enjoy the sound of ICE cars or want to continue driving older cars into the future while complying with guidelines.",
            "created_utc": 1633542040.0,
            "sentiment": {
                "neg": 0.1,
                "neu": 0.742,
                "pos": 0.158,
                "compound": 0.594
            }
        },
        {
            "author": "None",
            "score": 14,
            "body": "[deleted]",
            "created_utc": 1633541682.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "danbfree",
            "score": 1,
            "body": "Fair enough, I just hope that they can at least help advance actual carbon *capture* technology, whether to make fuel from it or even better to at least help reduce CO2 levels and not just put it back in the air.",
            "created_utc": 1633623955.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.727,
                "pos": 0.273,
                "compound": 0.91
            }
        },
        {
            "author": "danbfree",
            "score": 2,
            "body": "Absolutely. This is just a PR move mostly but also encouraging if the actual technology to pull it from the air and transform it materializes. They are still increasing ICE efficiency technology but totally agree it's still FAR more efficient to go into batteries but maybe the carbon capture technology itself can develop to help with CO2 levels.",
            "created_utc": 1633623859.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.734,
                "pos": 0.266,
                "compound": 0.9649
            }
        },
        {
            "author": "danbfree",
            "score": 2,
            "body": "This is true, I just meant that it's not like EV's are carbon neutral at all either, especially with their battery production, but yes, definitely still lower carbon footprint. Also battery tech (especially friendlier materials) and recycling is improving constantly too along with more and more clean energy, especially in the CA emissions states where the most EV's are sold.",
            "created_utc": 1633624112.0,
            "sentiment": {
                "neg": 0.054,
                "neu": 0.638,
                "pos": 0.308,
                "compound": 0.9692
            }
        },
        {
            "author": "totalnewbie",
            "score": 1,
            "body": "Hydrogen combustion still has the problem that you will burn some hydrocarbons from the lubricating oils used (hydrogen isn't very lubricating..) and NOx formation during combustion.\n\nIt's very, very clean but not zero criteria pollutants. Depending on how regulations turn out, that is an incredibly important distinction.",
            "created_utc": 1633627126.0,
            "sentiment": {
                "neg": 0.037,
                "neu": 0.869,
                "pos": 0.094,
                "compound": 0.4451
            }
        },
        {
            "author": "dincob",
            "score": 2,
            "body": "Ever heard of the carbon cycle?",
            "created_utc": 1633554582.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "elbers",
            "score": 0,
            "body": "Never suggested it wasn't doing well just that they have serious competition. Which they're well aware of and the reason of \"muh sound\" came right out of Christian Horner and Toto Wolff's mouths. I'm gonna go ahead and correctly state they're more familiar with the happenings of the sport than a random salty fanboy.",
            "created_utc": 1633612890.0,
            "sentiment": {
                "neg": 0.055,
                "neu": 0.907,
                "pos": 0.037,
                "compound": -0.0036
            }
        },
        {
            "author": "Citrus_supra",
            "score": 23,
            "body": "PTFE braided lines are specifically designed with this in mind.",
            "created_utc": 1633561305.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "BrentRS1985",
            "score": 60,
            "body": "Race fuel is methanol, not ethanol. Some cars run e85 yes, but the vast majority of race cars are running methanol or c16 or many things that aren’t e85.",
            "created_utc": 1633560248.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.938,
                "pos": 0.062,
                "compound": 0.2144
            }
        },
        {
            "author": "spongebob_meth",
            "score": 2,
            "body": "Tell that to all of my rubber lines that are doing fine on e85.\n\nRace fuel is not one thing.  Some race fuel might be e85,  some is e98, most of it is not.  A lot of race fuel has no ethanol.",
            "created_utc": 1633605902.0,
            "sentiment": {
                "neg": 0.05,
                "neu": 0.909,
                "pos": 0.041,
                "compound": -0.1027
            }
        },
        {
            "author": "spongebob_meth",
            "score": 1,
            "body": ">And literally no fan cares.\n\nLol, have you met a NASCAR fan?",
            "created_utc": 1633605355.0,
            "sentiment": {
                "neg": 0.253,
                "neu": 0.456,
                "pos": 0.291,
                "compound": 0.1675
            }
        },
        {
            "author": "spongebob_meth",
            "score": 1,
            "body": "Why would a turbo LS owner bore themselves watching NASCAR?",
            "created_utc": 1633615706.0,
            "sentiment": {
                "neg": 0.182,
                "neu": 0.818,
                "pos": 0.0,
                "compound": -0.25
            }
        },
        {
            "author": "cmmgreene",
            "score": 7,
            "body": "Reminds me of the scene from down Periscope, they take a WW2 sub and play a war game to see if a Diesel Sub could sneak a Nuke into US waters. Supposedly you can poor alcohol into the diesel to get a few more rpms",
            "created_utc": 1633557960.0,
            "sentiment": {
                "neg": 0.136,
                "neu": 0.817,
                "pos": 0.047,
                "compound": -0.6808
            }
        },
        {
            "author": "noisymime",
            "score": 47,
            "body": "I hate the fuel flow rule so damn much. Either have a total fuel limit OR a fuel flow limit, but having both is stupid.\n\nImagine all the cool strategies you could have by allowing teams to vary fuel flow throughout the race, but they all only get the same amount to start with.",
            "created_utc": 1633554242.0,
            "sentiment": {
                "neg": 0.148,
                "neu": 0.805,
                "pos": 0.047,
                "compound": -0.7388
            }
        },
        {
            "author": "idpeeinherbutt",
            "score": 70,
            "body": "Why stop at 12?  [Supercharged 1.5L V16, sounds pike the hounds of hell.](https://m.youtube.com/watch?v=umO3iqac_4c&feature=emb_title)",
            "created_utc": 1633544633.0,
            "sentiment": {
                "neg": 0.176,
                "neu": 0.824,
                "pos": 0.0,
                "compound": -0.3736
            }
        },
        {
            "author": "RobertM525",
            "score": 1,
            "body": "Ummm... Yeah. Of course.\n\nSorry, I meant 500cc/cylinder (e.g., 2.0L I-4s, 4.0L V-8s).",
            "created_utc": 1634174702.0,
            "sentiment": {
                "neg": 0.09,
                "neu": 0.759,
                "pos": 0.152,
                "compound": 0.2263
            }
        },
        {
            "author": "Westnest",
            "score": 15,
            "body": "Damn what kind of Polo was that? How do you tune a max 2.0 liter engine to be more than 550HP? Does it spin at 30k RPM or something?",
            "created_utc": 1633555604.0,
            "sentiment": {
                "neg": 0.104,
                "neu": 0.896,
                "pos": 0.0,
                "compound": -0.5007
            }
        },
        {
            "author": "WarDEagle",
            "score": 22,
            "body": "There are old home-built Civics that can run 10s and do 0-60 just as fast as $250k+ cars. Guess there's no point in buying an exotic anymore...\n\nI can assure you that I will enjoy driving my 911 and it'll continue to feel special to me regardless of how people in tuner cars choose to leave red lights next to me. Maybe the difference here is that **I** don't feel special in the car, but rather **it** feels special to me. I'm not driving to feel better than anyone on the road. And for the record, there are plenty of Ferraris I'd love to have but I would (and did) take the 911 over an F355 any day.",
            "created_utc": 1633564620.0,
            "sentiment": {
                "neg": 0.033,
                "neu": 0.825,
                "pos": 0.143,
                "compound": 0.9479
            }
        },
        {
            "author": "BruhWhySoSerious",
            "score": 2,
            "body": "Miata owners feel seen by this comment. And for what it's worth my 20 year old 996 is still quicker than most anything that's not a mustang GT. It's not quite as bad as you make it. You can drive something that doesn't weight 7500 lbs and need all that power.",
            "created_utc": 1633564855.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.908,
                "pos": 0.092,
                "compound": 0.6067
            }
        },
        {
            "author": "420Sailing",
            "score": 1,
            "body": "Porsches are not for stoplight drags. There are turns on streets as well as racetracks",
            "created_utc": 1633629234.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.782,
                "pos": 0.218,
                "compound": 0.3855
            }
        },
        {
            "author": "None",
            "score": 55,
            "body": "I'm sure it will be expensive at first but prices will likely go down. I don't see what would stop it from being cheaper once it advances and demand increases. Same thing with electric batteries.",
            "created_utc": 1633544671.0,
            "sentiment": {
                "neg": 0.119,
                "neu": 0.838,
                "pos": 0.043,
                "compound": -0.4404
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "I think the idea is to make it scalable in the future. I don't think Boats and Planes are going electric anytime soon so they will need sustainable fuels.",
            "created_utc": 1633632747.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "hondaexige",
            "score": 0,
            "body": "This is being bankrolled by Saudi Aramco aka the world's most valuable company so I wouldn't be so sure it will flop.",
            "created_utc": 1633643095.0,
            "sentiment": {
                "neg": 0.086,
                "neu": 0.684,
                "pos": 0.23,
                "compound": 0.6104
            }
        },
        {
            "author": "420Sailing",
            "score": 1,
            "body": "It absolutely will happen, so that collectors can drive their classics on track and private roadways.",
            "created_utc": 1633629577.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 0,
            "body": "Yes and the sky is blue",
            "created_utc": 1633547629.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.649,
                "pos": 0.351,
                "compound": 0.4019
            }
        },
        {
            "author": "YellowCBR",
            "score": 30,
            "body": "If F1 says \"we want to go electric\" FIA will just write Formula E a check and a letter to fuck off.",
            "created_utc": 1633569662.0,
            "sentiment": {
                "neg": 0.141,
                "neu": 0.806,
                "pos": 0.052,
                "compound": -0.4939
            }
        },
        {
            "author": "None",
            "score": 16,
            "body": "[deleted]",
            "created_utc": 1633571681.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "fireinthesky7",
            "score": 1,
            "body": "I'll be amazed if Formula E has any teams left by 2035.",
            "created_utc": 1633581817.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.775,
                "pos": 0.225,
                "compound": 0.4939
            }
        },
        {
            "author": "Aristotelaras",
            "score": 1,
            "body": "I don't think they will want to move electric anyway.",
            "created_utc": 1633586177.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.874,
                "pos": 0.126,
                "compound": 0.0772
            }
        },
        {
            "author": "plasticaddict",
            "score": 108,
            "body": "Quiet, son, the parents are talking",
            "created_utc": 1633547895.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "BenedictKhanberbatch",
            "score": 10,
            "body": "It’s a shame it’s so much more boring for me",
            "created_utc": 1633576397.0,
            "sentiment": {
                "neg": 0.427,
                "neu": 0.573,
                "pos": 0.0,
                "compound": -0.7146
            }
        },
        {
            "author": "gnu_user",
            "score": 5,
            "body": "E-sports be like “dude I’m right here”",
            "created_utc": 1633547869.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.706,
                "pos": 0.294,
                "compound": 0.3612
            }
        },
        {
            "author": "Stankia",
            "score": 1,
            "body": "To market what exactly? The people who watch the races on TV, the people who buy the tickets to attend the races, the people who purchase the merchandise, the people who actually purchase Ferraris all would say \"Bring back the V12s\". I really don't understand who they are trying to cater here.",
            "created_utc": 1633559654.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "ArguablyTasty",
            "score": 24,
            "body": "Isn't Bunker C still ran once they hit international waters?",
            "created_utc": 1633563795.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "dwerg85",
            "score": 1,
            "body": "Those in the F1 pipeline will because they'll have to though.",
            "created_utc": 1633561142.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "SecretApe",
            "score": 1,
            "body": "ERS is more alike to what EVs have today with regenerative breaking. With KRS you were recovering kinetic energy from braking, but it was being stored in a separate battery that could be deployed manually for extra boost. With EV's it goes to your regular battery to help with range. \n\nPersonally, I've always wanted my car to have a KERS system so if I had to overtake someone or needed a boost, I'd have it. Manually deployable as well. Would be great fun",
            "created_utc": 1633609738.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.753,
                "pos": 0.247,
                "compound": 0.9775
            }
        },
        {
            "author": "Sunfuels",
            "score": 1,
            "body": "I agree, but I think development of anything ICE is going to get more and more limited. There will be cars built with them for quite a while, for the reasons you mentioned, but they will be recycling existing drivetrains without much money spent on improving them. That kind of already happening with some car makers. And its going to make it harder to justify ICE racing as a technology incubator, like some do now.",
            "created_utc": 1633611312.0,
            "sentiment": {
                "neg": 0.038,
                "neu": 0.857,
                "pos": 0.105,
                "compound": 0.6721
            }
        },
        {
            "author": "Stankia",
            "score": 10,
            "body": "The only reason they are in there is for marketing purposes. Any team principal could tell you the same.",
            "created_utc": 1633554560.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "idpeeinherbutt",
            "score": 23,
            "body": "“Mission statement.”",
            "created_utc": 1633544481.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "DEATH-BY-CIRCLEJERK",
            "score": 19,
            "body": "I assumed sponsorships and share of TV deals covered all the costs of running a team. Teams like Williams don’t manufacture vehicles, and wouldn’t be driven by the R&D motive, yeah?",
            "created_utc": 1633545622.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.802,
                "pos": 0.198,
                "compound": 0.7096
            }
        },
        {
            "author": "royalewitcheese93",
            "score": 6,
            "body": "For marketing.  What does Red Bull who fields two teams gain in R&D by participating in Formula 1.\n\nAlso even if F1 isnt popular in your circles it is still a literal worldwide sport.  Each sponsorship opportunity is very potent at penetrating households on every continent and indirectly people associate formula 1 and by association your brand with prestige.",
            "created_utc": 1633549172.0,
            "sentiment": {
                "neg": 0.036,
                "neu": 0.868,
                "pos": 0.096,
                "compound": 0.5951
            }
        },
        {
            "author": "None",
            "score": 3,
            "body": "Advertising",
            "created_utc": 1633546824.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "SGNick",
            "score": 60,
            "body": "F1 has also been using hybrid engines since 2014. Engines before that had battery boosts as well (KERS). It's a slow trickle, but it's trickling.",
            "created_utc": 1633541414.0,
            "sentiment": {
                "neg": 0.049,
                "neu": 0.83,
                "pos": 0.121,
                "compound": 0.2263
            }
        },
        {
            "author": "snbrd512",
            "score": 33,
            "body": "Shit did I miss the African bus driver Grand Prix cup?",
            "created_utc": 1633545652.0,
            "sentiment": {
                "neg": 0.321,
                "neu": 0.494,
                "pos": 0.185,
                "compound": -0.296
            }
        },
        {
            "author": "Stankia",
            "score": 12,
            "body": "Because in the 2070s they will be driving a 2020s era electric minibus. And that's only if Africa's economic situation stays the same, which it wont.",
            "created_utc": 1633554675.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "KITTYONFYRE",
            "score": 7,
            "body": "except this synthetic fuel will be way more expensive than regular gas, so I'm not sure it's a solution for developing countries, either.",
            "created_utc": 1633552563.0,
            "sentiment": {
                "neg": 0.087,
                "neu": 0.823,
                "pos": 0.09,
                "compound": 0.0192
            }
        },
        {
            "author": "ric2b",
            "score": 2,
            "body": "Right, that bus driver is going to upgrade to the latest vehicles with F1 tech. If you can't afford an AMG project one what are you even doing?",
            "created_utc": 1633554947.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Silas13013",
            "score": 16,
            "body": "Based on their replies in this thread, they doesn't understand what a biofuel is",
            "created_utc": 1633544944.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "phixionSC2",
            "score": -1,
            "body": "They do not exactly prevent it.\n\nBut the production of e-fuels is still very inefficient compared to charging a battery powered vehicle and there will be a high demand for climate neutral fuels where there is no other option. For example aviation, long distance freight transport, steel and chemical industries. \n\n\nThis might change if we are able to produce an enormous amount of excess climate neutral power which we could turn into synthetic fuels. Like with fusion power for example. But I really wouldn't bank on this being the case during our lifetime.\n\nIf we want to save the planet, a ban for even driving cars with combustion engines will have to come, sooner or later. Or at best, it will be so expensive that only the super rich will be able to afford to.",
            "created_utc": 1633547093.0,
            "sentiment": {
                "neg": 0.065,
                "neu": 0.779,
                "pos": 0.156,
                "compound": 0.9556
            }
        },
        {
            "author": "The_Crazy_Swede",
            "score": 2,
            "body": "As someone with degrees in chemistry can I say that battery fires shure does need oxygen, but less of it. the reason why they are so dangerous is that they can catch fire from oxygen without an ignition source so if you don't find a way to permanently incase them in a way that prevents oxygen from reaching the battery. So water is a bad idea cause it carries oxygen and chemicals are bad because the good ones are very dangerous for both the environment and the animals living there. So we're stuck with containing the fire enough so it doesn't puncture more cells and let the damaged cells burn out.",
            "created_utc": 1633545934.0,
            "sentiment": {
                "neg": 0.232,
                "neu": 0.714,
                "pos": 0.054,
                "compound": -0.9818
            }
        },
        {
            "author": "RunninOnMT",
            "score": 25,
            "body": "Not true, I can get carrots anywhere, not just at the race track.",
            "created_utc": 1633544256.0,
            "sentiment": {
                "neg": 0.163,
                "neu": 0.837,
                "pos": 0.0,
                "compound": -0.3252
            }
        },
        {
            "author": "davewritescode",
            "score": 2,
            "body": "I mean the problems is that you lose energy creating, transporting and burning the fuel.  The losses add up.\n\nWhat’s interesting here is that if you have cheap enough energy from nuclear, renewables and maybe one day fusion, it won’t matter.\n\nThe problem with batteries is that we’re a long way off from being able to use them for energy dense applications like trucking, flying and container ships.\n\nPersonal cars as EVs is basically a solved problem with cost and infrastructure the only real barriers left to mass adoption.",
            "created_utc": 1633560249.0,
            "sentiment": {
                "neg": 0.127,
                "neu": 0.714,
                "pos": 0.159,
                "compound": 0.1027
            }
        },
        {
            "author": "Gilclunk",
            "score": 8,
            "body": "I think his point was that the emissions associated with *manufacturing* an EV are considerably higher than those for manufacturing a gas car. An EV typically earns that back over time due to lower emissions in operation. But if the gas car has net zero emissions in operation too thanks to renewable fuel, then its overall lifecycle emissions will actually be lower than those of an EV.",
            "created_utc": 1633560290.0,
            "sentiment": {
                "neg": 0.061,
                "neu": 0.886,
                "pos": 0.053,
                "compound": 0.1154
            }
        },
        {
            "author": "muggsybeans",
            "score": 0,
            "body": "I absolutely agree that charging a battery is pretty efficient but making the electricity to do so isn't... then the 5% transmission losses to get the power to your home, 1% conversion losses going from  AC to DC and then another going back to AC if the EV uses an AC motor etc. So if your utility provider produces at roughly 45% efficiency then you knock off another 6% getting the power to your home and charging the battery ... Your EV is now 39% efficient. Hybrids are 41% efficient. It all depends on your power supply.",
            "created_utc": 1633614847.0,
            "sentiment": {
                "neg": 0.063,
                "neu": 0.79,
                "pos": 0.147,
                "compound": 0.815
            }
        },
        {
            "author": "samwisetg",
            "score": 1,
            "body": "Depends. Where I live 90% of electricity is non-renewable (coal and gas) and that doesn’t look like meaningfully changing for a long time.",
            "created_utc": 1633606045.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.898,
                "pos": 0.102,
                "compound": 0.3612
            }
        },
        {
            "author": "codename_wizard",
            "score": 0,
            "body": ">The point is that there is no \"largest source of emissions\" in F1 because it's bought for. They've been ahead of the curve in terms of emissions compliance even during a time where no one else was doing it.\n\nYou cannot buy yourself out of emissions, emissions are still emissions  \n\n\nAnd for all the marketing hype of \"technological advancements trickling down to normal cars\" that just doesn't seem to have been happening. Only a couple of car companies have pushed the transition to sustainable transportation. None of them have been part of F1  \n\n\nMight be ahead of the curve in useless compliance, but I don't think any fans or potential fans really care about that. Why would they?",
            "created_utc": 1633608656.0,
            "sentiment": {
                "neg": 0.05,
                "neu": 0.912,
                "pos": 0.038,
                "compound": 0.3694
            }
        },
        {
            "author": "None",
            "score": -17,
            "body": "You're telling me one ship couldn't move all of F1? Just get a bigger ship. Or better yet, downsize the circus. The amount of shit F1 moves around for every race is frankly disgusting.\n\nedit: lmao the downvotes for this. I guess you guys don't know how big boats get, exactly? you guys really are fucking stupid around here aren't you",
            "created_utc": 1633545154.0,
            "sentiment": {
                "neg": 0.153,
                "neu": 0.756,
                "pos": 0.092,
                "compound": -0.6722
            }
        },
        {
            "author": "Xygen8",
            "score": -4,
            "body": "Irrelevant; the St. Helena is big enough, and it's a pretty small ship in the grand scheme of things. Let's do the math. For convenience, I'll round the actual figures a bit but it won't affect the end result enough to make a difference.\n\nFirst, some definitions:\n\n* Volume of one TEU (twenty-foot equivalent unit, or the volume of one 20ft shipping container): [~32 m^3](https://en.wikipedia.org/wiki/Twenty-foot_equivalent_unit#Equivalence)\n\n* Volume of one LD39 container (largest standard air cargo container, only fits in the 747): [~16 m^3](https://en.wikipedia.org/wiki/Unit_load_device#Types) or 0.5 TEU\n\nNow, according to [this F1 article](https://www.formula1.com/en/latest/article.how-does-an-f1-team-get-two-cars-and-42-tonnes-of-freight-to-australiato-australia.7980SpcLE9VSvmBA7qGEA5.html), each of the 10 teams supposedly needs to move around 50 tons of cargo in 12 air cargo containers, as well as another 10 tons by sea.\n\nFor the air cargo, that adds up to 500 tons and 120 air cargo containers which, assuming they use the largest air cargo containers, is equivalent to a volume of 60 TEU.\n\nFor the sea cargo, the total mass adds up to 100 tons, and assuming the density of the sea cargo is roughly the same as the density of the air cargo (500 tons per 60 TEU, or ~10 tons per TEU), the volume would be 10 TEU.\n\nThat brings the grand total to 600 tons and 70 TEU. The St. Helena can carry [1800 tons](https://en.wikipedia.org/wiki/RMS_St_Helena_(1989\\)) and [92 TEU](http://rms-st-helena.com/2017/10/05/st-helena-line-withdraw-rms-st-helena-service-seeks-buyer-vessel/).\n\nConclusion: The St. Helena could quite comfortably transport the entire F1 circus in one go, with room to spare.",
            "created_utc": 1633553736.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.944,
                "pos": 0.056,
                "compound": 0.9151
            }
        },
        {
            "author": "verdegrrl",
            "score": 1,
            "body": "Please do not resort to personal insults.",
            "created_utc": 1633557583.0,
            "sentiment": {
                "neg": 0.277,
                "neu": 0.495,
                "pos": 0.228,
                "compound": -0.128
            }
        },
        {
            "author": "YouAreMentalM8",
            "score": 2,
            "body": "> Oh yes the Evora GT is high on the list. My main concern there is that the nearest dealer is a 3.5 hour drive away and I worry about parts support etc.\n\nYeah same deal for me and that contributed to me purchasing the GT4. With only one dealer within 10 hours of driving any direction, it would have been pretty risky. You either accept what that dealer says or pound sand (assuming you don't have a local indy shop / Lotus specialist).\n\n>But I do love the way it looks. And I love Lotus as a company in principle. I also love that it still has hydraulic power steering. I haven't driven a modern Porsche but I'm yet to find an electric rack that feels as good as my E90.\n\nThe steering on the Evora is absolutely amazing. Possibly the best rack I've ever driven, I'd say it's tied with the 997.2 GTS or close enough that I'd have to drive them back to back to say definitively. If I can remember, the 997 had a bit more lively steering (typical 911 stuff because the front end is so light) that danced in your hands, but the actual feeling of the surface was excellent with both. The 718 GT4 steering is about as good as EPAS gets as far as I can tell. I'd say it's on par with good hydraulic racks, but still a little behind the best hydraulic racks like those I just mentioned. The Evora also feels a faster around town than the GT4 despite actually being slower (or at least the 410 Sport I drove did) because of the theatre. The titanium sport exhaust was properly loud (even louder than the GT4 with valves open), it pulled hard through the gears and had plenty of low RPM torque thanks to the supercharger, and it garnered a lot of attention. If reliability/maintenance/value retention weren't concerns I believe the Evora 410 Sport was the better sports car for the street, but just not the better car to live with.  \n\n>I'll also need to decide if the cabin noise is something I can deal with, won't know until I drive one.\n\nFor sure, hope you get the opportunity to drive one and the GTS 4.0 which is a little bit quieter and softer from what I hear.",
            "created_utc": 1633969586.0,
            "sentiment": {
                "neg": 0.028,
                "neu": 0.778,
                "pos": 0.193,
                "compound": 0.9978
            }
        },
        {
            "author": "Drzhivago138",
            "score": 1,
            "body": "Former dairy farmer here: There's a lot more to it than that. We never even grew wheat when we had dairy.\n\nAnd are you counting byproducts like DDG as \"cultivated corn\"? Because humans aren't exactly able to consume that anyway.",
            "created_utc": 1633612678.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.94,
                "pos": 0.06,
                "compound": 0.3612
            }
        },
        {
            "author": "spicybright",
            "score": 3,
            "body": "Oh great. What the hell am I supposed to outrage about now.",
            "created_utc": 1633553398.0,
            "sentiment": {
                "neg": 0.376,
                "neu": 0.429,
                "pos": 0.195,
                "compound": -0.5859
            }
        },
        {
            "author": "dishwashersafe",
            "score": 2,
            "body": "Dude, I'm not trying to guilt you into an EV or anything. You said \"car emissions... do not matter\". That's wrong. They account for 17% of greenhouse gas emissions. Let's not even mention the human health cost of the pollution.",
            "created_utc": 1633563839.0,
            "sentiment": {
                "neg": 0.025,
                "neu": 0.872,
                "pos": 0.103,
                "compound": 0.5096
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "I know exactly what you said, and it's wrong. We have thousands of square miles that can be converted into corn fields to fill this new demand.",
            "created_utc": 1633623109.0,
            "sentiment": {
                "neg": 0.155,
                "neu": 0.845,
                "pos": 0.0,
                "compound": -0.5574
            }
        },
        {
            "author": "Shufflebuzz",
            "score": 1,
            "body": "There's a *lot* of heat left over that's wasted.  \nExhaust gasses are still very hot. Engines need cooling systems.",
            "created_utc": 1633556775.0,
            "sentiment": {
                "neg": 0.241,
                "neu": 0.759,
                "pos": 0.0,
                "compound": -0.6597
            }
        },
        {
            "author": "elbers",
            "score": -13,
            "body": "Sorry, but sound is a pretty shitty reason to develop these fuels. It's not that f1 wouldn't be helpful to such a fuel of course it would. If the tech was possible it have been done by now. 🤷🏻‍♂️🤷🏻‍♂️ Ik ik \"innovation\", but millions of dollars and years of work say otherwise.",
            "created_utc": 1633542740.0,
            "sentiment": {
                "neg": 0.118,
                "neu": 0.782,
                "pos": 0.1,
                "compound": -0.0895
            }
        },
        {
            "author": "elbers",
            "score": -2,
            "body": "Suppressed technology is a thing, but idk what you're describing would have far larger consequences across all walks of life. I don't believe such a technology could be suppressed for a long/extended time. That's a completely different topic though.",
            "created_utc": 1633543206.0,
            "sentiment": {
                "neg": 0.04,
                "neu": 0.96,
                "pos": 0.0,
                "compound": -0.1531
            }
        },
        {
            "author": "None",
            "score": 3,
            "body": "Nothing is really carbon neutral without sequestration to back it up. 😐",
            "created_utc": 1633632206.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "ElJamoquio",
            "score": 1,
            "body": "Yes, but I'm still hoping somebody on the internet will explain to me how it relates to NOx emissions from an unregulated combustion source without aftertreatment",
            "created_utc": 1633556550.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.812,
                "pos": 0.188,
                "compound": 0.6757
            }
        },
        {
            "author": "SF90Reeve",
            "score": 1,
            "body": "Which serious competition? \n\nFormula e viewers and manufacturer support are both down compared to a couple of years ago and that viewership base was already a fraction of that of F1 . \n\n\n>Which they're well aware of and the reason of \"muh sound\" came right out of Christian Horner and Toto Wolff's mouths\n\n\nShow me where they said a feasible electric F1 formula was dismissed because of \"muh sound\" . Fully  electric F1 is still a couple or more engine formula regs away from being feasible.  There's no way in he'll fully electric F1 would've been ready within the next 5 years which is when the next engine formula regs debut . They weren't rejected because of sound they were rejected because of them not being feasible , sound is a secondary concern for now.",
            "created_utc": 1633630667.0,
            "sentiment": {
                "neg": 0.047,
                "neu": 0.884,
                "pos": 0.069,
                "compound": 0.4943
            }
        },
        {
            "author": "-QueenAnnesRevenge-",
            "score": 5,
            "body": "I thought NASCAR still ran a \"leaded\" fuel? Or is what you said what I think?",
            "created_utc": 1633561915.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": -2,
            "body": "Meth is used when the cars don’t need to go long distance like in drag cars",
            "created_utc": 1633569289.0,
            "sentiment": {
                "neg": 0.103,
                "neu": 0.761,
                "pos": 0.136,
                "compound": 0.1531
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "is it Indy Car that is running ethanol?",
            "created_utc": 1633631808.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[deleted]",
            "created_utc": 1633620496.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "FuriousGorilla",
            "score": 1,
            "body": "Rednecks, but with roughneck money.",
            "created_utc": 1633615848.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "toelock",
            "score": 11,
            "body": "So if I put vodka into my Kia it becomes a Type R?",
            "created_utc": 1633558404.0,
            "sentiment": {
                "neg": 0.259,
                "neu": 0.741,
                "pos": 0.0,
                "compound": -0.6369
            }
        },
        {
            "author": "biciklanto",
            "score": 2,
            "body": "\"We need a man who has the words 'welcome aboard!' tattooed on his John. Have I found that man?\"\n\n\"Well sir, as luck would have it, you have\"",
            "created_utc": 1633613514.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.717,
                "pos": 0.283,
                "compound": 0.8172
            }
        },
        {
            "author": "Vintage_Lobster",
            "score": 25,
            "body": "Regulations are good, it’s what keeps engineering exciting. Lap times continue to go down as regulations go up, and that’s because of all the insane thought that’s going on.",
            "created_utc": 1633563105.0,
            "sentiment": {
                "neg": 0.078,
                "neu": 0.747,
                "pos": 0.175,
                "compound": 0.5267
            }
        },
        {
            "author": "northyj0e",
            "score": 7,
            "body": "What we all secretly want is properly open racing. It'll be dominated by the fast teams but we'll see some shit man.",
            "created_utc": 1633563033.0,
            "sentiment": {
                "neg": 0.188,
                "neu": 0.768,
                "pos": 0.044,
                "compound": -0.6956
            }
        },
        {
            "author": "None",
            "score": 17,
            "body": "[deleted]",
            "created_utc": 1633555277.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 12,
            "body": "[deleted]",
            "created_utc": 1633556499.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "220mtm",
            "score": 3,
            "body": "As with all ICE cars, it's all about the launch. If you're not in the right revvs, your 550hp car suddenly has 110hp.",
            "created_utc": 1633614054.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "220mtm",
            "score": 1,
            "body": "I never said tuner or modified cars. This is about a 50k car ripping 200k+ cars to shreds.    Modified Civics usually blow up after a few runs so they don't count.\n\nOh and the only reason why someone would take a 911 over a Ferrari is because they can't afford a Ferrari, one is a sports car, the other is a exotic car, they aren't even in the same category.",
            "created_utc": 1633614018.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Silas13013",
            "score": 48,
            "body": "When people say cheaper they usually think 4 dollars a gallon like regular gas is now, which will likely never happen.  Porsche's goal is to get net carbon zero fuel down to 30 dollars a gallon which is wildly out of the price range for most commuters.  It will keep ICE cars moving but not for most people.",
            "created_utc": 1633545118.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.97,
                "pos": 0.03,
                "compound": 0.1901
            }
        },
        {
            "author": "M4rzzombie",
            "score": 11,
            "body": "The issue is demand might not increase. The more average people adopt electric cars, the less of a demand for a hydrocarbon fuel. \n\nWhether we like it or not, car enthusiasts may not be a big enough group of people to keep the ICE alive.",
            "created_utc": 1633545040.0,
            "sentiment": {
                "neg": 0.13,
                "neu": 0.734,
                "pos": 0.136,
                "compound": 0.3247
            }
        },
        {
            "author": "None",
            "score": 6,
            "body": "[deleted]",
            "created_utc": 1633545553.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "SinisterHippos",
            "score": 3,
            "body": "If the product is niche, costs don't go down. For example, vacuum tube audio equipment. It's been around for a while but it's still much more expensive than fully digital audio equipment. \n\nI see synthetic fuel in this group. Used by a niche group of car enthusiasts with a ton of money to spend on fuel and willing to spend that much to stay carbon neutral and not willing to go the more economical route of EV.\n\nIt makes sense why Porsche is looking into it. Their entry level Macan has an average owner income of $440k.",
            "created_utc": 1633569571.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.969,
                "pos": 0.031,
                "compound": 0.4767
            }
        },
        {
            "author": "alexkidd03",
            "score": 1,
            "body": "No. You don't even know what \"it\" is. Sustainable probably means plant based. Plant based means you need land and water. Current biofuels that use corn are cool but there isn't enough land to supply the world's demand.",
            "created_utc": 1633545126.0,
            "sentiment": {
                "neg": 0.044,
                "neu": 0.914,
                "pos": 0.042,
                "compound": -0.0258
            }
        },
        {
            "author": "The_Flying_Sausage",
            "score": 1,
            "body": "The demand part is what’s important though—what is the demand going to be when internal combustion engines are being regulated into obscurity? Sure there will be an enthusiast demand for ICE, but when the average person is commuting in an electric car, the demand probably won’t be high enough to justify it.",
            "created_utc": 1633545204.0,
            "sentiment": {
                "neg": 0.099,
                "neu": 0.814,
                "pos": 0.087,
                "compound": 0.0772
            }
        },
        {
            "author": "standbyforskyfall",
            "score": 1,
            "body": "keep in mind the demand for it will drop and drop and drop, driving up prices over time.",
            "created_utc": 1633546310.0,
            "sentiment": {
                "neg": 0.358,
                "neu": 0.642,
                "pos": 0.0,
                "compound": -0.7003
            }
        },
        {
            "author": "None",
            "score": 2,
            "body": "[removed]",
            "created_utc": 1633570838.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "Merc just did too",
            "created_utc": 1633633196.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "lolcutler",
            "score": 7,
            "body": "with a sustainable fuel they can bring back the V12s. the same way porsche is trying to make one to keep older road cars going",
            "created_utc": 1633560426.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "7Seyo7",
            "score": 3,
            "body": "It's the reason you've got an energy drink company there, and why Alfa Romeo put their name on the team even though they don't actually run it",
            "created_utc": 1633560520.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.925,
                "pos": 0.075,
                "compound": 0.2732
            }
        },
        {
            "author": "TODO_getLife",
            "score": 1,
            "body": "You need teams with deep pockets racing in F1 otherwise the sport is dead. These same teams usually come from car companies who use F1 to acceralte their R&D. If this doesn't align then they'll leave the sport and it'll die.",
            "created_utc": 1633564921.0,
            "sentiment": {
                "neg": 0.198,
                "neu": 0.802,
                "pos": 0.0,
                "compound": -0.8555
            }
        },
        {
            "author": "Shadow703793",
            "score": 29,
            "body": "It is, but per new global agreements my understanding is that it's Bunker C now needs to be at 0.5% or lower Sulphur content.",
            "created_utc": 1633565652.0,
            "sentiment": {
                "neg": 0.102,
                "neu": 0.801,
                "pos": 0.097,
                "compound": -0.0387
            }
        },
        {
            "author": "Cannablessed112",
            "score": 2,
            "body": "Just use NOS 😂",
            "created_utc": 1633614809.0,
            "sentiment": {
                "neg": 0.162,
                "neu": 0.513,
                "pos": 0.325,
                "compound": 0.4404
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "Yes. 1. Marketing $$$ 2. Engineering to trickle eventually into their consumer product lines for $$$",
            "created_utc": 1633633398.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.847,
                "pos": 0.153,
                "compound": 0.4019
            }
        },
        {
            "author": "AdOne6256",
            "score": 26,
            "body": "You're actually mostly correct, but Williams is probably the worst example of the lot in terms of trickling down haha. That's 25% of their revenue, which is far more than anything gained by Renault/Mercedes/Honda/Ferrari. \n\nIn 2018, the racing team made 130m pounds, and their Applied Engineering arm made 44m pounds. They actually make quite a bit from selling their expertise in things like batteries, flywheels, lightweight materials, etc. They mainly sell to OEMs and race car manufacturers.",
            "created_utc": 1633546661.0,
            "sentiment": {
                "neg": 0.077,
                "neu": 0.8,
                "pos": 0.123,
                "compound": 0.6243
            }
        },
        {
            "author": "MyRedditHandle2021",
            "score": 10,
            "body": ">What does Red Bull who fields two teams gain in R&D by participating in Formula 1.\n\nWings, obviously.",
            "created_utc": 1633550455.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.833,
                "pos": 0.167,
                "compound": 0.5267
            }
        },
        {
            "author": "AFrozen_1",
            "score": 1,
            "body": "Red Bull technologies was partnered with Aston for a long time.  They also share tech with other racing series.  Most notably, the aeroscreen in IndyCar.",
            "created_utc": 1633559999.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.916,
                "pos": 0.084,
                "compound": 0.296
            }
        },
        {
            "author": "Rillist",
            "score": 29,
            "body": "And Lemans is pushing hydrogen and Toyota already has a hydrogen rally car",
            "created_utc": 1633542411.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "royalewitcheese93",
            "score": -2,
            "body": "Id say its the reverse.  The Toyota Prius had been out for what a decade by the time F1 went hybrid?  F1 functions by marketing itself as the pinnacle of motorsport and technology.  The move to hybrids and biofuels are reactionary to keep the technology and marketing relevant to manufacturer lineups and mission statements, so that the pretige and marketing payoff are worth the costs of participation in the sport.  Outside innovation is trickling into Formula 1 so that it can stay relevant rather than trickling out.",
            "created_utc": 1633550441.0,
            "sentiment": {
                "neg": 0.027,
                "neu": 0.923,
                "pos": 0.05,
                "compound": 0.4767
            }
        },
        {
            "author": "70stang",
            "score": 12,
            "body": "No, they're racing in Qatar later this year and you can visit all the mass graves.",
            "created_utc": 1633546880.0,
            "sentiment": {
                "neg": 0.128,
                "neu": 0.872,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "Bounty1Berry",
            "score": 2,
            "body": "I'd love to see a race series of completely insane third-world taxi/tuktuk/scooter drivers given 1500 horsepower race cars.",
            "created_utc": 1633573821.0,
            "sentiment": {
                "neg": 0.129,
                "neu": 0.69,
                "pos": 0.181,
                "compound": 0.2975
            }
        },
        {
            "author": "ApoIIoCreed",
            "score": 8,
            "body": "Well it's far cheaper for a government, or the international community, to subsidize synthetic fuel rather than subsidize the upgrade of every developing nation's transportation infrastructure to be EV (which would involve replacing all of those ICE vehicles with EV).\n\nJust an example, but if the EU thought that the costs of climate change on their economy (like mass immigration into the EU from drought-struck developing nations)  were greater than the costs of carbon-neutral fuel subsidies, it would make financial-sense to subsidize the fuel.",
            "created_utc": 1633553483.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.91,
                "pos": 0.09,
                "compound": 0.7935
            }
        },
        {
            "author": "ApoIIoCreed",
            "score": 4,
            "body": "\nFrom the article: \n\n> F1 envisions the fuel also being used in the millions of internal-combustion vehicles that will remain on roads for years to come, with F1 discussing with fuel companies how to scale up production.\n\nSo, the point is to develop a sustainable fuel that is backwards-compatible with existing combustion engines. I agree that it would be totally pointless if it required a specialized engine, but the whole point of the project is addressing that issue.",
            "created_utc": 1633555370.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.978,
                "pos": 0.022,
                "compound": 0.1901
            }
        },
        {
            "author": "Stunt_Vist",
            "score": 2,
            "body": "Battery fires can create hydrogen and oxygen biproducts and flammable vapour; they're easier to disturb to the point of ignition than chemical fuels: a punctured fuel tank will likely not result in an instant fire, but a punctured battery pack easily could. You can't really isolate the cells well enough to prevent it from spreading to neighbouring cells, at least not in a financially feasible way compatible with mass production. Until something like aerogel-based insulation is financially feasible for mass production or different battery technology comes to market there really isn't an environmentally less damaging option than synthetic carbon neutral fuel for vehicles that drive 8+ hours almost every day of the year. Which also reminds me of how horrible battery degradation would be to deal with in that sort of application...",
            "created_utc": 1633636232.0,
            "sentiment": {
                "neg": 0.111,
                "neu": 0.786,
                "pos": 0.104,
                "compound": -0.6246
            }
        },
        {
            "author": "AntiGravityBacon",
            "score": 23,
            "body": "You can also get horses at some French restaurants!",
            "created_utc": 1633544450.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "codename_wizard",
            "score": 1,
            "body": "For short distance flights we are not very far off though. Long haul then yeah",
            "created_utc": 1633591069.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.864,
                "pos": 0.136,
                "compound": 0.296
            }
        },
        {
            "author": "KITTYONFYRE",
            "score": 1,
            "body": "you are not comparing apples to apples, your numbers are meaningless. moreover, you can't just add percentages like that. even with innefficiencies in making power, the power required to distill and produce gasoline, transport it, distribute it, etc makes gasoline cars less efficient when you consider total well to wheel efficiency.\n\nand we're completely ignoring the fact that renewables are moving towards taking up a larger and larger portion of the grid",
            "created_utc": 1633615515.0,
            "sentiment": {
                "neg": 0.072,
                "neu": 0.807,
                "pos": 0.121,
                "compound": 0.4601
            }
        },
        {
            "author": "KITTYONFYRE",
            "score": 2,
            "body": "electric cars are still more efficient per kW though! even with conventional gas",
            "created_utc": 1633608967.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.78,
                "pos": 0.22,
                "compound": 0.5244
            }
        },
        {
            "author": "ric2b",
            "score": 6,
            "body": "Each F1 team carries [multiple TRUCKS](https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fs-media-cache-ak0.pinimg.com%2Foriginals%2Feb%2Fb9%2F24%2Febb92455c672f890e5666c810e9fc421.jpg&f=1&nofb=1) and there are 10 teams on the grid.\n\nThey have to carry not only the cars but also spare parts, tires, tools and all the office equipment that the team uses.",
            "created_utc": 1633555201.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "topherhead",
            "score": 2,
            "body": "I do all my own work so shop availability isn't really an issue, but sometimes I don't want to wait a week for a part and I'd rather be able to just stop by the dealer and pay $100 extra to able to get it today or maybe 1-2 days because their internal logistics are better than what third party+UPS/FedEx can do.\n\nThe steering might be the deciding factor to me.  Whenever I drive a more modern BMW I get really annoyed by, not only the feel in general, but how it changes.  Feather light when going slow and arbitrarily stiff at x speed.  I'd rather it just be consistent.  There's a good chance that after trying the HPAS, the EPAS of the 718 might be a non-start for me.\n\nI know it's nitpicking, but I feel I have the right to nitpick as this price point :D",
            "created_utc": 1633972690.0,
            "sentiment": {
                "neg": 0.058,
                "neu": 0.847,
                "pos": 0.095,
                "compound": 0.8472
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "No. We are now using to much land to produce food, using even more to produce fuel would fuck up the environment even more. Lets not do this.",
            "created_utc": 1633624267.0,
            "sentiment": {
                "neg": 0.115,
                "neu": 0.885,
                "pos": 0.0,
                "compound": -0.5423
            }
        },
        {
            "author": "gumol",
            "score": 1,
            "body": "Sure, a lot of heat is wasted, but ICE engines are heat engines. They need that heat to function.",
            "created_utc": 1633560508.0,
            "sentiment": {
                "neg": 0.101,
                "neu": 0.819,
                "pos": 0.08,
                "compound": -0.1154
            }
        },
        {
            "author": "GermanCommentGamer",
            "score": 12,
            "body": "> If the tech was possible it have been done by now.\n\nI'm sorry but this is absolutely not how science works. There simply wasn't a need or desire for such a fuel until a few years ago when EVs started becoming mainstream.",
            "created_utc": 1633543649.0,
            "sentiment": {
                "neg": 0.025,
                "neu": 0.897,
                "pos": 0.078,
                "compound": 0.5267
            }
        },
        {
            "author": "danbfree",
            "score": 1,
            "body": "AKA trees, are the best natural example, but let's hope these newer tech we're seeing can maybe do something with that carbon scrubbed out of the air instead of just creating more landfill with it's capture media as \"sequestration\".",
            "created_utc": 1633636752.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.761,
                "pos": 0.239,
                "compound": 0.875
            }
        },
        {
            "author": "elbers",
            "score": 0,
            "body": "You continue to put words into my mouth. The electric cars could easily do more bhp. The current rules are about getting as many cars on the track as possible. Which is distinct from f1 atm. And yeah no shit more people watch f1. Listen man I love f1, but continuing to act like electric cars aren't happening, and they're gonna make clean gas all the sudden is a mistake. I don't think f1 is going anywhere. I do, however, worry about its prestige.",
            "created_utc": 1633633510.0,
            "sentiment": {
                "neg": 0.071,
                "neu": 0.779,
                "pos": 0.15,
                "compound": 0.6919
            }
        },
        {
            "author": "BrentRS1985",
            "score": 23,
            "body": "C16 is a high octane leaded fuel often used in drag racing, nascar runs something much like a 98 octane version of pump gas.",
            "created_utc": 1633562116.0,
            "sentiment": {
                "neg": 0.072,
                "neu": 0.833,
                "pos": 0.095,
                "compound": 0.1531
            }
        },
        {
            "author": "fireinthesky7",
            "score": 8,
            "body": "NASCAR hasn't used leaded fuel since 2007 or so, and they've been running an ethanol blend for the last few years, somewhere around 15%. Indycar uses nearly 100% ethanol for their fuel, with additives to make fires show up. They used to use mostly methanol fuel, but that was outlawed back in the 90's. Formula 1 fuel was a crapshoot back in the 80's when the cars were running 1,500 hp turbo engines, but it's been a higher-octane version of pump gas for the last 20 years or so.",
            "created_utc": 1633581563.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "BrentRS1985",
            "score": 2,
            "body": "Indycar used methanol until 2007, but it seems they’ve switched to e85, which means I was wrong in my first comment where I said that most race cars don’t use e85.  It seems methanol has been being phased out of long distance racing for safety reasons and fuel economy.",
            "created_utc": 1633569826.0,
            "sentiment": {
                "neg": 0.076,
                "neu": 0.857,
                "pos": 0.067,
                "compound": -0.1154
            }
        },
        {
            "author": "spongebob_meth",
            "score": 1,
            "body": "Which would apply to any car made in the last 30 years, when fuel systems started being designed for alcohol.",
            "created_utc": 1633623057.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "spongebob_meth",
            "score": 1,
            "body": "They don't have any money left after they dump it all into their diesel truck",
            "created_utc": 1633616489.0,
            "sentiment": {
                "neg": 0.157,
                "neu": 0.843,
                "pos": 0.0,
                "compound": -0.3818
            }
        },
        {
            "author": "brainwastook",
            "score": 2,
            "body": "yes but no",
            "created_utc": 1633559591.0,
            "sentiment": {
                "neg": 0.496,
                "neu": 0.177,
                "pos": 0.327,
                "compound": -0.2382
            }
        },
        {
            "author": "HotdogRacing",
            "score": 1,
            "body": "Put some in your belly and it'll certainly look like it.",
            "created_utc": 1633592383.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.647,
                "pos": 0.353,
                "compound": 0.5994
            }
        },
        {
            "author": "sundark94",
            "score": 1,
            "body": "It's a Hyundai, so it becomes an N.",
            "created_utc": 1633593194.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Dr_Death_Defy24",
            "score": 11,
            "body": "Unfortunately lower lap times = engineering achievement but != exciting racing. In fact, I think the last 5-7 years of top flight motorsports have shown that the inverse relationship is usually true; lower lap times have meant *worse* racing.",
            "created_utc": 1633569047.0,
            "sentiment": {
                "neg": 0.2,
                "neu": 0.607,
                "pos": 0.193,
                "compound": 0.3054
            }
        },
        {
            "author": "noisymime",
            "score": 2,
            "body": "For some regulations I agree, but there is nothing good that comes from the fuel flow limit. All is does is make the on track speed more consistent throughout a race rather than different cars being on different strategies (Which is what makes so many race interesting to watch). It would be like forcing teams to only have a single compound with no tire changes for the whole race.",
            "created_utc": 1633575203.0,
            "sentiment": {
                "neg": 0.075,
                "neu": 0.812,
                "pos": 0.113,
                "compound": 0.4654
            }
        },
        {
            "author": "noisymime",
            "score": 1,
            "body": "I don't know if that argument is all that true anymore now that there's the cost cap. Even if you opened things right up, teams should should all have basically the same opportunity to work within the rules as they're all limited by the same cost.\n\nThe problem is that you'll end up with engines that have even less relevance to road cars than we have today.",
            "created_utc": 1633563866.0,
            "sentiment": {
                "neg": 0.095,
                "neu": 0.83,
                "pos": 0.075,
                "compound": -0.128
            }
        },
        {
            "author": "merelyadoptedthedark",
            "score": 3,
            "body": "It probably looks faster then it really is, that's what happens when you mount the camera down low like that.",
            "created_utc": 1633568492.0,
            "sentiment": {
                "neg": 0.093,
                "neu": 0.796,
                "pos": 0.111,
                "compound": 0.1027
            }
        },
        {
            "author": "None",
            "score": 4,
            "body": "Polo probably was more prepared for the launch",
            "created_utc": 1633564423.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.761,
                "pos": 0.239,
                "compound": 0.2944
            }
        },
        {
            "author": "WarDEagle",
            "score": 1,
            "body": "Tuner car or not, I’ll still enjoy my 911 regardless of what any given economy car does at a stop light. I’m having trouble even understanding the point of such a consideration, unless you’re assuming that people buy cars like a 911 to be faster than other cars at a stoplight, haha. \n\nAnd thank you for explaining my purchasing decisions to me, lol. There’s so much assumption and glaring lack of experience in your statement that instead of debating it I’ll just say that I hope that one day you’re fortunate enough to be able to afford those types of cars, because then you may (or may not, who knows?) have a better understanding about what you’re talking about.",
            "created_utc": 1633618827.0,
            "sentiment": {
                "neg": 0.072,
                "neu": 0.786,
                "pos": 0.142,
                "compound": 0.8648
            }
        },
        {
            "author": "None",
            "score": 23,
            "body": "There is nothing stopping other manufacturers from getting in the business. There are many other things to consider.",
            "created_utc": 1633545758.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.922,
                "pos": 0.078,
                "compound": 0.1139
            }
        },
        {
            "author": "ifyouhatepinacoladas",
            "score": 22,
            "body": "ICE cars will be the horses of the modern era - owning one will be an expensive hobby (already kind of is tbh)",
            "created_utc": 1633545543.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "uTukan",
            "score": 1,
            "body": ">they usually think 4 dollars a gallon like regular gas is now\n\n**Cries in Europe (not even the UK)**",
            "created_utc": 1633550792.0,
            "sentiment": {
                "neg": 0.122,
                "neu": 0.766,
                "pos": 0.113,
                "compound": -0.0516
            }
        },
        {
            "author": "404merrinessnotfound",
            "score": 1,
            "body": "Yea that’s a valid concern",
            "created_utc": 1633582730.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "420Sailing",
            "score": 1,
            "body": "The inverse take is the more EVs saturate the roads and market, the more special and desirable ICEs become. The world of high performance cars is already catered to the elite",
            "created_utc": 1633629435.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.839,
                "pos": 0.161,
                "compound": 0.6764
            }
        },
        {
            "author": "420Sailing",
            "score": 1,
            "body": "Everything about driving a classic car is pointless. No one is going to choose not to drive their air-cooled because the fuel is produced inefficiently.",
            "created_utc": 1633629514.0,
            "sentiment": {
                "neg": 0.084,
                "neu": 0.916,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "None",
            "score": 14,
            "body": "Porsche's e fuel is made out of CO2 and hydrogen. I think it's you who doesn't know what \"it\" is.\n\nEdit: also biofuels release carbon when you burn them the point of porsches e fuel is to be carbon neutral",
            "created_utc": 1633545544.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "davewritescode",
            "score": 6,
            "body": "As people below you have hinted at, Porsche is using wind energy to suck co2 out of the air in the Andes mountains and turn it into ethanol.\n\nhttps://newsroom.porsche.com/en/2020/company/porsche-siemens-energy-pilot-project-chile-research-development-synthetic-fuels-efuels-23021.html\n\nThe real issue is costs and scalability.   This is the first semi realistic option for things that need really high energy densities like planes, boats and 911s and Formula 1 cars.",
            "created_utc": 1633561010.0,
            "sentiment": {
                "neg": 0.044,
                "neu": 0.85,
                "pos": 0.106,
                "compound": 0.4728
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "If the the fuels they burn don't release Carbon then they won't be considered into regulation that bans the release of carbon.",
            "created_utc": 1633545847.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "davewritescode",
            "score": 1,
            "body": "You still have lots of applications that just aren’t feasible with batteries alone because of the energy densities required.\n\nAirplanes are a great example of where batteries really don’t have a chance anytime soon.\n\nThis isn’t to say that EVs aren’t an important part of the personal transportation future but having an option to keep existing equipment useful while emitting net zero carbon is wonderful.",
            "created_utc": 1633561363.0,
            "sentiment": {
                "neg": 0.02,
                "neu": 0.769,
                "pos": 0.211,
                "compound": 0.9246
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "The demand for synthetic fuel is already zero because regular fuel is still available. Demand can only go up.",
            "created_utc": 1633546920.0,
            "sentiment": {
                "neg": 0.15,
                "neu": 0.85,
                "pos": 0.0,
                "compound": -0.25
            }
        },
        {
            "author": "AutoModerator",
            "score": 1,
            "body": "Your comment has been automatically removed because you posted a shortened or redirected (usually google) URL. Post a direct link to your source, not search results, AMP, or MSN.com. [Please see the rules in the sidebar, or by clicking here.](http://www.reddit.com/r/cars/wiki/rules)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cars) if you have any questions or concerns.*",
            "created_utc": 1633570851.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.931,
                "pos": 0.069,
                "compound": 0.5574
            }
        },
        {
            "author": "Stankia",
            "score": 3,
            "body": "What part of current fuel isn't sustainable in terms of F1? It will be available for decades to come.",
            "created_utc": 1633567783.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "InnerChemist",
            "score": 16,
            "body": "Yup. Was dropped from 3.5% to 0.5% last year. \n\nThough realistically they’ll keep burning the high sulfur stuff and hope they don’t get caught.",
            "created_utc": 1633569439.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.888,
                "pos": 0.112,
                "compound": 0.4404
            }
        },
        {
            "author": "DEATH-BY-CIRCLEJERK",
            "score": 1,
            "body": "Cool, TIL thanks. I was thinking of teams like Haas and Williams but maybe they are outliers and the primary motive indeed is R&D for most teams.",
            "created_utc": 1633546713.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.818,
                "pos": 0.182,
                "compound": 0.5187
            }
        },
        {
            "author": "royalewitcheese93",
            "score": 1,
            "body": "I wouldn't call 2 years a long time with Aston Martin and yes the team obviously has expertise and information that can be applied to other disciplines but that doesn't explain what red bull benefits being involved in motorsport like other people think car manufacturers do with \"trickle down\" of F1 tech and r&d",
            "created_utc": 1633560767.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.857,
                "pos": 0.143,
                "compound": 0.8176
            }
        },
        {
            "author": "Jordan_Jackson",
            "score": 23,
            "body": "I'm all for hydrogen but it seems like there are just too many hurdles to overcome. It costs much more than gasoline, has to be pressurized in the tank and between pump uses, has complex transportation requirements and produces less power by weight when compared to gasoline and electric vehicles. \n\nI'm not saying we should stop research on it but I just don't really ever see it taking off anytime soon.",
            "created_utc": 1633550423.0,
            "sentiment": {
                "neg": 0.037,
                "neu": 0.904,
                "pos": 0.059,
                "compound": 0.1531
            }
        },
        {
            "author": "rcook55",
            "score": 3,
            "body": "I thought I just read that LeMans was creating a bio-fuel from wine castings (basically used grapes).",
            "created_utc": 1633550133.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.879,
                "pos": 0.121,
                "compound": 0.296
            }
        },
        {
            "author": "FF4_still_holds_up",
            "score": 1,
            "body": "Do they really!?",
            "created_utc": 1633572526.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "SGNick",
            "score": 1,
            "body": "It's a feedback loop. Market pressure makes Formula 1 expand into new technologies to remain market relevant. Over the course of the Formula, they develop and improve, and said improvements can trickle back to the general market.\n\nOne example of innovation that I can think of is that the hybrid market pushed F1 to develop hybrid engines, and then Mercedes-Petronas becomes the first engine maker to breach 50% thermal efficiency in an internal combustion engine. \n\nChasing efficiency (both engine efficiency and market efficiency) and chasing power lead to diffferent innovations, it's cool to see both",
            "created_utc": 1633606462.0,
            "sentiment": {
                "neg": 0.02,
                "neu": 0.776,
                "pos": 0.204,
                "compound": 0.9531
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "what a value!",
            "created_utc": 1633633677.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.426,
                "pos": 0.574,
                "compound": 0.4003
            }
        },
        {
            "author": "ric2b",
            "score": 2,
            "body": "Ok, that sounds quite awesome, thanks.\n\nSounds like a tall order but hopefully they manage it.",
            "created_utc": 1633555501.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.543,
                "pos": 0.457,
                "compound": 0.8436
            }
        },
        {
            "author": "davewritescode",
            "score": 1,
            "body": "Even the short haul flights are a problem.  The turnaround time on planes is incredibly fast and the faster you charge batteries the more heat you put into them and the longevity is eventually compromised.\n\nOne of the reasons electric cars are such a good match for personal use is that most people’s cars spent 10+ hours just sitting making it fine for charging relatively slowly.",
            "created_utc": 1633617539.0,
            "sentiment": {
                "neg": 0.038,
                "neu": 0.895,
                "pos": 0.067,
                "compound": 0.25
            }
        },
        {
            "author": "muggsybeans",
            "score": 0,
            "body": "> and we're completely ignoring the fact that renewables are moving towards taking up a larger and larger portion of the grid\n\nThis is way more complex than what people think. You can get an idea on how much of an impact renewables are having by accessing the CO2 emissions data from EPAs website. They've helped but it will be nowhere near what you are expecting. Just a case in point, most people will charge their vehicles at night when solar is not producing any power. You will be charging your vehicle with power almost 100% derived from fossil fuel. If you realized this and decided \"Hell, I'll just charge my vehicle during the day then.\" think again because utilities can't effectively create an additional source of renewable power generation for when you decide to plug in your car. There is 'x' amount of power produced from renewables and they will always operate at max capacity. Renewables can be considered base loaded plants. They are not capable of following the demand on the power grid. They just put out 100% of whatever power they can produce. Any variable load will be picked up by fossil fuel plants and most likely those will be aero-derivative simple cycle units which are not very efficient... as a matter of fact, they are about as efficient as an old 1970's boiler power plant. Utilities are being forced to use these less efficient fossil fuel units because they can quickly adjust to renewables erratic output. So when you plug your car in during the day it is an additional variable load on the system and will be covered by that less efficient aero-derivative fossil fuel unit.\n\nIf you want to know how efficient your EV is, try to see if your power supplier releases data on how efficient their power generation is on a whole. Use that number and substract the transmission and energy conversion losses.\n\n>the power required to distill and produce gasoline, transport it, distribute it, etc\n\nAh, but crude oil isn't only distilled to produce gasoline to power motor vehicles. Only 40% of a barrel of crude oil is used for gasoline.",
            "created_utc": 1633630029.0,
            "sentiment": {
                "neg": 0.097,
                "neu": 0.843,
                "pos": 0.06,
                "compound": -0.9578
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "somewhat unrelated question - do you know if the current grid could support mass EV adoption with a couple hundred million EV's on the road? What's the US plan if not?",
            "created_utc": 1633634397.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.907,
                "pos": 0.093,
                "compound": 0.4696
            }
        },
        {
            "author": "None",
            "score": -9,
            "body": "Multiple trucks, woooow! That picture is certainly more than any known ship, anywhere in the world, could possibly carry - what a tremendous logistical feat that is! Those big, super heavy trucks, oh no, they aren't movable under anything except their own power, oh god. And the tools! The absolute weight of tools they must carry! And all those 25 pound tires! There is simply no possible way to put it all on one boat, oh no, not a chance \n\nYou'd think we'd have invented something called a \"ferry,\" or a container ship, or something like that. So bizarre we have the technology to make F1 cars but not to simplify the logistics of the series itself.",
            "created_utc": 1633556702.0,
            "sentiment": {
                "neg": 0.039,
                "neu": 0.892,
                "pos": 0.07,
                "compound": 0.5929
            }
        },
        {
            "author": "YouAreMentalM8",
            "score": 2,
            "body": "> The steering might be the deciding factor to me. Whenever I drive a more modern BMW I get really annoyed by, not only the feel in general, but how it changes. Feather light when going slow and arbitrarily stiff at x speed. I'd rather it just be consistent. There's a good chance that after trying the HPAS, the EPAS of the 718 might be a non-start for me.\n> \n> I know it's nitpicking, but I feel I have the right to nitpick as this price point :D\n\nAgreed, there is no point in compromising whatsoever at this price point. You definitely need to drive it. I have driven multiple modern BMWs and they have some of the WORST EPAS setups I have ever used. I recently drove an M2, I'll link the post, and my number one complaint was the god awful steering. This is no exaggeration, the steering in the M2 was almost less feelsome than in my Golf. It was WAY behind the ND2 Miata. And not even playing in the same ballpark as the GT4. So there is a really wide range of quality of EPAS steering. The GT4 is the best, I'd say other Porsche products are very good as well (991.2s/718s that I've driven), the ND2 is up there but not quite on par. If the GT4 steering was a 9/10 the M2 steering would be maybe a 2/10.\n\nhttps://old.reddit.com/r/cars/comments/pw4zcv/finally_drove_a_manual_bmw_m2_and_now_im_just/",
            "created_utc": 1633979916.0,
            "sentiment": {
                "neg": 0.083,
                "neu": 0.79,
                "pos": 0.127,
                "compound": 0.9239
            }
        },
        {
            "author": "elbers",
            "score": -10,
            "body": ">There simply wasn't a need or desire for such a fuel until a few years ago\n\nAre you high? There has been a desire for such a fuel for quite sometime. Trying hard until it works isn't how science works either.",
            "created_utc": 1633543870.0,
            "sentiment": {
                "neg": 0.037,
                "neu": 0.843,
                "pos": 0.12,
                "compound": 0.577
            }
        },
        {
            "author": "SF90Reeve",
            "score": 1,
            "body": ">You continue to put words into my mouth. The electric cars could easily do more bhp.\n\n\nThey could do more HP but then they wouldn't do anywhere near 300km at racing speeds . \nFormula e cars make 1/3 rd the power and can only last 1/3rd the distance of a F1 GP and that's on mickey mouse tracks on wide open proper racetracks the range will be even less . \n\nYou're the one missing the point here . Until electric technology progresses to the point where the cars can make 1000hp and last 300km at racing speeds electric F1 is simply unfeasible.  \n\nThis is nothing against electric cars in general they will definitely happen and they should and I have nothing against that but for the specific niche purpose of F1 battery technology isn't anywhere near ready yet to go fully electric.  \n\n>but continuing to act like electric cars aren't happening, and they're gonna make clean gas all the sudden is a mistake.\n\nAnd no F1 aren't acting like electric cars won't happen.  \nThe next engine regs feature a increased % of the overall power made by the electric side and that % will continue to grow . But for now to keep the speeds and distance of F1 an ICE is still required.  \n\n\nThere is nothing more they can do until battery technology progress to the level required . Until then are going \"green\" fuels + increased electric power . \n\n\nRespectfully none of your points make any sense .",
            "created_utc": 1633639743.0,
            "sentiment": {
                "neg": 0.051,
                "neu": 0.86,
                "pos": 0.089,
                "compound": 0.8903
            }
        },
        {
            "author": "-QueenAnnesRevenge-",
            "score": 4,
            "body": "Ok. Didn't know what C16 was.",
            "created_utc": 1633563543.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Ultra-sphinx",
            "score": 0,
            "body": "Meth could make comeback since the first stage of making synthetic fuels is turning C02 and hydrogen into methanol. Instead of doing further steps to turn it into e-gasoline, cars could just use straight meth.",
            "created_utc": 1633593250.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.947,
                "pos": 0.053,
                "compound": 0.2263
            }
        },
        {
            "author": "EEEliminator",
            "score": 3,
            "body": "Nothing on the cars resembles anything on a road car anyway. I’d rather see a truly unlimited class that has innovation and the pinnacle of performance.",
            "created_utc": 1633584845.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.814,
                "pos": 0.186,
                "compound": 0.6705
            }
        },
        {
            "author": "220mtm",
            "score": 1,
            "body": "Buddy... Only Porsche owners will kid themselves and think they have Ferrari Money. Average Ferrari owner has income of $1mil per year in 2021.   \"I hope that one day you’re fortunate enough to be able to afford those types of cars\"  You do realize you replied to one of my comments mentioning my Cayenne Turbo right?   \n\nPorsche is a sports brand, something most middle class people can afford.  Ferrari, Lambo, these are for the truly wealthy.",
            "created_utc": 1633620969.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.865,
                "pos": 0.135,
                "compound": 0.8807
            }
        },
        {
            "author": "None",
            "score": -1,
            "body": "E-fuels require carbon sequestration. No fucking way we start building that tech at scale just so people can keep combustion engines going. We need all of it we can possibly produce and more for whats already in the atmosphere.\n\nE-fuels will allow the weathy to drive their exotics though.",
            "created_utc": 1633591956.0,
            "sentiment": {
                "neg": 0.043,
                "neu": 0.92,
                "pos": 0.037,
                "compound": -0.0772
            }
        },
        {
            "author": "None",
            "score": 14,
            "body": "I don't think combustion engines will be impractical any time soon. Until energy density of batteries increases and they are a long way off.",
            "created_utc": 1633545941.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.916,
                "pos": 0.084,
                "compound": 0.2732
            }
        },
        {
            "author": "None",
            "score": 2,
            "body": "[deleted]",
            "created_utc": 1633636599.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "ham_coffee",
            "score": 2,
            "body": "Biofuels are still carbon neutral.  Porsches fuel would also release carbon while being carbon neutral.  Carbon neutral just means that the carbon release from combustion is the same as the carbon absorbed during production (Porsche using CO2, biofuels using atmospheric CO2 through photosynthesis).",
            "created_utc": 1633558809.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "alexkidd03",
            "score": 0,
            "body": "Damn. Haha. I don't see hydrogen mentioned in the article. Biofuels are mentioned.\n\nThis will be cool to see, but even Toyota is struggling to make hydrogen fuel cells work.",
            "created_utc": 1633546417.0,
            "sentiment": {
                "neg": 0.158,
                "neu": 0.739,
                "pos": 0.104,
                "compound": -0.4404
            }
        },
        {
            "author": "standbyforskyfall",
            "score": 1,
            "body": "No one is willing to spend 30 dollars a gallon on fuel",
            "created_utc": 1633548270.0,
            "sentiment": {
                "neg": 0.167,
                "neu": 0.833,
                "pos": 0.0,
                "compound": -0.296
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[removed]",
            "created_utc": 1633590718.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "Mythrilfan",
            "score": 1,
            "body": "Sustainable doesn't mean \"this thing won't vanish.\"",
            "created_utc": 1633608442.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "AFrozen_1",
            "score": 1,
            "body": "Haas might be the only outlier with how young that team is.  Almost every other team has some big sponsor or is linked to an automotive manufacturer.",
            "created_utc": 1633559911.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "AFrozen_1",
            "score": 1,
            "body": "Closer to 5 years (2016-2020) but I see your point.  At this time, the only real big innovation is the thermal efficiency of the engines.  A lot of the groundbreaking innovations that shaped the automotive landscape are from decades past.",
            "created_utc": 1633616463.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.851,
                "pos": 0.149,
                "compound": 0.7684
            }
        },
        {
            "author": "Rillist",
            "score": 6,
            "body": "Agreed, the energy required to produce hydrogen as a fuel is simply too much currently. The only viable way I see it is with nuke plants or solar/hydroelectric. Burning coal to produce hydrogen fuel is ridiculous, but these are early days. I back hydrogen because it doesn't seem to be effected by cold nearly as much as an electric car. I live in canada and our winters are vicious, a BEV loses 30% off the top simply because of climate",
            "created_utc": 1633551155.0,
            "sentiment": {
                "neg": 0.091,
                "neu": 0.848,
                "pos": 0.061,
                "compound": -0.5647
            }
        },
        {
            "author": "R_V_Z",
            "score": 13,
            "body": "Hydrogen will (maybe) be to long haul trucking as EVs will be to passenger vehicles. Big industrial vehicles just don't work well with the current battery tech (low range, long charging time).",
            "created_utc": 1633552932.0,
            "sentiment": {
                "neg": 0.115,
                "neu": 0.885,
                "pos": 0.0,
                "compound": -0.443
            }
        },
        {
            "author": "KITTYONFYRE",
            "score": 1,
            "body": "yes it easily could because there will not be a couple hundred million EVs on the road any time soon. it's gonna be a slow enough process that it will be fine\n\nhow should i know the plan im some moron on reddit, not a fuckin congressman",
            "created_utc": 1633636714.0,
            "sentiment": {
                "neg": 0.06,
                "neu": 0.81,
                "pos": 0.13,
                "compound": 0.4019
            }
        },
        {
            "author": "ric2b",
            "score": 9,
            "body": "Container ships could carry it but their trip times are measured in weeks when F1 has multiple races 4 days apart. \n\nOh, and container ships don't go on land or upriver.",
            "created_utc": 1633558938.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "topherhead",
            "score": 2,
            "body": "> BMW Fans, Proceed with caution\n\nUh oh.\n\nUltimately that's probably very encouraging for me.  I've driven a few late model BMWs and been seriously unimpressed with the steering feel.  I also had similar feelings with the ATS-V when I drove it.  The fact someone that agrees with me thinks highly of the GT4 rack is promising.  Of course right now I think even getting a test drive is going to be a pain.  I saw a used one an hour away sell for over 130k.  Good thing I can't get it yet!  I'm hoping to go all out and do Euro Delivery on it too.",
            "created_utc": 1633983849.0,
            "sentiment": {
                "neg": 0.062,
                "neu": 0.82,
                "pos": 0.119,
                "compound": 0.7773
            }
        },
        {
            "author": "elbers",
            "score": 1,
            "body": "You're arguing to convince me of something I still didn't say. But you win",
            "created_utc": 1633641281.0,
            "sentiment": {
                "neg": 0.102,
                "neu": 0.558,
                "pos": 0.34,
                "compound": 0.6908
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 3,
            "body": "I don't like the assumption that if you have ferrari money you'll get a ferrari and not a Porsche. I'd rather buy the Porsche and use the extra 150k to buy another toy; a boat. Just because people have the money doesn't mean they want to spend that much on a car. My boss takes home 15 million a year and drives and Audi Q7. Nothing special. But he uses his money for things he values more; like a private jet",
            "created_utc": 1633632546.0,
            "sentiment": {
                "neg": 0.049,
                "neu": 0.868,
                "pos": 0.083,
                "compound": 0.7135
            }
        },
        {
            "author": "WarDEagle",
            "score": 1,
            "body": "I’m enjoying your continued assumptions. Please, tell me more about my income and what I can and can’t afford!\n\nAside from that, though, you specifically mentioned an F355. That car went out of production 22 years ago and has not held value extraordinarily well. At the time that I purchased my 991, F355s were trading for a considerably lower price. So either you’re moving the goal posts for some reason or you don’t actually know anything about the cars you’re bringing up.\n\nThis discussion thread is *clearly* a waste of time. I’ll bow out by saying that I hope that you manage to find a way to get back to feeling superior in your Cayenne. My friendly suggestion: try not to get wrapped up in the image of your car purchases. That way, neither the VW Polo next to you nor comments from some strangers on Reddit will mean anything to you.",
            "created_utc": 1633621879.0,
            "sentiment": {
                "neg": 0.043,
                "neu": 0.828,
                "pos": 0.129,
                "compound": 0.9269
            }
        },
        {
            "author": "codename_wizard",
            "score": 2,
            "body": "Not that long. Most European countries will ban all new combustion cars within this decade. Eg the same amount of time since Lebron joined the Heat (for you Americans)  \n\n\nSome countries (like poster child Norway), even sooner",
            "created_utc": 1633591416.0,
            "sentiment": {
                "neg": 0.088,
                "neu": 0.852,
                "pos": 0.061,
                "compound": -0.2732
            }
        },
        {
            "author": "RobertM525",
            "score": 1,
            "body": "Many European countries are banning the sale of ICE cars in the next 5 to 10 years. Even if the technology isn't there for BEVs, not being able to sell ICE cars in Europe is going to dramatically change the landscape of the new car market.\n\nI honestly don't know what the enthusiast brands are going to do.",
            "created_utc": 1633571583.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.911,
                "pos": 0.089,
                "compound": 0.6705
            }
        },
        {
            "author": "JuliusCeaserBoneHead",
            "score": -12,
            "body": "500 mile EV’s in 2022, hold my beer",
            "created_utc": 1633547198.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "None",
            "score": 1,
            "body": "[deleted]",
            "created_utc": 1633618684.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "420Sailing",
            "score": 1,
            "body": "I did indeed, thats true.",
            "created_utc": 1633636726.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.588,
                "pos": 0.412,
                "compound": 0.4215
            }
        },
        {
            "author": "AutoModerator",
            "score": 0,
            "body": "If your post involves politics AND CARS, please consider submitting to /r/CarsOffTopic.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cars) if you have any questions or concerns.*",
            "created_utc": 1633590719.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.881,
                "pos": 0.119,
                "compound": 0.5574
            }
        },
        {
            "author": "Jordan_Jackson",
            "score": 4,
            "body": "Maybe and that is a big maybe. There isn't even proper infrastructure for Hydrogen vehicles and their range is similar to ICE-powered vehicles. You can't even drive from LA to San Fran without running out of Hydrogen.",
            "created_utc": 1633553202.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 1.0,
                "pos": 0.0,
                "compound": 0.0
            }
        },
        {
            "author": "YouAreMentalM8",
            "score": 2,
            "body": "Happy to help. Euro delivery seems like an absolutely awesome way to enjoy the car. What are you considering for spec? I would have liked PTS but ultimately ended up buying one off the lot for below MSRP (late 2020).\n\nIt's definitely tough to find one right now. All the dealers have marked them up above MSRP (even used). I talked to the dealer where I got the car and they said all sports car models (911/718) were sold out until 2023 deliveries, although it may not be as bad in your area.",
            "created_utc": 1634085064.0,
            "sentiment": {
                "neg": 0.017,
                "neu": 0.795,
                "pos": 0.189,
                "compound": 0.9453
            }
        },
        {
            "author": "220mtm",
            "score": -1,
            "body": "But since you asked, i'll oblige ! You cannot afford a Ferrari if you have to decide between a 911 and a Ferrari.   Deciding between the two literally means you can't a afford a Ferrari.  I don't need to feel superior in my Cayenne, I have other cars for that but thanks for the tip, will keep in mind :*",
            "created_utc": 1633622248.0,
            "sentiment": {
                "neg": 0.0,
                "neu": 0.807,
                "pos": 0.193,
                "compound": 0.9397
            }
        },
        {
            "author": "davewritescode",
            "score": 9,
            "body": "We’re talking about enthusiast cars here.   There’s currently nothing on the market that can handle track days without major compromises.\n\nEVs go 500 miles because they’re incredible good at taking a very small amount of energy and stretching it via regenerative braking and fantastic aerodynamics.\n\nThey’re also incredibly heavy, lose power as the battery discharges and require tons of cooling to keep them working.\n\nI love electric cars but they still suck for people who do track days.",
            "created_utc": 1633560793.0,
            "sentiment": {
                "neg": 0.067,
                "neu": 0.815,
                "pos": 0.118,
                "compound": 0.3522
            }
        },
        {
            "author": "Warren_Haynes",
            "score": 1,
            "body": "I can't wait for the day they solve the reduced range from the batteries in winter. My wife's model 3 loses about 1/3 of it's capacity once we get to average temps in the 20s",
            "created_utc": 1633632974.0,
            "sentiment": {
                "neg": 0.062,
                "neu": 0.889,
                "pos": 0.049,
                "compound": -0.128
            }
        },
        {
            "author": "codename_wizard",
            "score": 2,
            "body": ">In Europe you won't be able to buy new gas cars in a few years. 9 years comes around fast. In Norway I think the ban will happen in 4 years.\n\nWasn't commenting on politics, just that it looks like the trend is accelerating",
            "created_utc": 1633593478.0,
            "sentiment": {
                "neg": 0.075,
                "neu": 0.873,
                "pos": 0.052,
                "compound": -0.2732
            }
        },
        {
            "author": "ExternalHighlight848",
            "score": 0,
            "body": "People make those exact same arguments about electric cars.",
            "created_utc": 1633576462.0,
            "sentiment": {
                "neg": 0.252,
                "neu": 0.748,
                "pos": 0.0,
                "compound": -0.4019
            }
        },
        {
            "author": "topherhead",
            "score": 1,
            "body": "Well.  I won't really know until I actually order thing.  But the Python Green is lookin' reeeeeal good.  I might also just try to get as close to the millionth 911 scheme.  Did you see that thing?  God damn beautiful!\n\nBut yeah, right now, Python Green with Black interior and red accents.  Some of the givens.  6MT is absolutely mandatory.  If it weren't so hard to get manuals I wouldn't be looking at such an expensive car :[\n\nThe noon marker in red, gotta have it!  It's too cool not to!\n\nAuto windshield wipers/dimming windows.  For sure.\n\nMost likely the Chrono package.\n\nMaybe the LED headlights.  Maybe the bucket seats.  \n\nBut yeah.  Starting to look at a full car worth of options at this point so I probably wont go too far past that.\n\nOne of the things that is making me stretch for it though is that 6MTs are already a special breed.  In 10 years I'm thinking consumer car sales are going to be 50% or more EV.  So I think I need to get one before cars like these aren't made anymore.  Like realistically I might still be able to get one in 5 years but I need to move it from \"someday\" to \"next year\" before \"next year\" is too late.\n\nThat was a bit rambley but all that is to say; I think that the GT4 is going to hold its value incredibly well.  And in 15 years it might be worth more than I paid.  \n\nNow I don't buy cars as \"investments.\"  That's a fools game as far as I'm concerned.  I plan for them to be total losses in the long term (my BMW is worth maybe 10k now D:).   But in this case, having one that I'm confident wont eventually be worth 5k helps me justify being spendy with the add-ons.  It's also very likely going to be my \"Apex\" car.  My car after this is 99% going to be EV.  It'll be a sad day but it's also inevitable.  So for what I think is going to be my \"best\" car I might go all out.  Like I said, I won't know until I actually order the thing.",
            "created_utc": 1634100070.0,
            "sentiment": {
                "neg": 0.057,
                "neu": 0.788,
                "pos": 0.154,
                "compound": 0.9904
            }
        }
    ]
}