[
    {
        "comment": "> In a live presentation, Genesis added that one of the vehicles teased has suicide doors and lacks traditional B-pillars. It also features rotating swivel seats and advanced mood lighting. \n\nWill be interesting to see if this makes production.",
        "sentiment": "POSITIVE",
        "score": 0.9904561638832092
    },
    {
        "comment": "I cannot help but think that all of the brands announcing \"EV only by 2025\" or similar dates are going to have to reverse course.\n\nDon't get me wrong, EVs are absolutely the future.  I simply think that there won't be enough battery supply by 2025 and that most consumers would rather wait until batteries are significantly better in terms of capacity and charge times.\n\nOf course there is also the more realistic \"No more new ICE platforms by 2025,\" which in reality means they could be selling ICE cars on an older platform in 2035.",
        "sentiment": "NEGATIVE",
        "score": 0.9415627717971802
    },
    {
        "comment": "I actually was shopping Genesis vehicles not that long ago and after a test drive asked when the G80 electric version would be available. They said next year but they likely won't order any because there's been zero interest from their buyers for an electric Genesis outside of California.\n\nSo I'm interested to see how this plays out in 2025 with the US dealers.",
        "sentiment": "POSITIVE",
        "score": 0.7239042520523071
    },
    {
        "comment": "Ever since Michael Scott said that Dunder Mifflin was going carbon neutral, i haven’t been able to trust any company claiming they will.",
        "sentiment": "NEGATIVE",
        "score": 0.9990743398666382
    },
    {
        "comment": "it makes sense since in upscale & luxury rental markets, apartment owners are adding charging ports to garages. I was quite surprised until my dad's friend who owns a dozen complexes up & down California mentioned that EV charging is the biggest desire for prospective tenants in his price range, more so than hardwood floors or granite or multi-head showers or Viking stoves. He's been upgrading the electrical outlets in the garages of his building for the past couple yrs.",
        "sentiment": "POSITIVE",
        "score": 0.9825955629348755
    },
    {
        "comment": "Feels absolutely nutty to me when it feels like they really just hit their stride with the new G70 design.\n\nEVs are the perfect fit for a luxury brand, but 4 years to go all electric when al they have are ICE cars right now seems way too ambitious and exorbitantly costly when I can’t imagine they’ve recouped costs for the refreshed models yet.\n\nThis also feels infeasible from a basic materials/battery production standpoint. Even 2030 would feel a bit ambitious. 2025 sounds laughably impossible with how disrupted production/shipping will be even going into 2023. This chip shortage isn’t going to be resolved for at least another half year, if not another year.",
        "sentiment": "NEGATIVE",
        "score": 0.9991449117660522
    },
    {
        "comment": "Next: Genesis to become brand that doesn't know what the fuck it is.",
        "sentiment": "NEGATIVE",
        "score": 0.998583197593689
    },
    {
        "comment": "Sure they are",
        "sentiment": "POSITIVE",
        "score": 0.9997712969779968
    },
    {
        "comment": "I highly doubt that, but we'll see.",
        "sentiment": "POSITIVE",
        "score": 0.9996863603591919
    },
    {
        "comment": "Do people not do long distance driving anymore? Who the heck wants to sit at a charging station for 30 minutes every 400 miles?",
        "sentiment": "NEGATIVE",
        "score": 0.9993796348571777
    },
    {
        "comment": "So they're beginning with Genesis.",
        "sentiment": "POSITIVE",
        "score": 0.9803316593170166
    },
    {
        "comment": "EVs works best on Luxury brands right now with how silent they are rather than having an engine that constantly vibrates. The experience can be tailored based on the customers taste to either be more \"vroom\" or \"wheeeeee\".",
        "sentiment": "NEGATIVE",
        "score": 0.9436137080192566
    },
    {
        "comment": "I doubt this. Their biggest market is South Korea, and EV adoption here is pretty slow. Most people who lives in Seoul either don't have a dedicated parking space or have to park at a space outside on the street. Which means people have to rely on public chargers, which there aren't that many to begin with.\n\nIf their EVs include hybrids, it would make sense, otherwise I think this is just a marketing stunt of some sort.",
        "sentiment": "NEGATIVE",
        "score": 0.9996956586837769
    },
    {
        "comment": "With so many EVs about to hit the market with better cost/range/charge times I can't imagine spending money on a brand new ICE car right now. Honestly if I lost my DD today I'd probably just buy a cheap used car to hold me over for like 2-3 years until I make the switch to EV or at least PHEV.",
        "sentiment": "NEGATIVE",
        "score": 0.9992827773094177
    },
    {
        "comment": "I’d imagine the V8 model variants will fetch a premium in the future but genesis is barely acknowledged against most other brands and their makes & models.",
        "sentiment": "NEGATIVE",
        "score": 0.9945061802864075
    },
    {
        "comment": "Genesis needs to figure out what the hell it is.",
        "sentiment": "NEGATIVE",
        "score": 0.9995587468147278
    },
    {
        "comment": "Welp rip Genesis, you (didn't) have a good run.",
        "sentiment": "NEGATIVE",
        "score": 0.9913399815559387
    },
    {
        "comment": "Another brand I won't be buying.",
        "sentiment": "NEGATIVE",
        "score": 0.9502955079078674
    },
    {
        "comment": "No thanks Ill stick with my v8 :)",
        "sentiment": "NEGATIVE",
        "score": 0.990955650806427
    },
    {
        "comment": "Is that a coupe on the left side of the center line? It sure looks like it.",
        "sentiment": "POSITIVE",
        "score": 0.9741296172142029
    },
    {
        "comment": "Yeah ok lol",
        "sentiment": "POSITIVE",
        "score": 0.9986199140548706
    },
    {
        "comment": "Best business to get into rn is the portable ev battery charging industry seems like lol",
        "sentiment": "NEGATIVE",
        "score": 0.9933934807777405
    },
    {
        "comment": "My hopes of a hyundai based roadster are dwindling.",
        "sentiment": "NEGATIVE",
        "score": 0.9997016787528992
    },
    {
        "comment": "Ford and Nissan still use clamshells with no B-pillar on their full-size trucks. The swivel seats seem like they'd be the bigger issue.",
        "sentiment": "NEGATIVE",
        "score": 0.9862794876098633
    },
    {
        "comment": "I understand it was very hard for Ford to get the Continental with the suicide doors crash certified without a b-pillar. They wanted to go that way originally but couldn't figure out how to do it cost-effectively or while maintaining the look and functionality of the rest of the vehicle. Lincoln wasn't working with a unique platform designed with it in mind from the ground up though. They do it with trucks so it could be interesting.",
        "sentiment": "NEGATIVE",
        "score": 0.9984689354896545
    },
    {
        "comment": "Many cars on sale today have those features. Wouldn't really be surprising.",
        "sentiment": "NEGATIVE",
        "score": 0.9980412721633911
    },
    {
        "comment": "Both wouldn't be a first. But together it sounds interesting.   \nOpel sold the Meriva with suicide doors and Mazda had the rx8 with clamshell doors.  \nAnd vw sells the California with swivel front seats.  \n\nSo both should be doable. The question is if its cost effective enough to make it into series production.",
        "sentiment": "POSITIVE",
        "score": 0.8654513359069824
    },
    {
        "comment": "If they set a target date of 2030 it'll really be 2040. If they set a target date of 2040 it'll really be 2050. Target 2050, it'll be 2060.\n\nAny deadline is going to get missed when you're overhauling your entire business. Setting the date closer forces you to not drag your feet. Even if they push back a 2030 target, they're likely to be finished earlier than if they had set a 2040 target.",
        "sentiment": "NEGATIVE",
        "score": 0.933490514755249
    },
    {
        "comment": ">they could be selling ICE cars on an older platform in 2035\n\n*Nissan has entered the chat*",
        "sentiment": "NEGATIVE",
        "score": 0.961978554725647
    },
    {
        "comment": "I both think you're right and also lament that 2025 is already 4 years out.  I'm increasingly ready to ditch my ICE commuter car and switch to an EV.  I just don't think there's one on the market that fits what I want quite well enough yet for me to confident in switching now.  I'm definitely not an early adopter.",
        "sentiment": "NEGATIVE",
        "score": 0.9984098672866821
    },
    {
        "comment": "The battery supply part I totally agree with. The wait for a better battery I don’t. 250 miles of range and 30 min to charge (given the right charger) is already available on mid-priced EVs. Range concerns are so overblown for 98% of drivers. As EVs get more and more common and people see their neighbors never needing to fill up, always having a ‘full tank’ every morning, and the only need for a charge coming a few times per year on road trips that concern will fade. EVs are less of a hassle to keep ‘charged’ than ICE cars for 99% of driving days.",
        "sentiment": "NEGATIVE",
        "score": 0.9953403472900391
    },
    {
        "comment": "> Of course there is also the more realistic \"No more new ICE platforms by 2025,\" which in reality means they could be selling ICE cars on an older platform in 2035.\n\nthat's what they're doing.\n\n>Genesis has announced that it will transition to an all-EV brand from 2025\n\nIt's a \"transition\" to all-EV, occurring \"from\" 2025. \n\nObscure announcements about deadlines are all the rage at the moment, but really it translates to \"we don't have a decent hybrid line-up, and we don't have the volume to make plugin vehicles, so we want to sound progressive whilst not really having the capability to do that much for 5 years.\"\n\nSimilar to some of Audi's announcements, which are all about ceasing internal combustion engines in 5 years, but being very quiet about the fact that they have no hybrid tech, and around 1 in 2 vehicles they sell in europe are diesels with realistically no low-emissions replacement until BEVs gradually roll out across the range at the end of the decade.\n\nAlso bear in mind Genesis is a Hyundai sub-brand. Hyundai can launch Genesis versions of their EVs and afford to slow their Genesis roll-out without impacting too much of their bottom line (because Hyundai still has all their volume).",
        "sentiment": "NEGATIVE",
        "score": 0.9954902529716492
    },
    {
        "comment": "It's an interesting point. Although I don't agree with you.\n\nThey are going to keep selling their old ICE vehicles until people stop buying them. There probably won't be any big redesigns of new ICE cars except for a few after say 2023 or 2024. \n\nIn 5 years, every new EV will be better than a LR Model Y. Many will have batteries that charge to full in 15-20 minutes at charging stations that are everywhere. And they'll be cheaper than gas versions.\n\nIn that world, there isn't a lot of room for ICE cars. The only space they'll have is for people who don't want to change. The laggers. And the laggers just don't buy new cars. So they'll just keep driving their old ICE car until they turn to dust. \n\nThere will be market for new ICE cars, but that will continually get smaller as they get more expensive over time.",
        "sentiment": "NEGATIVE",
        "score": 0.9949407577514648
    },
    {
        "comment": "They also include FCEVs If you didint know.",
        "sentiment": "NEGATIVE",
        "score": 0.9558354616165161
    },
    {
        "comment": "Or they're recognizing a potential major drop in new ICE sales. You can only reverse course and keep selling new ICEs if you have *buyers*. As more and more people decide their next new car will be EV and not ICE that becomes a major factor. Cars last longer these days so they keep them fixed up or just buy used and cheap for a few more years. Companies hit a point of no return where they may see overall sales go way down as they can't sell ICEs anymore and they struggle to ramp up battery supply to keep up with demand for EVs.",
        "sentiment": "NEGATIVE",
        "score": 0.999294638633728
    },
    {
        "comment": "I don't see there being an issue here. The 2025 announcement is that there will be no new ICE models after that, but it's 2030 until they phase out engine production. \n\nI think a lot of these brands are actually aiming too far out, those that say 2030 had better be ready in case they have to pull that forward.",
        "sentiment": "NEGATIVE",
        "score": 0.9996761083602905
    },
    {
        "comment": "I think some will have only new cars be electric, but continue to sell the previous generation gas cars for years to follow.  Like the 2024 gas car still being produced and sold in 2027",
        "sentiment": "POSITIVE",
        "score": 0.7005966901779175
    },
    {
        "comment": "Another problem I see is the R&D costs that went into the 3.3T and 3.5T engines. All that effort so they could be used for only 4-6 years? That’s pretty nuts.",
        "sentiment": "NEGATIVE",
        "score": 0.9991660118103027
    },
    {
        "comment": "Toyota is probably poised to grab an increasingly large share of the ICE (including hybrids/PHEVs) pie.\n\nA lot of people will obviously switch to EVs, but they don't work for everyone.",
        "sentiment": "NEGATIVE",
        "score": 0.9950087070465088
    },
    {
        "comment": "Most of these manufacturers are saying “no new ice after X”. It’s not that they won’t sell ice, they just won’t be releasing new ice models.",
        "sentiment": "NEGATIVE",
        "score": 0.998997151851654
    },
    {
        "comment": "Remember in 2018, Volvo announced that all new cars would be electrified by 2021? Go count how many gas-only models you can buy from Volvo today 😂",
        "sentiment": "NEGATIVE",
        "score": 0.9886659383773804
    },
    {
        "comment": "Since genesis is simply Hyundai, all they have to do is sell ICE vehicles under the Hyundai/kia logo... it's not like thye're saying that Hyundai, and all of it's subsidiaries are going to be EV only by 2025...\n\nThis announcement is EASY for them to make, and adhere to... MEH on the 'impressive' scale.",
        "sentiment": "POSITIVE",
        "score": 0.9951695799827576
    },
    {
        "comment": "I personally don't get the point of \"EVs are the future\"\n\nThe cars themselves don't produce emissions, but to support the increasing grid demand, companies are building tons of natural gas plants",
        "sentiment": "POSITIVE",
        "score": 0.6839456558227539
    },
    {
        "comment": "I mentioned the same at a genesis dealer and the salesman didn't seem to even have it on his radar. Don't know if that's naivety on his part or if he really does know better. I do keep seeing more evs on the street in the meantime though..",
        "sentiment": "NEGATIVE",
        "score": 0.9990584254264832
    },
    {
        "comment": "God that sucks, I would LOVE an electric G80 or G70.",
        "sentiment": "NEGATIVE",
        "score": 0.9968738555908203
    },
    {
        "comment": "&#x200B;\n\nIt's debatable whether it even does. I don't think we have dimensions for the GV60 yet but if it's the same as the EV6 it's a whopping 20mm shorter and 20mm narrower than the GV70. And the press release announcing the GV60 said \"smaller numbers are more sporty\" or something... not smaller.\n\nIt makes me wonder what the point of the rumoured GV70e is.",
        "sentiment": "NEGATIVE",
        "score": 0.9984769225120544
    },
    {
        "comment": "Is this a reference to an episode I'm forgetting, or is this one of those memes where people make up episode scenarios based on more recent events?",
        "sentiment": "NEGATIVE",
        "score": 0.9981837868690491
    },
    {
        "comment": "Not to mention that they only just developed and released the 2.5T and 3.5T SmartStream engines, are those only going to be used in Hyundai/Kia vehicles?",
        "sentiment": "NEGATIVE",
        "score": 0.9992882609367371
    },
    {
        "comment": "> exorbitantly costly\n\nthey're cheap compared to other luxury brands.",
        "sentiment": "NEGATIVE",
        "score": 0.9995463490486145
    },
    {
        "comment": "They're taking on Cadillac?",
        "sentiment": "NEGATIVE",
        "score": 0.952582061290741
    },
    {
        "comment": "Someone has to be first. It's a gamble, but it might pay off big time for them.",
        "sentiment": "NEGATIVE",
        "score": 0.9646102786064148
    },
    {
        "comment": "I see it more of a lack of charging infrastructure issue. Where I'm at, gas stations out number places to charge by 100 to 1. I also can't charge at home or at any of my customer offices. An EV, no matter the range, just isn't feasible for me.",
        "sentiment": "NEGATIVE",
        "score": 0.9997685551643372
    },
    {
        "comment": "Of the last 10-20 trips you took in your car, how many of them were outside the range of a typical EV?",
        "sentiment": "NEGATIVE",
        "score": 0.9991005659103394
    },
    {
        "comment": "I saw a video about the Mercedes EQS that does that, it's cool as shit.\n\nAlso nice username / flair, considering how Kimi wrecked Proton financially lol",
        "sentiment": "POSITIVE",
        "score": 0.9931759238243103
    },
    {
        "comment": "Honestly I have more faith in South Korea rolling out massive scale EV infrastructure quickly than the US. Things move much faster in Korea, and the smaller geographic size helps a lot too.",
        "sentiment": "POSITIVE",
        "score": 0.9983019828796387
    },
    {
        "comment": "In the US the carbon rules are lax, and even in Europe they won’t require more than about 20-25% EV by 2025 (currently about 8%). EV makes sense for premium cars, you get acceleration and refinement for free, and get ahead of the curve for adoption.",
        "sentiment": "POSITIVE",
        "score": 0.9937404990196228
    },
    {
        "comment": "Also scales of economy will be rapidly lost for ICE. This will drive car prices up at a time when EVs are at or below cost parity. I'm adamant that the market dynamics at play here will kill the combustion engine before the regulations will.",
        "sentiment": "NEGATIVE",
        "score": 0.9996756315231323
    },
    {
        "comment": "I'm planning on buying an ICE car in about 2 years. One of my only requirements is that I want to daily a car with more than 4 cylinders before electric is the norm. I'll also probably still be in an apartment with poor charging access. Beyond that, I'm 100% in the same boat. My parents are starting to think about a new vehicle, and considering it takes them about 1-2 years to go from \"thinking\" to \"test driving\", they're planning on electric. In multi-car households looking to replace one of them, it's almost a no-brainer since most people will keep at least one ICE vehicle for a few more years, so you're protected against the growing pains of the DCFC network.",
        "sentiment": "NEGATIVE",
        "score": 0.9920937418937683
    },
    {
        "comment": ">I can't imagine spending money on a brand new ICE car right now.\n\nHaving recently bought two, I don't really care about BEVs until we move past Li-ion batteries. It's a mediocre bridge technology at best and I'm not impressed by the degradation in extreme temperatures as someone who lives in an area that gets pretty hot in the summer and quite cold in the winter.\n\nMy state also generates 95% of our electricity with natural gas at the moment, which doesn't really make EV's that clean either once you factor in the transmission and conversion losses on top of that.",
        "sentiment": "NEGATIVE",
        "score": 0.9989426732063293
    },
    {
        "comment": "I never thought I’d say it. But I’m ready to go EV on my next vehicle (2-3 years) when there are even more options available. Will probably also buy a “cheaper” older fun ice car as a toy to keep for a while.",
        "sentiment": "NEGATIVE",
        "score": 0.9419256448745728
    },
    {
        "comment": "Not sure why you are getting downvoted. ICEs are quickly becoming antiquated steampunk contraptions. If you have a garage/place to charge overnight you'd have to be a total schmuck not to at least consider an EV at this point.",
        "sentiment": "NEGATIVE",
        "score": 0.9982689619064331
    },
    {
        "comment": "I’m buying one last ICE, maybe I should have leased it",
        "sentiment": "NEGATIVE",
        "score": 0.9982874989509583
    },
    {
        "comment": "I wouldn't buy a pure ICE in 2021.  I expect *at least* a hybrid, but much preferably a PHEV.",
        "sentiment": "POSITIVE",
        "score": 0.968800961971283
    },
    {
        "comment": "I just bought new ICE car (Genesis on top of that). I am making a few trips a year between Boston and Pittsburgh. It's 9 hour drive that I can make in one go by myself. Driving an electric vehicle with 250 mile range, this becomes over 11.5 hours ride, that is given that all the superchargers are available right as I pull up. And by the way, I have much better stops along the way than the superchargers. With family I am taking it over 2 days, but again - the places I like to stop (for example, Milford PA is a lovely town to stop by overnight) are not quite near any charging stations. Add there electricity rate of close to 20c kWh and I am paying almost the same for the highway mile driven with ICE and electric car.\n\nSo, why should I buy a car that makes my life less convenient and costs more? And electric could work well as a 2nd car, but I can just buy a bike and bike to commuter rail, as driving into Boston is a nightmare regardless whether I drive ICE or electirc.",
        "sentiment": "NEGATIVE",
        "score": 0.9977953433990479
    },
    {
        "comment": "I dont think Genesis is worried about owners of '91 Camaros and '98 Escorts.",
        "sentiment": "NEGATIVE",
        "score": 0.9905912280082703
    },
    {
        "comment": "If your post involves politics AND CARS, please consider submitting to /r/CarsOffTopic.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cars) if you have any questions or concerns.*",
        "sentiment": "NEGATIVE",
        "score": 0.9960505366325378
    },
    {
        "comment": "Trucks are different. Because they are body on frame, the body doesn't need to be as strong as of it were unibody. \n\nBasically, the frame handles most of the hard work so the body can be free to experiment with clamshell doors. \n\nOn cars, the b pillar is much more important.",
        "sentiment": "POSITIVE",
        "score": 0.9782418608665466
    },
    {
        "comment": "Swivel seats are not NHTSA compatible unless you have some sort of locking mechanism to keep them from swiveling in a crash.  That is harder to engineer cost effectively than you'd imagine, because no one has been able to do it since the 50s.\n\nThe reason is clear - side impacts deliver a lot of force and the human body is not going to fare well if their seat swivels in a crash.",
        "sentiment": "NEGATIVE",
        "score": 0.9991165995597839
    },
    {
        "comment": "Good points.",
        "sentiment": "POSITIVE",
        "score": 0.9998456239700317
    },
    {
        "comment": "Elon time",
        "sentiment": "POSITIVE",
        "score": 0.9979985356330872
    },
    {
        "comment": "I see what you’re trying to say, but it fails to account for future demand across all brands…",
        "sentiment": "NEGATIVE",
        "score": 0.9997523427009583
    },
    {
        "comment": "EV marketshare is 3%",
        "sentiment": "POSITIVE",
        "score": 0.7442200183868408
    },
    {
        "comment": "Furthermore there is a wait-list for pretty much every ground up SUV on the market right now.",
        "sentiment": "NEGATIVE",
        "score": 0.9965873956680298
    },
    {
        "comment": "Genesis sold 100k in Korea last year.",
        "sentiment": "POSITIVE",
        "score": 0.964575469493866
    },
    {
        "comment": "Yeah but the US only accounts for like 6.5% of new passenger car sales.",
        "sentiment": "NEGATIVE",
        "score": 0.9955235719680786
    },
    {
        "comment": "Yeah it’ll just be their high end EV brand and with lower volumes at those higher price points they’ll have no issues sourcing enough packs. Definitely much harder for someone like a Ford to go full EV on the F150. They can only scale up to 80000 per year in the next few years but to eventually go all EV is going to take a long time since the volumes would be 10X.",
        "sentiment": "NEGATIVE",
        "score": 0.9912652373313904
    },
    {
        "comment": "> I'm increasingly ready to ditch my ICE commuter car and switch to an EV. I just don't think there's one on the market that fits what I want quite well enough yet for me to confident in switching now.\n\nMe too. \n\nI *really* wanted to get an EV when I bought my current car ~2 years ago. An EV fits perfectly for the type of driving I do.\n\nI was thinking about going for the Chevy Bolt or the i3 REX, but ultimately decided to wait for the charging infrastructure to mature. \n\nI think that is **the** most important piece which needs to be resolved for mass adoption of EVs. You don't really *need* a huge amount of range (more than 200 miles) if you had charging infrastructure which was as fast and readily available as gas stations. \n\nI'm hoping by the time I buy my next car in 7-8 years, there will be both a fun hot hatch EV as well as a really robust charging network.",
        "sentiment": "POSITIVE",
        "score": 0.9661239385604858
    },
    {
        "comment": "2022 and 2023 are going to be benchmark years for EV's. The Lightning is out, both the Kia/Hyundai, VW is dropping that sweet new EV microbus, Rivian will probably stop pushing back release dates, Canoo might get their shit together, Polestar 3 should be out (or nearly out), EV Hummer, Lucid will become more available, Audi Q4, and many more.\n\nGranted most of these are upmarket, and for a lot of companies, new IP as well, so these won't sell in volumes like a civic would, but in another 5ish years, the models that early adopters picked up will be on the market, and likely at very reasonable prices, which should in turn help fuel EV adoption as the used market starts to tilt that direction. \n\nAnd I love my Polestar, my 3rd BEV; I'm never going back to ICE, unless for a 'weekend car' or something similar. I'd highly recommend looking at the Polestar 2 if anyone is also looking at Tesla's. Build quality is top notch.",
        "sentiment": "POSITIVE",
        "score": 0.9616687893867493
    },
    {
        "comment": "A key question, though, is would you buy a new ICE before you can get a new EV? That's what will make-or-break *new* ICE sales. For you maybe that means putting off buying a brand new car or a newer used car for a little bit longer. For the auto industry if your story is becoming the norm it can mean a huge crash in new ICE sales right at the same time that they're trying desperately to ramp up EV production and fighting to stay afloat.",
        "sentiment": "NEGATIVE",
        "score": 0.9990622401237488
    },
    {
        "comment": "We're in the same boat. Love the idea of EV tech, but I live in a state that has a very low adoption rate and consequently, few charging locations.",
        "sentiment": "NEGATIVE",
        "score": 0.9981372356414795
    },
    {
        "comment": "Just hold off on a new car until an EV you like is released.",
        "sentiment": "NEGATIVE",
        "score": 0.9801703691482544
    },
    {
        "comment": "Still a hassle for people in apartments",
        "sentiment": "NEGATIVE",
        "score": 0.9975305199623108
    },
    {
        "comment": "> Many will have batteries that charge to full in 15-20 minutes at charging stations that are everywhere.\n\nNot full. But to 80 %.",
        "sentiment": "NEGATIVE",
        "score": 0.9562187790870667
    },
    {
        "comment": "> In 5 years, every new EV will be better than a LR Model Y. Many will have batteries that charge to full in 15-20 minutes at charging stations that are everywhere. And they'll be cheaper than gas versions.\n> \n\nTo me, this is 10-15 years off",
        "sentiment": "NEGATIVE",
        "score": 0.9298186302185059
    },
    {
        "comment": "> In 5 years, every new EV will be better than a LR Model Y. Many will have batteries that charge to full in 15-20 minutes at charging stations that are everywhere. And they'll be cheaper than gas versions.\n\nCan I have some of what you're smoking?",
        "sentiment": "POSITIVE",
        "score": 0.9692137241363525
    },
    {
        "comment": "> In 5 years, every new EV will be better than a LR Model Y. Many will have batteries that charge to full in 15-20 minutes at charging stations that are everywhere. And they'll be cheaper than gas versions.\n\nNo shot unless battery technology development RAPIDLY accelerates",
        "sentiment": "POSITIVE",
        "score": 0.9962820410728455
    },
    {
        "comment": "> struggle to ramp up battery supply to keep up with demand for EVs.\n\nI am not sure that there are enough battery manufacturers to make all the batteries that are required for such a quick shift to full EVs.  As battery capacity becomes tight, prices will naturally increase which will push EV prices higher since batteries are such a large part of the cost.",
        "sentiment": "POSITIVE",
        "score": 0.960056483745575
    },
    {
        "comment": "High end buyers want EVs even more so than the normal new car buyer so every luxury brand needs those EVs even more than the normal ones.",
        "sentiment": "NEGATIVE",
        "score": 0.9479455351829529
    },
    {
        "comment": "Natural gas is waaaay better than gasoline, especially since so much is just vented off when producing oil because it isn’t worth enough to capture in many places.",
        "sentiment": "NEGATIVE",
        "score": 0.9791770577430725
    },
    {
        "comment": "The salesman wants to sell you what he has available now. Knowing what the OEM plans for the future is an actual liability.",
        "sentiment": "NEGATIVE",
        "score": 0.9985993504524231
    },
    {
        "comment": "They'd be terrible, though. Neither vehicle is on a platform that would really support it well. They'll be better off creating a new E-G series on E-GMP",
        "sentiment": "NEGATIVE",
        "score": 0.9996057152748108
    },
    {
        "comment": "Remember that episode where corporate picked up michael, andy, dwight and oscar in a limo to NYC for the shareholder meeting?  it’s in season 6, I believe.",
        "sentiment": "POSITIVE",
        "score": 0.9822944402694702
    },
    {
        "comment": "I meant from the company’s profit standpoint; making a new model every other year seems costly, on top of just throwing your internal combustion engines in the trash 4 years after you just refreshed your designs and released a few models.\n\nI know that Genesis completely undercuts other brands on price.",
        "sentiment": "NEGATIVE",
        "score": 0.9997367262840271
    },
    {
        "comment": "There are normally three popsicles on the table. I usually eat two, you usually eat one. Plenty to go around. \n\nToday, there are two popsicles on the table. So I eat both popsicles, and tell you: *\"You don't eat enough popsicles for scarcity to become an issue.\"*\n\nSee the issue?",
        "sentiment": "NEGATIVE",
        "score": 0.9913414120674133
    },
    {
        "comment": "Does Cadillac know about this?",
        "sentiment": "NEGATIVE",
        "score": 0.988706111907959
    },
    {
        "comment": "Does that mean they’ll come for Lincoln right after?",
        "sentiment": "NEGATIVE",
        "score": 0.9879215955734253
    },
    {
        "comment": "Acura has entered the chat",
        "sentiment": "POSITIVE",
        "score": 0.9314903616905212
    },
    {
        "comment": "90% are within EV range.  But it’s the long haul stuff that worries me when I need to go to another city.    It all seems really inconvenient to me.",
        "sentiment": "NEGATIVE",
        "score": 0.9896940588951111
    },
    {
        "comment": "Well, the problem is that the country is too crowded, and you'll have to solve the parking space problems first before being able to properly distribute EV infrastructure. There are so many apartments where their parking space can't hold enough cars to the point that some cars have to park in front of other cars. It's better for more rural areas, but it's also fact that people who live in rural areas can't afford luxury vehicles like Genesis..",
        "sentiment": "NEGATIVE",
        "score": 0.9992737174034119
    },
    {
        "comment": "Isn't this what he said. The last new ice cars appear around 2025 and after that every newly announced car will be an ev. By 2030 you'd have to buy an at least 5 year old (as in sold for 5 years) car. And all of this while the other options are probably better.  \n\nMost people I know that recently got a new car already said that their next car will be electric. Some have phevs now and just wait for the right car to replace it.",
        "sentiment": "NEGATIVE",
        "score": 0.9947711825370789
    },
    {
        "comment": "My long term plan is to have an ancient/analog/fully manual fun ICE car for all my enthusiast feels and continue to buy modern/safe/automated/efficient DDs.",
        "sentiment": "POSITIVE",
        "score": 0.9486798644065857
    },
    {
        "comment": "You being an X3M driver, that is 1000% predictable.",
        "sentiment": "NEGATIVE",
        "score": 0.9997217059135437
    },
    {
        "comment": "I would look at a RAV4 Prime / NX450h+ and get my foot in both doors. 66~ km of EV only range sounds pretty good to me, I can charge at home and at work, and the gas engine ensures that there will be no range anxiety. Toyota's hybrid warranty is also insane at 10 years / 150k miles.",
        "sentiment": "NEGATIVE",
        "score": 0.6843219995498657
    },
    {
        "comment": "But many, many, people don’t have a place to charge it overnight.\n\nI live in a suburb of NYC where tons of new condos and apartments (many of them luxury buildings) have gone up the past few years. There are many still under construction. Virtually none of them have EV charging available in their parking garages.\n\nI don’t know what the situation is in California, but I reckon most of the country is still more like my area than CA.",
        "sentiment": "NEGATIVE",
        "score": 0.9849415421485901
    },
    {
        "comment": "People here tend to downvote when it goes against their personal interests. Just because this is my mentality doesn't mean I expect everyone to follow suit.\n\nOverall I think simple economics will push people to EV, as long as it fits their use case/charge capabilities.",
        "sentiment": "NEGATIVE",
        "score": 0.9871252179145813
    },
    {
        "comment": "Used to live in both Boston and the Burgh and know that drive well. Yes today’s EVs are not suited for that trip but what about in 5 years or 10? Range, charge times, charge points will all improve.",
        "sentiment": "POSITIVE",
        "score": 0.9986922144889832
    },
    {
        "comment": "My Crew Cab has B pillars, it’s only the extended cab that does not.  Last time I drove an extended cab it had compact car levels of rear leg room.",
        "sentiment": "NEGATIVE",
        "score": 0.8590918183326721
    },
    {
        "comment": "> Trucks are different. Because they are body on frame, the body doesn't need to be as strong as of it were unibody.\n\nIt's still easier to make a safe cab if you have the B-pillar in the cab rather than in the door. Why else do you think Ram, Toyota, and GM went to rear-facing doors with a very small opening?",
        "sentiment": "NEGATIVE",
        "score": 0.7466769814491272
    },
    {
        "comment": "Wasn’t Swivel n’ Go something that existed in the Chrysler Town & Country a decade ago?",
        "sentiment": "NEGATIVE",
        "score": 0.986876368522644
    },
    {
        "comment": "My VW Sharan has them",
        "sentiment": "POSITIVE",
        "score": 0.9876713752746582
    },
    {
        "comment": "Global market share was 4.2% at the start of this year and closer to 5% now. Four years ago it was 1.3%\n\n[they won't let me link to the SeekingAlpha article on this data]\n\nExponential growth works like that. You can dismiss it only early on when the gians look small. Before you realize what's going on it explodes upward. The only thing faster than growth? Decline. It takes time to ramp up production. It typically takes very little time at all for consumers to decide they won't buy an obsolete product.",
        "sentiment": "NEGATIVE",
        "score": 0.9965192079544067
    },
    {
        "comment": "But it doesn't need to be as fast or have one on every corner like gas stations. Charge at home. Leave every day with a good charge and unless you go on a long trip you'll never need to charge at a charging station.",
        "sentiment": "POSITIVE",
        "score": 0.9881409406661987
    },
    {
        "comment": ">VW is dropping that sweet new EV microbus\n\nMy wife wants one of these so bad she can't stand it.",
        "sentiment": "NEGATIVE",
        "score": 0.9997870326042175
    },
    {
        "comment": ">would you buy a new ICE before you can get a new EV?\n\nNo, definitely not.  My current car is only 6 years old and at 100,000 miles, and gets about 31 MPG.  I can certainly keep it going long enough to hit the point where an EV model I like becomes available *and* I save up enough money so as to not have an outrageous loan period on it when I get the keys.  And if it shits the bed in the meantime we own a 3rd car that I can start driving to work instead.  It'd increase my fuel bill by 33%, but that's not too bad if the goal is to keep saving up to buy what I actually want.  Plus whatever goes wrong with my Cruze I can probably fix it because I'm pretty handy in a garage.\n\nI don't think my situation is TOO common yet, but I'm sure I'm not alone: there's gotta be quite a bit of overlap in the Venn diagram of people who buy cars for the long haul and people who are excited to get an EV as their next car.",
        "sentiment": "NEGATIVE",
        "score": 0.9924170970916748
    },
    {
        "comment": "Oh yeah I'm definitely doing that.  I bought my current car with the intent of driving it into the ground.  At 6 years and 100k miles, I'm well on my way.  I paid it off after ~3 years, so for the 3 years since it's actually been doing nothing but saving me a car payment every single month.  If you figure a $300/month car payment, that's $10,800 in the bank already.  Plus it's cheap to insure and maintain, so I'm not even getting hit there.",
        "sentiment": "NEGATIVE",
        "score": 0.6775438189506531
    },
    {
        "comment": "Mach E and Ioniq 5 both meet all my needs (for my wife's car), but we *just* bought an Ioniq hybrid right before the pandemic and have barely put any miles on it.  I'd be surprised if people couldn't find an EV they liked even now",
        "sentiment": "NEGATIVE",
        "score": 0.9956918358802795
    },
    {
        "comment": "Which is why companies started to build charging hubs on grocery store parking lots. This way you won't lose time on charging.  \nAnd there are many places that have ac chargers on curbside parking lots.",
        "sentiment": "POSITIVE",
        "score": 0.9092156291007996
    },
    {
        "comment": "If they don’t have a parking garage/lot. And if you live in an apartment without parking, you’re less likely to have a car.",
        "sentiment": "NEGATIVE",
        "score": 0.9964371919631958
    },
    {
        "comment": "Yeah. That's true. \n\nIt's seems the LFP chemistry does a better charging to full. Most people don't charge EVs to full because it's not good for the battery. That's for NCA, but not LFP. LFP can be charged full without any concern of degradation. \n\nFor a cheap EV, LFP batteries seem better and will deliver good charge performance. Right now, we're probably going to see 15-20 minutes to 80% charge. I wonder if the new 4580 batteries with LFP chemistry will do close to 20-25 minutes to full charge. IDK though. \n\nI personally think that once you get 80% in 20 minutes, it'll drive apartment dwellers to buy EVs. Once that happens, they'll start pressuring landlords to put in L2 chargers. And that'll start turning the tide against gas cars.",
        "sentiment": "POSITIVE",
        "score": 0.9539381861686707
    },
    {
        "comment": "The Hyundai Ioniq 5 can do 10-80% charge in 18 minutes today.\n\nShortening that by a few minutes in 5 years seems easily possible.",
        "sentiment": "NEGATIVE",
        "score": 0.9861043095588684
    },
    {
        "comment": "Most people would agree. However, most people typically underestimate the rate of change. \n\nIf you asked someone in 2007 if everybody would have a smartphone in 5 years, they probably would have said you're nuts. Then 2012 came around...",
        "sentiment": "NEGATIVE",
        "score": 0.9894506335258484
    },
    {
        "comment": "They're not even far off and have been making insanely fast progress, where are you pulling 10-15 years from lol",
        "sentiment": "POSITIVE",
        "score": 0.9931918978691101
    },
    {
        "comment": "Sounds like a major problem for legacy automakers if they hope to survive. Once consumer expectations hit a critical point where you can't recover profits on ICEs anybody not able to line up enough battery supply will be in a death spiral.",
        "sentiment": "NEGATIVE",
        "score": 0.9997666478157043
    },
    {
        "comment": "All new cars in the world can be electric in 10 years if you start to plan for that kind of thing today. \n\nbattery production capacity can increase to whichever value you want as long as you plan 10 years ahead.",
        "sentiment": "POSITIVE",
        "score": 0.5230321884155273
    },
    {
        "comment": "This was as I was leaving with my new vehicle 🤷‍♂️",
        "sentiment": "NEGATIVE",
        "score": 0.9916642904281616
    },
    {
        "comment": "Supposedly they are better than you'd think. Electric g80 is already out in Korea and the reviews are mostly positive.",
        "sentiment": "POSITIVE",
        "score": 0.9996474981307983
    },
    {
        "comment": ">  and the EV6 is shorter overall but has a 25mm longer wheelbase than the GV70???\n\nThat's not surprising. EVs tend to push the wheels to the corners to maximize interior space. The EV6's platform mate, the shorter Hyundai Ioniq 5, is comparable to any compact CUV in length (182\"), but has a wheelbase longer than some full-size cars (118\").",
        "sentiment": "NEGATIVE",
        "score": 0.9886634945869446
    },
    {
        "comment": "But popsicle production is increasing everyday.  Billions of dollars are being invested in increasing popsicle production.  Chile alone has 18 million tons of known popsicle mines (lithium) and is only outputting 18,000 tons of popsicles a year.  So there is a lot of room for popsicle growth... And there are a couple other countries with larger popsicle reserves that are producing fewer popsicles today.  So acting like we will have fewer popsicles tomorrow is pretty dumb.  The biggest limitation on popsicle production is a lack of investment, not a lack of popsicles.\n\nSee how you don't know shit about popsicles?",
        "sentiment": "NEGATIVE",
        "score": 0.9985547661781311
    },
    {
        "comment": "Cadillac is too busy also trying to figure out what it is to notice",
        "sentiment": "NEGATIVE",
        "score": 0.9997097849845886
    },
    {
        "comment": "Eh Lincoln at least doubled down on luxury and said screw sportiness.",
        "sentiment": "NEGATIVE",
        "score": 0.9925883412361145
    },
    {
        "comment": "Supposedly a Tesla can do this today without too much hassle. Obviously not as easily as with a gas car yet. I imagine in 5-10 years other brands will be much improved too.",
        "sentiment": "POSITIVE",
        "score": 0.980494499206543
    },
    {
        "comment": "Agree. My dd ev will still be fun though :)",
        "sentiment": "POSITIVE",
        "score": 0.9997021555900574
    },
    {
        "comment": "IMO the Rav4 Prime is the sweet spot for PHEV. Average commute in the US is 32mi round trip which means 42mi is more than enough to commute and run errands after work all using EV then use gas for long drives/road trips.",
        "sentiment": "POSITIVE",
        "score": 0.9602903723716736
    },
    {
        "comment": "Good luck getting one.  But I consider the RAV4 Prime to be the perfect vehicle for me and would buy one **now** if I could actually get my hands on one.\n\nDon't know anything about the Lexus, but I'd assume it will be similarly difficult to acquire.\n\nToyota's hybrid tech is second to none.",
        "sentiment": "NEGATIVE",
        "score": 0.9873766899108887
    },
    {
        "comment": "Could be a good choice depending on your use case! \n\nI had a Volt and an 80 mile commute. The EV miles were a dream. Every day when the ICE kicked on was a reminder of how my next car would be full EV.",
        "sentiment": "POSITIVE",
        "score": 0.9967484474182129
    },
    {
        "comment": "For sure, there needs to be a large investment in public chargers for apartment dwellers. I think pairing them at Grocery Stores/Target/Walmart is the right model for most suburbs. \n\nIn CA if you live in a Condo, you have a legal right to install a charger if you have a dedicated parking space. Electric utility will give you a second meter for free, and although the conduit runs are generally longer than home installations the extra cost may still be worth it. YMMV",
        "sentiment": "POSITIVE",
        "score": 0.8246555328369141
    },
    {
        "comment": "Agreed but you have to understand this will change as time goes on and more charge options become available (including hybrid gas/EV charge stations).",
        "sentiment": "NEGATIVE",
        "score": 0.7780648469924927
    },
    {
        "comment": "Retrofitting those parking garages with chargers is not hard. It's just the equivalent of installing an electrical socket in each space. Several places already have laws that allow anyone to do it in their own space. Street parking is the one that's been lagging most and even that will be relatively easy to do once cities decide to do it.",
        "sentiment": "NEGATIVE",
        "score": 0.9960118532180786
    },
    {
        "comment": "Thats an understatement. You can be factually  correct and downvoted simply because someone doesn't like the truth. Upvotes or downvotes are in no way an indicator of being correct or incorrect.",
        "sentiment": "NEGATIVE",
        "score": 0.9986914992332458
    },
    {
        "comment": "In 5 to 10 years I will replace this car with electric one, as long as it is suitable for the trip :)",
        "sentiment": "NEGATIVE",
        "score": 0.9578853249549866
    },
    {
        "comment": "I've found most full-size extended cabs have just enough leg room for me to sit comfortably \"behind myself\", especially if they're from the past 20 years or so. But part of how they achieve that is by shortening the seat cushion, meaning no thigh support on a long trip, and also putting the seatback bolt-upright against the back wall.",
        "sentiment": "NEGATIVE",
        "score": 0.9968039989471436
    },
    {
        "comment": "It's not about weight, it's really about side impact pole intrusion and roof crush.  The front edge of the rear door is effectively the B pillar in crew cab pickups and adds a huge amount of weight and engineering complexity.\n\nIn a pickup the cab isn't transferring a lot of roll stiffness, but in a unibody like a sedan, decoupling the rocker(which is nice and beefy on an EV) from the bodyside/roof reduces the stiffness by a large margin, putting more strain on every body panel in the system as a result.",
        "sentiment": "POSITIVE",
        "score": 0.9265071749687195
    },
    {
        "comment": "I'd just like to point out that the smaller GM trucks still have rear suicide doors, the Colorado and Canyon.",
        "sentiment": "POSITIVE",
        "score": 0.9692063331604004
    },
    {
        "comment": "Excellent points.  I think the Flex also offered that option.",
        "sentiment": "POSITIVE",
        "score": 0.9997758269309998
    },
    {
        "comment": "True, genesis is a tiny drop in the bucket. But Tesla will continue to expand, every label has at least one EV on the roadmap, Audi is cutting dev of new ICE by 2026, new brands like rivian and lucid are emerging. I think there’s a lot of momentum behind the EV movement and that will drive industry demand significantly.",
        "sentiment": "POSITIVE",
        "score": 0.9990718364715576
    },
    {
        "comment": "Unfortunately your comment has been removed because it contains a link to a blacklisted domain.\n\nPlease use a different source. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cars) if you have any questions or concerns.*",
        "sentiment": "NEGATIVE",
        "score": 0.9991884827613831
    },
    {
        "comment": "Not everyone has the ability to charge at home. A lot of people have to do street parking or otherwise lack access to reliably charge at home. \n\nI'm not speaking about you specifically, but I've found a lot of people who have EVs currently and are advocates for them are not willing to take seriously the concerns of those who are still concerned about the maturity of the technology. \n\nFor myself, I won't be comfortable buying an EV until there is an EV charging network on par with the gas station network. I think a lot of people are in my boat.\n\nIf it gets to the point where I can easily go to my corner charging place, charge up in 10 minutes and have enough for 1-2 weeks of travel and that be true anywhere in the country, *that* is when I will be ready to switch to an EV. \n\nI have a new-ish car and won't be ready to switch for 6-7 years anyway. Hopefully by the time I need to get a new car, the EV charging network will be mature.",
        "sentiment": "POSITIVE",
        "score": 0.9906851649284363
    },
    {
        "comment": "> I don't think my situation is TOO common yet\n\nI believe your situation is more common than people in this sub would like to believe. And it's going to get dramatically more common as all these companies start to ramp up EV production.\n\nI also believe this is *especially* true of current pickup and SUV drivers. The sterotype is either that these are all knuckle-dragging coal rollers or suburbanites driving \"pavement queens.\" The reality is closer to that second example but add onto that suburbanites with *boats*. That's my friend in the PNW who can't wait to replace his gas F-150 with a Lightning. He reserved the night of the reveal. I know several others just like him, too.\n\nEV trucks and SUVs are going to put this thing over the top. They're already expensive vehicles that sell well. It's far easier to make a large, expensive EV than it is to make a small, cheap EV. High demand, high profit margins, lower \"fuel\" costs and lower maint costs for end users. My hick BIL can't wait to get an EV truck for his drywall business so he doesn't have to pay through the nose for diesel service.",
        "sentiment": "NEGATIVE",
        "score": 0.8825862407684326
    },
    {
        "comment": ">I don't think my situation is TOO common yet\n\nI know a lot of people whose next car will be an EV.  I know mine will be.",
        "sentiment": "POSITIVE",
        "score": 0.997789740562439
    },
    {
        "comment": "I think finding one thats actually available, not on heavy backorder, and not marked up $10k is the current issue.",
        "sentiment": "NEGATIVE",
        "score": 0.9985151886940002
    },
    {
        "comment": "I honestly don't have much interest in a new ICE car. I used to lament the death of ICE but the more I think about it, the more I appreciate that most of what I like about ICE cars has already been made. Maybe I'm getting \"old\" but I'd rather have an old ICE car I can tinker with and a newer electric daily than a new ICE car.",
        "sentiment": "NEGATIVE",
        "score": 0.9895201921463013
    },
    {
        "comment": "Depends. AMG V8 or Vette? Sure, and I’ll lament their passing.\n\nCamcordimanata? Bring on the EVs.",
        "sentiment": "NEGATIVE",
        "score": 0.9954466223716736
    },
    {
        "comment": "I mean I live in a \"luxury\" place with a garage, but there are still only like 2 chargers for the whole building. Most apartments don't have chargers even if they have parking",
        "sentiment": "NEGATIVE",
        "score": 0.9848825335502625
    },
    {
        "comment": "Wait what? All the apartments I’ve lived in have had parking but you still wouldn’t be able to charge an EV. I mean don’t get me wrong they can upfit with chargers eventually but none of the places I’ve lived have done it yet.",
        "sentiment": "NEGATIVE",
        "score": 0.9971722960472107
    },
    {
        "comment": "Over the decades we've all gotten used to the comparatively glacial pace of ICE development. The next gen of your main commuter has the MPG and HP numbers shifted around a tiny bit, usually one sacrificed for the other and on a longer time scale both creep up together a bit. The new entertainment system is more compatible with your phone. A few more buttons.\n\nSo they make the fallacy in thinking EV development is similarly slow. It's not. A decade ago there were no large fast charging networks. Now there are several and they're doubling in size every two years. On top of that, just like you said, fast charging times are going down dramatically.\n\nSaying this change will take *decades* is based on this old habit of thought because, traditionally, changes in the automotive industry take that long. That's no longer true.",
        "sentiment": "NEGATIVE",
        "score": 0.9992590546607971
    },
    {
        "comment": "I think people are accruate in saying it'll take longer than you'd think to ramp up full production of EVs. Where they get it wrong is thinking it'll take just as long to reduce consumer *demand* for new ICEs. That can drop off a cliff very quick. Happens all the time with products that are seen as obsolete and no longer worth the money.",
        "sentiment": "NEGATIVE",
        "score": 0.9997417330741882
    },
    {
        "comment": ">That's enough for 250 thousand charging stations at 30k a pop\n\nThe real question and issue is how and where are those going to be distributed?  250k seems like a large number, but if it's in token quantities, then it won't matter. It's like our mall has 6  or 8 Superchargers that are always full. \n\nThe issue becomes how do you prevent people from \"camping\" at charging spots? It's like my office (pre-COVID) easily had 150 cars in the parking lot -- if my office were to install like 4 charging stations, that's really not enough to make an impact. Same thing with apartment complexes, condos and not even mentioning people who have to street park at home.",
        "sentiment": "NEGATIVE",
        "score": 0.9996054768562317
    },
    {
        "comment": ">The new 4680 Dry-Cell battery is going into Tesla vehicles sometime between February and April 2021.  \n  \nAny evidence of this? I already know the answer. I'll be very interested to see if the range/charging claims are true given Tesla have a history of false promises.",
        "sentiment": "NEGATIVE",
        "score": 0.9757757782936096
    },
    {
        "comment": "Plug in hybrids are the best bridge, IMO.",
        "sentiment": "POSITIVE",
        "score": 0.9996320009231567
    },
    {
        "comment": "Dynamics are supposedly good, but the range is disappointing — they're getting about 265 miles out of a 87kWh battery.",
        "sentiment": "NEGATIVE",
        "score": 0.9970847964286804
    },
    {
        "comment": "They're just jealous of Buick.",
        "sentiment": "NEGATIVE",
        "score": 0.9791626930236816
    },
    {
        "comment": "too bad Toyota has their heads up their butts and barely makes any for the NA market while basically flooding the JDM market with them",
        "sentiment": "NEGATIVE",
        "score": 0.9996460676193237
    },
    {
        "comment": "I imagine that the gas engine will kick in periodically, even in full EV mode, just to turn it over and keep the parts lubricated. I don't know if this is accurate, but I think that the auto mode is probably better for the vehicle in the long run as that will prevent any overuse/underuse of the system's components.",
        "sentiment": "NEGATIVE",
        "score": 0.9971649050712585
    },
    {
        "comment": ">Good luck getting one.\n\nLol ya, that's the rub. My coworker wants a RAV4 Prime, but he was told it wouldn't show up until next year. I encouraged him to wait because I think it's definitely worth it.\n\nToyota, oddly enough (or maybe by design?) is making hybrid tech desirable by the positioning of their products (ie. RAV4 Prime, top trims of the Highlander and the RX, new Venza, etc). They have certainly changed my opinion of hybrids to the point where I would willingly spend good money on a Lexus NX450h+ if I were in the market for a CUV daily driver.",
        "sentiment": "POSITIVE",
        "score": 0.994993269443512
    },
    {
        "comment": ">Electric utility will give you a second meter for free\n\nIn a condo garage electric room? That seems like a pretty complex addition.\n\nPG&E seems to indicate it's not free even for simpler single family homes\n\n>PLEASE NOTE: A PG&E representative may schedule a visit to determine whether your current electric service can support an EV. You may have to upgrade your service or your panel, or add a second electric panel. Service upgrades are necessary when the service wire to your home doesn't meet your capacity needs. PG&E charges a $100 service fee for a second meter. **You’re responsible for the installation costs to support an additional meter.** The costs are generally around $2,000, but can be as high as $8,000 or more.",
        "sentiment": "NEGATIVE",
        "score": 0.9977502226829529
    },
    {
        "comment": "Technically it’s not hard - I agree.\n\nBut have you ever tried dealing with the HOAs or building managers that govern stuff like this? That’s the hard part.",
        "sentiment": "NEGATIVE",
        "score": 0.9880716800689697
    },
    {
        "comment": "I can't find anything that points to the Flex having swivel seats, which seems like a real missed opportunity given its name.",
        "sentiment": "NEGATIVE",
        "score": 0.99973064661026
    },
    {
        "comment": "I'm sure Tesla is going to continue to expand, but they are also going to have real EV competition for the first time ever over the next few years.  2023 or 2024 would be my guess for other brands having enough EV volume collectively to bother Tesla.  Should be an exciting time for consumers.",
        "sentiment": "POSITIVE",
        "score": 0.996515154838562
    },
    {
        "comment": "Ooh, gutsy move bringing up Norway! You're just asking for the \"ackshually, oil exports ... ackshually, heavy taxes on ICEs ...\"\n\nBut, also, yes: the shape of things to come.",
        "sentiment": "POSITIVE",
        "score": 0.998293936252594
    },
    {
        "comment": "62% of news cars sold in Norway are electric?! Damn that’s crazy. I’m sure government policy plays a big role but I’d guess relatively short driving distances has something to do with it as well.",
        "sentiment": "NEGATIVE",
        "score": 0.9771900773048401
    },
    {
        "comment": ">Not everyone has the ability to charge at home. A lot of people have to do street parking or otherwise lack access to reliably charge at home. \n\nYeah, I won't buy an EV until I either do have charging at home, or the issue is resolved as you have described (i.e.  well-developed fast charging network).  An EV right now would be crippling for me.\n\nA lot of EV proponents are very dismissive of the charging issue, as evidenced by the flippant \"just charge at home.\"  If only it were that simple.",
        "sentiment": "NEGATIVE",
        "score": 0.9989745616912842
    },
    {
        "comment": "EV charging infrastructure was pathetic 5 years ago. It’s grown exponentially. It’ll do the same in the next 5. We are at that inflection point.",
        "sentiment": "NEGATIVE",
        "score": 0.9892475008964539
    },
    {
        "comment": "Kinda in this situation now, would like to replace a 12 year old car with one EV but nothing is standing out for what we would like in a single vehicle so probably going to get a Model 3 now, keep the old car, and see what the EV market is like 5 years down the road.",
        "sentiment": "NEGATIVE",
        "score": 0.9990179538726807
    },
    {
        "comment": "I assume the garage has electricity? If so, easy to add. This is becoming a must-have for luxury buildings on the coasts.",
        "sentiment": "POSITIVE",
        "score": 0.9942989349365234
    },
    {
        "comment": "It isn’t hard to install, and as the market demands they will. It’s already the top billed feature at many luxury apartments on the west coast. The Model 3 is the top selling luxury car in America. As this works down over the next 10 years not having charging in your apartment garage will be akin to not having a garage.",
        "sentiment": "POSITIVE",
        "score": 0.9900375604629517
    },
    {
        "comment": "Exactly!\n\nIf you saw a documentary about electric cars 3 years ago than that knowledge / view that you got from that documentary is already completly outdated.",
        "sentiment": "NEGATIVE",
        "score": 0.9997863173484802
    },
    {
        "comment": "Yeah. I think there will be a long tail of new ICE cars sold. But they'd be like the 370Z. 12 years since a redesign and still selling them because a few people still want them. \n\nI bet the 4Runner may get a new redesign in a couple years and then the same truck will be sold in 2035. But they'll probably only sell 10-20k/year.",
        "sentiment": "NEGATIVE",
        "score": 0.9972713589668274
    },
    {
        "comment": "I was selling Verizon phones/plans in California a year after the iPhone came out. Let me tell you, consumer demand can drop like a rock. \n\nWe didn't have the plan infrastructure in place and overnight, everybody wanted a smartphone. We didn't have the iPhone so people were buying blackberries and Palm devices and shitty LG resistive touchscreen dumbphones that looked like the iPhone 3G, but the flip phones and the fun sliders and messaging phones weren't moving anywhere. It was like a switch flipped.",
        "sentiment": "NEGATIVE",
        "score": 0.9969167709350586
    },
    {
        "comment": "I bought a Tesla and will never go back to an ICE car unless it's something really cool or vintage. \n\nMy parents were looking to upgrade their 2003 Honda pilot they bought new and we're looking at hybrids. I let them test drive my car and now they preordered the R1S rivian. Demand for EVs will only go up.\n\nEdit: also the lack of maintenance needed was a big selling point for them.",
        "sentiment": "NEGATIVE",
        "score": 0.9964308738708496
    },
    {
        "comment": "We're fast approaching a point where any business that *doesn't* provide easy access to charging in their parking lots will feel FOMO. Installing chargers now may seem to you like some kind of compliance burden but people who drive EVs right now have *money*. If you own a business with your own parking lot you'll want access to those EV driver wallets.\n\nAnd the cost for a bank of fast chargers is 10-20x cheaper than a gas station. A bank of L2 chargers (overnight or while you're at work type charging) is another 10-20x cheaper than that. And you don't need to jump through all the regulatory and zoning hoops that you would if you wanted gas pumps.\n\nAny time there's a massive difference in price like that things change radically and fast.",
        "sentiment": "NEGATIVE",
        "score": 0.9874802231788635
    },
    {
        "comment": "You charge idle fees like Tesla does. Or realize most people don't need to charge at the mall or at work. I think people do it to get a good spot. The nice thing about an EV is every day my car has a full charge. Unless I go on a long trip I never even think about stopping at another charger.",
        "sentiment": "POSITIVE",
        "score": 0.9858574867248535
    },
    {
        "comment": "You're probably mistaking DC fast chargers (superchargers in Tesla speak) and L2 AC chargers that are installed in malls and workplaces. There's a 50x cost difference between them and their uses are very different. Unlike with gas slow AC chargers are used for 95%+ of usage and then DC fast chargers are needed for trips. If you hog a DCFC you'll get billed for it pretty quickly. 250k of those is a very substantial number. AC chargers are the opposite, we need to build them into parking spaces everywhere and have cars always connected so we can even use the batteries to help the grid balance loads.",
        "sentiment": "NEGATIVE",
        "score": 0.9796879887580872
    },
    {
        "comment": "Other people answered the question better than me. Basically, that 250k would be fast chargers, and this basically replacements for gas stations. \n\nThere are L2 chargers that are super cheap and really good for work or apartments.\n\nAnd then for ICEing, I've actually not really had a problem with that. Most people follow the signs. There are bad apples, but some tow truck enforcement would easily deal with that.",
        "sentiment": "NEGATIVE",
        "score": 0.9937297105789185
    },
    {
        "comment": "Other people answered the question better than me. Basically, that 250k would be fast chargers, and this basically replacements for gas stations. \n\nThere are L2 chargers that are super cheap and really good for work or apartments.\n\nAnd then for ICEing, I've actually not really had a problem with that. Most people follow the signs. There are bad apples, but some tow truck enforcement would easily deal with that.",
        "sentiment": "NEGATIVE",
        "score": 0.9937297105789185
    },
    {
        "comment": "I sort of agree with you, but I get the impression BEV sales are surging more than PHEVs.",
        "sentiment": "POSITIVE",
        "score": 0.9873465895652771
    },
    {
        "comment": "Are you going to buy one?\n\nThink about this from the manufacturer's POV:\n\n* The cost of producing PHEVs is projected to remain flat for some time to come. ICE production costs are well-established and smaller batteries mean lower battery prices don't affect production costs as much.\n* The cost of producing BEVs is projected to keep going down as battery prices go down\n* Consumers have proven to be willing to pay *more* for a BEV than they normally would have\n* Profit margins are there fore projected to be significantly higher for BEVs than any other vehicle\n\nIf you want a PHEV you'd better get one now. I see zero future for them. They're a 2010 solution for a world without fast charging networks and $1,000/kWh battery prices not 2021 where fast charging networks are doubling every year and battery prices are $100/kWh. Can't charge at home? They're going to see that as a \"you\" problem as they rake in the profits.",
        "sentiment": "NEGATIVE",
        "score": 0.9988837838172913
    },
    {
        "comment": "They **were** the best bridge last decade. \n\nAs batteries keep decreasing you will have to pay more for a plug in hybrid than a 250 mile fast charging BEV.",
        "sentiment": "POSITIVE",
        "score": 0.7778317928314209
    },
    {
        "comment": "If only they'd actually fucking make more of them.  I've been trying to get my hands on a RAV4 Prime since release.",
        "sentiment": "NEGATIVE",
        "score": 0.9991938471794128
    },
    {
        "comment": "What? They're making as much as they can. They're flooded in North America.",
        "sentiment": "NEGATIVE",
        "score": 0.8484412431716919
    },
    {
        "comment": "IIRC the Chevy Volt kept track of when it was filled up and would sporadically burn the gas to prevent it from going bad in the tank.",
        "sentiment": "NEGATIVE",
        "score": 0.9913485646247864
    },
    {
        "comment": "I went through the process with my HOA awhile back. At the time, SoCal Edison was offering rebates and meters but seems like they ended that program. I ended up not going through with it because I can charge at work.\n\nLarger HOAs putting in a single Level 3 charger would probably be the best option these days.",
        "sentiment": "NEGATIVE",
        "score": 0.9981929659843445
    },
    {
        "comment": "I actually have, in a place where they could not refuse by law. It was just a single email telling them I was doing it. It would have been hard without that law and it was very easy with it. A bunch of people in the same parking garage have done it too. It could all have been more coordinated but for new construction it's also becoming mandatory. I don't think EVs are going to fail or even be significantly delayed from this.",
        "sentiment": "NEGATIVE",
        "score": 0.9710031747817993
    },
    {
        "comment": "Not going to lie I didn't read that far back up.  And yeah, you can't fit humans back there for more than 15 minutes.  My Fiesta has a bigger back seat.",
        "sentiment": "NEGATIVE",
        "score": 0.8999484181404114
    },
    {
        "comment": "Massive taxbreak and other perks help a lot to push people to buy EV",
        "sentiment": "POSITIVE",
        "score": 0.8837450742721558
    },
    {
        "comment": "We aren’t dismissive we just think the VAST majority of people heavily over state the range concern. I drive for work all over NC as I’m in sales. I’ve mapped every long range customer I have. Charging isn’t an issue. Worst case I hit a Supercharger for 20 mins on the way home. \n\nSure. You may need to put some thought in to it to drive across country but that’s certainly doable today. And we will never have chargers all over like gas stations. Just not needed.",
        "sentiment": "NEGATIVE",
        "score": 0.8898884057998657
    },
    {
        "comment": "Yeah I agree with all of that. I was just saying that *currently* EVs wouldn’t work for a lot of people in apartments. Hopefully that changes significantly before too long.",
        "sentiment": "NEGATIVE",
        "score": 0.9431692957878113
    },
    {
        "comment": "Hell, in the time I've had my Tesla my wait times at Superchargers have dropped by nearly half. Road trips during the summer of 2019 meant 45-60 minute charge sessions. Then with a SW update the old V2 chargers got a bit faster and the new V3 chargers had me down to 20-30 minutes per stop. I've never had a car that got *better* over time. It's crazy.",
        "sentiment": "NEGATIVE",
        "score": 0.9967526197433472
    },
    {
        "comment": "I worked VZW tech support around the time the iPhone 4 was finally available on that network. There were so very many people calling up who had some ancient flip phone on its 3rd or 4th battery ready to upgrade. The pent up demand was real.\n\n\"How are we going to make enough batteries to keep up with EV demand?\" We won't at first. But people aren't going to buy a new ICE instead. They'll keep driving what they have until supply catches up.",
        "sentiment": "POSITIVE",
        "score": 0.9908959269523621
    },
    {
        "comment": "Yup. Exactly what I'm talking about. Once you drive something like a Tesla you just don't ever see wasting money on a new ICE ever again. No gradual ramp down for ICEs in that world. People start to see EVs as the future and if they can't yet get a new EV they'll keep driving what they have until they can. What they won't do is waste money on a new ICE.",
        "sentiment": "NEGATIVE",
        "score": 0.9878059029579163
    },
    {
        "comment": "You are assuming most new EVs will be capable of back-feeding the grid. It will take some serious upgrading of both the electric grid and EVs and EVSE to make that happen.",
        "sentiment": "NEGATIVE",
        "score": 0.9972878694534302
    },
    {
        "comment": "They are. So, with a PHEV you've got:\n\n* Slower sales\n* Less profit margin\n* Weak future\n\nA company isn't going to be very excited to keep making a product like that.",
        "sentiment": "NEGATIVE",
        "score": 0.999536395072937
    },
    {
        "comment": "I absolutely would buy a PHEV.  I'd run out this very weekend to buy a RAV4 Prime if I could actually find one optioned out and not price-gouged for $5K (or more) over MSRP.  I've been trying to get one since release.",
        "sentiment": "NEGATIVE",
        "score": 0.998630940914154
    },
    {
        "comment": "Can confirm this, it’s called Maintenance Mode and runs after six weeks of not using gas.",
        "sentiment": "NEGATIVE",
        "score": 0.99864262342453
    },
    {
        "comment": "Is it California?",
        "sentiment": "NEGATIVE",
        "score": 0.9921219348907471
    },
    {
        "comment": "It's not like everyday Norwegians have a choice on oil extraction",
        "sentiment": "NEGATIVE",
        "score": 0.9701740741729736
    },
    {
        "comment": "Range and actually being able to charge are different things though.  A lot of people can't charge at home, which is what I'm talking about here.  Without charging at home, I consider easy access to fast chargers to be mandatory.\n\nI also think there is a lack of **fast** chargers for non-Teslas.  Of course I expect this to change (as would anyone who has been paying attention).  But I can't buy a vehicle today based on an unknown charging infrastructure build-out.  It could be 5+ years out, but it would be a problem for me *today* if I bought an EV.",
        "sentiment": "NEGATIVE",
        "score": 0.9927436113357544
    },
    {
        "comment": "Tesla is modifying your car for you.\n\nIf you (knowledgably)modified an ICE car, it would get better too.\n\nWhich makes Tesla kinda a cool company",
        "sentiment": "POSITIVE",
        "score": 0.9982709884643555
    },
    {
        "comment": "I am indeed. New models are starting to come with the feature and the vast majority of EVs and EVSEs that will exist in 10 years haven't been built yet. The grid won't need much upgrading though. It's already common to install solar at home and there's no grid upgrade needed to feed energy in reverse. There will need to be coordination to decide when to feed and when to charge but that's a layer above the grid infrastructure itself.",
        "sentiment": "NEGATIVE",
        "score": 0.8817387819290161
    },
    {
        "comment": "Increased complexity as well!",
        "sentiment": "POSITIVE",
        "score": 0.9994200468063354
    },
    {
        "comment": "\"I'd totally buy one\" =/= an actual sale. This proves my point. All I hear is how PHEVs are supposed to be so great. The uninspiring sales numbers paint a very different picture.",
        "sentiment": "POSITIVE",
        "score": 0.6163918375968933
    },
    {
        "comment": "Portugal",
        "sentiment": "POSITIVE",
        "score": 0.9772241115570068
    },
    {
        "comment": "I’m not arguing. If I couldn’t charge at home I wouldn’t have my Tesla. And I live less than 10 mins from a new 250kw Supercharger. It would be a hassle. But that’ll change for condos and apartments in the next 5 years.",
        "sentiment": "NEGATIVE",
        "score": 0.9936515092849731
    },
    {
        "comment": "It's going to be a hard sell to convince people to \"settle\" for an ICE when they see they can just wait a bit to get the EV they truly desire at the right price.",
        "sentiment": "NEGATIVE",
        "score": 0.9929172992706299
    },
    {
        "comment": "Just be patient and avoid buying a new ICE. There are a ton of new EVs coming out every year.",
        "sentiment": "NEGATIVE",
        "score": 0.9917833805084229
    },
    {
        "comment": "Sounds like you like EV's. Just buy a Tesla and accept who you've become. \n\n\nOr get an RS3",
        "sentiment": "POSITIVE",
        "score": 0.9864736795425415
    },
    {
        "comment": "Just traded my RS5 for a Model 3 Performance. I'm in rural NC so you don't see many Model 3s and very rarely a Performance. But they don't stick out. I don't care. The car is fantastic. I couldn't see spending $100K (starting) for the E-Tron GT or Taycan when comparing them to the M3P.",
        "sentiment": "POSITIVE",
        "score": 0.9919986128807068
    },
    {
        "comment": "If it I had this decision I would go for one last ICE daily bang. Go all out. Loud and manual if you can handle it. Realize the rest of your life will be electric DD.",
        "sentiment": "NEGATIVE",
        "score": 0.995854914188385
    },
    {
        "comment": "Sure, but at the end of the day at least you have a vehicle that's 50% under-powered ICE, 50% short-range EV and 100% disappointment!",
        "sentiment": "NEGATIVE",
        "score": 0.9993184804916382
    },
    {
        "comment": "I've been actively contacting dealers to find and purchase one.  No one has them.\n\nIt isn't an actual sale because they don't have one to sell me.\n\nThis isn't some hypothetical.\n\nHere, if this makes you happy: \"I will buy one as soon as I find one.\"",
        "sentiment": "NEGATIVE",
        "score": 0.995003879070282
    },
    {
        "comment": "> But that’ll change for condos and apartments in the next 5 years.\n\nHopefully that is true. But people aren't going to buy the cars until it actually *does* happen. \n\nThis is a chicken and egg issue and a perfect case for government funded infrastructure (which hopefully the infrastructure bill making its way through Congress will help solve).",
        "sentiment": "NEGATIVE",
        "score": 0.7601844668388367
    },
    {
        "comment": "I don't dissagree. I mean you have to have access to home or work charging for a PHEV to be viable anyway. If you have access to daily charging why not go full EV?",
        "sentiment": "NEGATIVE",
        "score": 0.998256504535675
    },
    {
        "comment": "So, my main point is that manufacturers will be less and less *willing* to sell PHEVs. Toyota's probably the most willing of them all to make and sell PHEVs but they not only limited production of the Rav4 PRIME but limited sales in the US to CARB states only. I bought my Tesla here in MN because Tesla *wants* to sell their cars and people *want* to buy them. That's because BEVs sell incredibly well and have high profit margins.\n\nGood luck getting one. Because of how the economics are working out you're only going to get less and less opportunity to buy a PHEV. $5k over MSRP without the options you want may be the best deal you'll see unless you wait to get one used.",
        "sentiment": "NEGATIVE",
        "score": 0.9922463893890381
    },
    {
        "comment": "I know it's quite a niche but where I grew up a lot of people have a relatively short commute but travel far on weekends holidays and it's not very densely populated so they work well",
        "sentiment": "POSITIVE",
        "score": 0.9896105527877808
    },
    {
        "comment": "Yep, if fucking blows.  I have the luxury of waiting, at least for new, but a regular (non plug) hybrid is looking more and more likely.  I won't buy a non-hybrid ICE.\n\nOr, as you said, get one used.  It would save me the depreciation hit.\n\nThat said, poor sales doesn't mean low demand for them.  In this case, poor sales is due to poor supply.\n\nFor the time being, I'm just waiting on the sidelines.",
        "sentiment": "NEGATIVE",
        "score": 0.9988401532173157
    },
    {
        "comment": "PHEVs are going to go the way of physical keyboards on smartphones. Most people are in the habit of fueling up for road trips just like most people were in the habit of texting with physical keyboards. The idea of being 100% dependant on charging is a new thing and that fact alone makes people anxious just like the idea of touch screen typing was new.\n\nThe last keyboard Android I had I ended up regretting having the keyboard because swype ended up being so much better. Once I stopped using the keyboard it was just this extra, bulky, useless piece of equipment. Shortly after that I stopped seeing new phones with physical keyboards. More costly to produce and people discovered they didn't need or want them. Once again: the manufacturer is going to go the route of cutting production costs and you can't do that with PHEVs.\n\nI'd never buy a PHEV because I'm now familiar with what it's like to have a 100% BEV and I've witnessed the fast charging network get built out around me at great speed. If I buy a new PHEV now with a 5 year loan I can see that before it's even paid off I'd lament having essentially a short-range EV with a gas engine in a world of full BEVs and fast charging. Oher people would have vehicles that are significantly more powerful than mine but just as capable for road trips and camping.\n\nIf Tesla is the iPhone of EVs who's going to be the Android of EVs and who's going to be the Nokia/BB/Windows Phone of EVs? Until there's a clear \"Android\" EV I can't see spending any good money unless it's a Tesla or repairs on our 2010 Outback. Otherwise I'd feel like a bag holder.",
        "sentiment": "NEGATIVE",
        "score": 0.9993466734886169
    }
]