[
    {
        "comment": "As time has proven you can pretty much say whatever you want as long as it's 10+ years away. \n\nI don't doubt everything will *at least* be a mild hybrid, but there's no way the ICE is dead in 2035.",
        "author": "terroristteddy",
        "score": 1737
    },
    {
        "comment": "That's okay, I bet Dodge will still have insane V8s going into their entire lineup at that time still lol.",
        "author": "lazarus870",
        "score": 122
    },
    {
        "comment": "They can say whatever they want, no ones going to hold them to it in 10 years when they’re still selling ICE’s.",
        "author": "ThiccAssCrackHead",
        "score": 311
    },
    {
        "comment": "I figure the moment that Ford figures out how to sell an all-electric F150 for less than $35k, that'll be all she wrote for most consumer internal combustion in the U.S.",
        "author": "RhinestoneTaco",
        "score": 384
    },
    {
        "comment": "Unfortunately, it’s mostly electric Chevettes.",
        "author": "doctorbimbu",
        "score": 105
    },
    {
        "comment": "Just saw a picture of a guy with a Chevy emblem shaped confederate flag tattoo on his arm. I’d love to hear his opinions on this",
        "author": "Probablyskippinwork",
        "score": 20
    },
    {
        "comment": "Sure hope they find a way to combat the -40c temperatures in manitoba before then. Or we are gonna see alot more sleds on the commute",
        "author": "IWasAPeachOnce",
        "score": 52
    },
    {
        "comment": "lmao okay. \n\nI'll believe this when the charging infrastructure is there\n\nAnd the maintenance infrastructure\n\nAnd the actual car development infrastructure.",
        "author": "mcbergstedt",
        "score": 22
    },
    {
        "comment": "From what I've seen the next generation of almost every vehicle in every automakers lineup will be hybrid or fully electric. Think 2025 or 2026. If they leave anything ICE, it will be the big heavy trucks and suvs. Of course first thing killed will be sports cars even though they make up small percent of sales. I've always said I don't mind everything going electric but leave a small percentage of fun cars ICE. \n\nIt won't happen though, we are soon going to be forced into buying ICE or face some financial costs. Governments around the world want to push this but they don't seem to have a good plan besides taxing us a ton to fund the forced rollout and conversion to EV. They will be expensive to own for the next 10-20 years. \n\nI don't get why the R/electric vehicles trolls get all hyped over 140k cars like the new Tesla. Sure it's cool , fast, and has range, but none of us have that kind of money. Now we will presented with options for sports cars. Like the new electric Mustang. Probably starting at 50K for low range model with base suspension. Near 80K for improved suspension and better range, performance. \n\nAll electric cars will feel the same. Just look and handle different. Same motor and powerband , same power delivery, transmission feel, etc.... It's gonna become build a bear for cars, lmao.",
        "author": "AdamJap21",
        "score": 8
    },
    {
        "comment": "I wouldn't go so far as to say that ICE will be dead by 2035, but it's difficult to overstate the importance of one of the largest manufacturers of ICE engines saying they *plan* to move away from them entirely.\n\nThey likely already have some form of product lineup structured behind the switch, and I wouldn't be surprised if the transition is a lot more sudden than people are imagining it to be.",
        "author": "karankshah",
        "score": 8
    },
    {
        "comment": "Most of the comments here from car people have the attitude of, \"lol that's never happening\" and \"I'll believe it when I see it\". When in reality if they actually read about how GM is doing it, they'd see that over half of GM's massive R&D budget is going to solely EV vehicle development. The wheels are already in motion for this change, it's a matter of when, not if it'll happen.",
        "author": "tfox245",
        "score": 6
    },
    {
        "comment": "No suprise here. We'll see this sort of announcement with every car maker in the near future and I'm totally okay with this. It is the future. My next daily will be an EV.\nNevertheless I just hope I will be able to drive my ICE cars at least a few thousand kilometers a year even in the 2030s.",
        "author": "None",
        "score": 58
    },
    {
        "comment": "Sure, by 2025 they will say 2045, whatever",
        "author": "ajyahzee",
        "score": 14
    },
    {
        "comment": "On light duty vehicles. So pickup trucks and big SUVs, not so much.",
        "author": "Snoo74401",
        "score": 6
    },
    {
        "comment": "Real question here, I'm not trolling but I'm not sure if this is better asked on a science sub. \n\nIf every new car sold by every manufacturer in 10 year's time was fully electric, and a good proportion of the energy sources were renewable/carbon neutral, what actual tangible effect would that have on global warming? Are we talking reversing, slowing down, maintaining the same rate, or still accelerating but slightly less? \n\nSome say we've passed the point of no return decades ago, and that the current level of CO2 in the atmosphere will continue to warm the planet to disastrous levels even if all manmade greenhouse gas emissions stopped overnight.\n\nIf this is all for naught or too little too late, then I'm struggling to see much of the point of announcing an ICE ban some years in the future other than trying to garner good publicity and provide a false sense of hope.\n\nI'm not even going to mention the enthusiast perspective and nostalgia towards the combustion engine, because that alone has no sway in dictating the direction of the market or policies.",
        "author": "megacookie",
        "score": 18
    },
    {
        "comment": "It won’t happen without a big jump in battery technology (not to mention infrastructure for charging) which is unlikely unless room temperature superconductors are used which will jump the costs. Trucks are super profitable and most pickups are not cheap, $40K and up being common, so they might be killing a market. Work trucks (3/4 ton and above) need to carry weight for long distances each day. I cannot see a dump truck driver stopping to charge 2-3X a day and delivering less loads and earning less pay. So saying 100% of vehicles seems more PR than reality.",
        "author": "twiddlingbits",
        "score": 17
    },
    {
        "comment": "Independent of the reasons they’re doing this, I get it, climate change, blah blah, this is a huge gut punch to most car people. We all kind of know its coming, but the replacement of everything we love about cars with soulless, sterile, electric cars is a very difficult thing to accept.",
        "author": "Umbra427",
        "score": 31
    },
    {
        "comment": "So dodge is going to have a huge market.",
        "author": "Imbarefootnithurts",
        "score": 5
    },
    {
        "comment": "Coincidentally California will only sell electric cars by 2035.\n\nI am not sure what the sales numbers per state are but it looks like they think California is so important they'd go all electric.\n\nWould be fun to see an electric spiritual successor to the Corvette.",
        "author": "None",
        "score": 15
    },
    {
        "comment": "Unless they find a better source than Lithium Ion for batteries this really isn't going to help anything.   We are still depleting a limited resource.  Harder to mine and more limited.  Alternative fuels such as hydrogen would be a better focus.",
        "author": "tdmopar67",
        "score": 15
    },
    {
        "comment": "Man a lot of people in the comments are refusing to take off their super thick rose tinted glasses... it’s depressing. No sane non-enthusiast new car buyer is going to want to buy a new gas car in 2035. We’ve already extracted every bit of performance and efficiency we possibly could out of ICE without going insane. Battery and charging tech is advancing exponentially now that Tesla got the ball rolling on the EV craze. I’m looking forward to the future. Can’t wait to EV swap my E30",
        "author": "None",
        "score": 8
    },
    {
        "comment": "It'd be pretty cool owning both and ICE and EV Camaro in my lifetime.",
        "author": "Soundjammer",
        "score": 5
    },
    {
        "comment": "So long LS V8 powered everything.  Yeah right.",
        "author": "Viperlite",
        "score": 527
    },
    {
        "comment": "Yeah if you actually read that California legislation, it still allows for hybrid, plug in hybrid and even mild hybrid cars. It just doesn’t allow for purely gasoline cars",
        "author": "None",
        "score": 28
    },
    {
        "comment": "Imo. These kinda announcements are just a attempt to boost the stock price since tesla is so overvalued. Gm doesn’t give a damn about climate change and has no intention of sticking to a random announcement they made 15 years ago.",
        "author": "N0Name117",
        "score": 231
    },
    {
        "comment": "Of course ICE won’t be dead in 10-15 years. Just that it’ll be far harder to buy a _new_ car with an ICE then.",
        "author": "Gundea",
        "score": 71
    },
    {
        "comment": "With how fast battery tech is advancing? 2035-40 is quite reasonable.\n\n2035 is 14 years from now. 2007 was 14 years ago. Look at how much the EV landscape changed in that time frame. Remember, the first Nissan Leaf came out in 2010 and the Tesla Model S entered production in 2012.",
        "author": "Ultra-sphinx",
        "score": 42
    },
    {
        "comment": "15 years ago, the concept of iPhone and everything at the palm on your hand is absurd. \n\nNow, iPhone and Android is so boring and commonplace that it's hard to imagine a world without them. \n\nBy 2012 no one is buying blackberry because they were so outdated even though iPhobe was only introduced 5 years ago. \n\nWhen $25K Model 2 and $40k Cybertruck is widely available by 2025, few people in their right mind will want to buy comparables priced ICE cars which has worse specs and much higher operating cost. \n\nTechnology changes fast. 2035 100% new EV is not only possible but probable.",
        "author": "kenypowa",
        "score": 57
    },
    {
        "comment": "Battery tech is advancing pretty damned quickly. If the solid state batteries due next year are really what they're cracked up to be (and it seems most automakers now agree they're incoming), ICE is dead in eight years, not fifteen.",
        "author": "Recoil42",
        "score": 21
    },
    {
        "comment": "Japan and england banned the sale of ICE cars after 2030. Some countries have it earlier and others later. You will be able to buy ice cars used tho.",
        "author": "None",
        "score": 9
    },
    {
        "comment": "* The Electric car is 15 years away\n* Fusion Energy in 50\n* Out of Iraq and Afghanistan before the new president's first term ends",
        "author": "KMKtwo-four",
        "score": 7
    },
    {
        "comment": ">but there's no way the ICE is dead in 2035.\n\nCalifornia says they will stop selling 2035, it's most likely related to that.",
        "author": "None",
        "score": 11
    },
    {
        "comment": "Hellcat Caravan.",
        "author": "None",
        "score": 55
    },
    {
        "comment": "In related news, Dodge has announced the minimum number of cylinders in their cars will be 8 by the year 2035. Hellcat variants will be the entry level to all their vehicles.",
        "author": "truthlesshunter",
        "score": 31
    },
    {
        "comment": ">I figure the moment that Ford figures out how to sell an all-electric F150 for less than $35k\n\nThat's a tough one to achieve, considering gasoline F-150's rarely go under $35k lol",
        "author": "baloney_popsicle",
        "score": 236
    },
    {
        "comment": "Ok but electrified malaise era heaps would slap so hard",
        "author": "nickz03",
        "score": 29
    },
    {
        "comment": "As a saskie people already ride their sleds quads and trikes to school",
        "author": "32modelA",
        "score": 11
    },
    {
        "comment": "My .02 is you’ll be able to drive your ICE cars for a long time - well past the 2030s. (I personally won’t go back to an ICE car for a daily, unless I come up with the money to buy a special weekend car. EV tech is solid now, and only getting better). But it’s still only the beginning in the big scope of things, and many people refuse to change. \n\nI think there’s a possibility for insurance premiums to go up if driverless tech really becomes reliable and widespread, and cars that are fully human controlled become more of a “hazard” in their eyes, but I think such a time is quite a while away, at minimum due to all the regulations that would go through. \n\nI also think there’s a possibility that you may see a slight rise in gas prices by then simply as there’s less demand. But at the end of the day, EV sales are only about 2-3% of all car sales still... ICE cars being sold on the road today will still be around en masse for 15 years or more in most cases (look at all the 2005 Camrys going around).",
        "author": "-ZeroF56",
        "score": 38
    },
    {
        "comment": "I can't answer your question. But I will say that you need to consider that global warming isn't the only issue with ICE cars. A big thing is \n local pollution. If every car in your city was suddenly an EV, air quality would improve drastically. Moving towards EVs will be a big step towards that.",
        "author": "Fugner",
        "score": 34
    },
    {
        "comment": "We're already seeing effects of climate change due to greenhouse emissions. It will get worse. However, if humanity just gives up on slowing down emissions then the outcome will be even worse than it is already predicted to be.\n\nRight now, we can still limit the increase in earth's temperature to below 2 degrees celcius if we can make significant strides towards carbon neutrality by 2035.\n\nWhy is 2 degrees the big target? Well at and beyond 2 degrees, things get a whole lot worse. We're talking not only catastrophic damage to our planet, but massive social and economic damage as well.\n\nI think theres a filter that prevents me from sharing the link, but you can google NASA's report called \"A Degree of Concern: Why Global Temperatures Matter\" which will summarize the effects of reaching a 2 degree increase in reference to the UN's climate change council (IPCC)'s report",
        "author": "xChaosPWNSx",
        "score": 24
    },
    {
        "comment": "It's not even climate change.     \n    \nFor me, it's all about $0.70/gallon equivalent for instant torque, no transmission and never going to a gas station again. The fact that it's possible to create electricity from renewable sources is neat, but not exciting.     \n    \nI feel like most people vastly underestimate the phrase \"instant torque\" until they experience it. I think anybody that has ever hated on automatic transmissions needs to test drive an EV.",
        "author": "None",
        "score": 27
    },
    {
        "comment": "> We all kind of know its coming, but the replacement of everything we love about cars with soulless, sterile, electric cars is a very difficult thing to accept.  \n\nFor my 2 cents, I'd lament the loss of what you love about gas cars rather than criticizing electric cars. I have one of each. I much prefer driving the EV from a driving experience perspective.",
        "author": "NoVA_traveler",
        "score": 16
    },
    {
        "comment": "1. Lithium isn't that limited, there is a lot of it in the earth's crust, and a lithium ion battery doesn't actually use that much of it, it's a small percentage of the battery by weight\n2. You can recycle it almost completely unlike gasoline\n3. Mining lithium doesn't meaningfully contribute to climate change, it's not worse than mining other stuff on that front",
        "author": "wacct3",
        "score": 7
    },
    {
        "comment": "lithium is like one of the most common elements in the earth. One car  only needs 1 kg of it.",
        "author": "The_Didlyest",
        "score": 5
    },
    {
        "comment": "Aren't they planning to shitcan the Camaro in the next few years?",
        "author": "idontremembermyoldus",
        "score": 6
    },
    {
        "comment": "I think some of the long-range Tesla’s can go close to 400 miles. The upcoming Rivian pickup is supposed to have ~400 miles of range as well.",
        "author": "UnderwhelmingAF",
        "score": 10
    },
    {
        "comment": "Yeah that ain’t happening, \n\nAlso LS’s aren’t what’s been in production. They’ve moved on to LT’s.",
        "author": "ThiccAssCrackHead",
        "score": 5
    },
    {
        "comment": "Well it's not going to happen without the US government, state governments and cities and counties and companies all investing a lot to make it happen.\n\nSo that's what they should do. Shame the last president wasted four years.",
        "author": "Bojarow",
        "score": 7
    },
    {
        "comment": "It’ll be 100 years from now and GM will still offer 350 SBC and LS crate motors, because if you’re going to keep making an engine from the 50’s, you may as well do it forever",
        "author": "I_amnotanonion",
        "score": 406
    },
    {
        "comment": "Now THAT feels much more realistic. Hybrids are the perfect solution.",
        "author": "xmu806",
        "score": 16
    },
    {
        "comment": "GM just mad about GME",
        "author": "withsexyresults",
        "score": 158
    },
    {
        "comment": "Everything is always about the stock market with big corporations. Not only does everyone want some of that Tesla Money™, but they also want to be viewed as a leader in the segment.\n\nLet's not forget that they politically fought any sort of more efficient vehicle energy reform up until this month.",
        "author": "Robbbbbbbbb",
        "score": 17
    },
    {
        "comment": "> Imo. These kinda announcements are just a attempt to boost the stock price since tesla is so overvalued.  \n\nI think it's meant to do something slightly different actually. The problem with legacy auto and EVs is that the transition will necessarily be painful because you have to still make money while funding and getting consumers to buy the new technology. VW is the only big auto to really take that challenge on. So what GM is doing here is using it's major market position to signal to the rest of the industry that 2035 is the date we're all going to quit ICE and go to EVs, which protects them from the risk of having to convince consumers on their own. It also tells legislators to set that as a realistic date to ban the sale of new ICE, further protecting them from negative economics. If you look at existing ICE bans, the UK and other EU countries have already set 2030 as the date, while CA has set 2035. GM sees the writing on the wall and is trying to seize a leadership role.     \n\nTesla doesn't have to worry about any of this because they don't have a legacy ICE business to manage, nor do they need to worry about investors expecting dividends.",
        "author": "NoVA_traveler",
        "score": 57
    },
    {
        "comment": "I'm sure there were several PowerPoints and a few meeting with the name \"program\" or \"Initiative\" in the title",
        "author": "matthieuC",
        "score": 6
    },
    {
        "comment": "They’re interested in making money. And I think they recognize that ICE will die in the next couple decades. And the earlier they transition to electric the better position they’ll have in the long run.",
        "author": "None",
        "score": 12
    },
    {
        "comment": "i bought my prius for 3k.... thats a LOT of gas to get to 25k",
        "author": "lostfate2005",
        "score": 20
    },
    {
        "comment": "Doubt, gasoline is too cheap and accessible. Plus people still have deeply entrenched range anxiety, and renters have nowhere to charge there cars at home, which precludes a lot of buyers that don't want to rely on public chargers",
        "author": "terroristteddy",
        "score": 28
    },
    {
        "comment": "I'll stick with my diesel powered full-size truck for towing.",
        "author": "Strigoi666",
        "score": 9
    },
    {
        "comment": ">15 years ago, the concept of iPhone and everything at the palm on your hand is absurd. \n\n........? \n\n1996 saw the first generation of Palm Pilots commercially available. By the start of 2000 ish the pocket PC/PDA ideas was fully in swing; Research in Motion had released it's super popular Quark in 2003, Compact had released the iPAC, and the Dell had pushed out the Axm. Those are the one's I know off the top my head but AFAIK every major electronics maker had some line of portable computer. \n\nTechnology can move quick but I have no idea where you're getting the idea that PDA's weren't a thing 15 years ago.",
        "author": "OkRole3",
        "score": 6
    },
    {
        "comment": "Battery supply is the constraint. Car manufacturers today can’t supply enough batteries for current demand, this is going to be the major challenge with manufacturers trying to deliver exponential demand for EV’s. Where is all the Lithium going to be sourced for 50x the batteries that are needed today? Where are the going to manufactured?  The Tesla gigafactory that was started in 2014 is still NOT fully operational because of supply issues. Lithium mining is extremely impactful on the environment and it will need to be increased 50 fold in order to supply all the world with EVs instead of ICE. \nThe amount of energy the world consumes to power vehicles is astronomical and the supply chain to deliver oil and gas is the most complex logistics system in the world.  \nThe only way we move to EVs by 2035 is if the world is ready to commit tens of trillions of dollars in the next decade to replace oil and gas.",
        "author": "Jzzlbbr57",
        "score": 15
    },
    {
        "comment": "Any sort of battery tech is useless until that battery tech translates into lower prices on EVs. And by lower I mean accessible to the average family, not an upper middle class one",
        "author": "oakolesnikov04",
        "score": 22
    },
    {
        "comment": "> Battery tech is advancing pretty damned quickly.\n\nThis point can't be emphasized enough. We're all used to the auto industry moving at a relatively glacial pace. EVs have been improving at rates more like computers. In the two years since getting my Tesla the number of Superchargers in the US has grown by nearly 2x and the charging speeds are twice as fast, too. Now Tesla's spinning up production of their next gen batteries which have even better tech, faster charging, cheaper and faster production.\n\nSome people are dismissing EVs going on info from 5 years ago. That's ancient history. Info from 2 years ago is already very obsolete. The only reason people think \"ICEs aren't going away soon\" is they haven't realized how fast things are *already* changing.",
        "author": "trevize1138",
        "score": 5
    },
    {
        "comment": "California says a lot of things though, and that's still 14 years ahead of us. Automakers aren't stupid, they know that politicians like to talk big and when it benefits the automakers they'll play along with the politicians.",
        "author": "opkraut",
        "score": 13
    },
    {
        "comment": "Hellcat Fiat 500",
        "author": "reesem03_",
        "score": 36
    },
    {
        "comment": "But when there is maintenance how much is it gonna cost for both types",
        "author": "412gage",
        "score": 8
    },
    {
        "comment": "I probably should have said $40k.",
        "author": "RhinestoneTaco",
        "score": 131
    },
    {
        "comment": "I don’t understand how they get their TCO numbers. If you charge your Tesla at a supercharger, it’s way more expensive per mile then gas, and if you charge at home it’s about the same. I’m comparing to my car, a Corolla Hybrid. The only extra cost I have is 3 oil changes a year at $30 each.",
        "author": "Not_My__President",
        "score": 25
    },
    {
        "comment": "Can't wait to hop on Jegs & YearOne in the future and price-out EV powertrain platforms that come ready to have a classic car body dropped right on & bolted to it.",
        "author": "AmbitiousButRubbishh",
        "score": 6
    },
    {
        "comment": "At least you can keep the heat on while charging in EVs. Of course that will then make the charging take even longer...",
        "author": "guyfromnebraska",
        "score": 15
    },
    {
        "comment": "Answers the question, and of course gets downvoted.",
        "author": "urochromium",
        "score": 5
    },
    {
        "comment": "Cargo ships emit the least emissions per ton per mile for moving large amounts of freight. They are still polluting as hell and should be an easy target for cleaning up and improving efficiency, but they are efficient for what they're supposed to do.\n\nCruise liners and other leisure travel (including planes) is an absolutely unnecessary waste of resources and huge source of pollution that ought to be cut down on, I agree. \n\nBut it seems like cars will continue to be disproportionately focused on, while the same CEOs and execs who push for EVs fly halfway across the world in their private jets every few weeks.",
        "author": "megacookie",
        "score": 6
    },
    {
        "comment": ">mining lithium is super good for the environment\n\nNobody's saying it is; that's what we call a strawman argument. Don't let perfect become the enemy of good.",
        "author": "Drzhivago138",
        "score": 6
    },
    {
        "comment": "Those are huge plusses in the column for electric vehicles, sure.   For me it’s still not enough to tip the scales, because those are more utilitarian arguments (aside from instant torque) and my appreciation of cars is admittedly skewed more toward the visceral enjoyment than the economic factors.  Just my personal feelings. Some people like cars based more on other factors and that’s fine too",
        "author": "Umbra427",
        "score": 10
    },
    {
        "comment": "Meh, i really don't give a shit about \"instant torque\" tbh. It's not like the reason I love classic muscle cars is because of their pure performance numbers. I like the way they look but I *love* the sound of a big V8, it brings me back to my childhood when I worked on my dad's vette with him and got to feel it shake the walls on startup - it was fucking badass.\n\nAn electric car will never be able to do that for me.",
        "author": "None",
        "score": 17
    },
    {
        "comment": "Yes, I have. They may be fast but they’re absolutely soulless and the “performance upgrades” are just not the same. No engine sound, no possibility for manual transmissions (although those have been dying for a while anyway). There’s also  no denying that this kills a huge part of car culture in general.",
        "author": "Umbra427",
        "score": 16
    },
    {
        "comment": "> They're fast AF stock.\n\nAnd on the luxury side, they are quiet and smooth AF.",
        "author": "RhinestoneTaco",
        "score": 6
    },
    {
        "comment": "Yes, they do have a plan. \n\nThe plan is the state level politicians will have moved on to their federal positions and could not care less about California's infrastructure at that point.",
        "author": "wholegrainoats44",
        "score": 43
    },
    {
        "comment": "Also PG&E starting catastrophic wildfires hasn't really helped their argument for robust electric infrastructure.",
        "author": "fireinthesky7",
        "score": 8
    },
    {
        "comment": "IIRC California always had stricter emission regulations than other states. Even then I don’t think ICE will just die. At least definitely not in the northern states / Texas.",
        "author": "None",
        "score": 10
    },
    {
        "comment": "The upcoming Model S refresh will supposedly offer up to 520 miles on a charge, but I'd wait for independent verification on that.",
        "author": "fireinthesky7",
        "score": 10
    },
    {
        "comment": "The obsession for massive torque is quite recent.  The main goal of diesel was fuel efficiency. Unless they come with another type of battery or induction charging roads, diesel will still have its utility for actual work and long hauling scenarios.\nI have nothing against instent massive torque but having the quickest truck 0-60 with a 30,000lbs trailer is a recent marketing avenue and not what people who work with their trucks actually need.",
        "author": "COD6F14",
        "score": 7
    },
    {
        "comment": "Why change a good design? ICE motors still selling and the designed is tested and the parts are available.",
        "author": "acideater",
        "score": 157
    },
    {
        "comment": "GM is about to turn into GM Electric aka GME",
        "author": "oakolesnikov04",
        "score": 77
    },
    {
        "comment": "> If you look at existing ICE bans, the UK and other EU countries have already set 2030 as the date, while CA has set 2035. \n\nLet's see how this goes.",
        "author": "juh4z",
        "score": 35
    },
    {
        "comment": "The US will actually have to care about and invest in infrastructure to get even close to this.",
        "author": "The_Bucket_Of_Truth",
        "score": 17
    },
    {
        "comment": "1/4 of cars on the road today are 16 years or more old.\n\nThe average fleet age in the US is about 12 years.\n\nThose will probably both increase in the next 15 years.\n\n1/4 of cars on the road in 2035 will be 2018 or earlier models.\n\nThe average fleet year will probably be around 2022 in 2035.",
        "author": "ritchie70",
        "score": 17
    },
    {
        "comment": "lol yeah gas is not going anywhere by 2035.",
        "author": "lostfate2005",
        "score": 19
    },
    {
        "comment": "You don't think there will be used EVs in 10 years?",
        "author": "snt271",
        "score": 16
    },
    {
        "comment": "> and renters have nowhere to charge there cars at home, \n\nA lot of renter's in cities don't even have a parking spot to leave their car in daily, let alone a place to charge an EV. \n\nImagine how amplified im Boston the space saver madness after a snow storm will be when you also have to compete for a place to charge your car.",
        "author": "732",
        "score": 18
    },
    {
        "comment": "Which is why ICE is not going away in 2025. 10 year lead time is more than enough for anyone to experience Tesla or other EV to never go back to ICE cars.",
        "author": "kenypowa",
        "score": 10
    },
    {
        "comment": "On the other hand, an electric motor could absolutely put out more torque for towing than a diesel, all instantaneous, given a proper EV truck platform.",
        "author": "732",
        "score": 15
    },
    {
        "comment": "Because when iPhone launched in 2007, 14 years ago, it did not have GPS, 3G data, picture messaging, apps/app store, video recording, video calling, screenshots, cloud sync, and a handful of other features that RIM, HP, Palm, HTC, Nokia did have available at the time. \n\nThat is an example of a fallacy for a large set of consumers to believe that *none* of that technology existed before it exploded into pop culture (in this case with Apple iPhone).",
        "author": "cd29",
        "score": 5
    },
    {
        "comment": "In 2005, I don't even think I had a cellphone. Those times were only older kids were able to get a Cingular flip phone. Nowadays parents give their 4 year olds new iPads.",
        "author": "PorscheBoxsterS",
        "score": 9
    },
    {
        "comment": "Batteries now cost around $156 per kilowatt-hour, according to BloombergNEF,  which is an 85% decline from 2010′s $1,100 plus/kWh cost.  $100 per kWh is largely understood to be the price/function parity line with ICE and that number is likely achievable in the next 3 years.  \n\nI expect the purchase of an ICE vehicle in 2030 to be only a choice made by the very wealthy or the extreme fringe use-case.  By 2035, legislation won't even be needed.",
        "author": "No_U_Crazy",
        "score": 23
    },
    {
        "comment": "I know. It’s just that the year coincided. As a matter of fact didn’t Bentley plan to become a full EV brand by circa the same time?",
        "author": "None",
        "score": 5
    },
    {
        "comment": "Dodge Journey to Hell",
        "author": "None",
        "score": 20
    },
    {
        "comment": "They were actually talking production numbers.\n\n/s",
        "author": "Snoo74401",
        "score": 104
    },
    {
        "comment": "It'll be interesting to see how electric pickups are priced out... Gotta imagine that electric motors and EV trannies are super fucking cheap  compared to a 5L engine with a 10-speed automatic\n\nBut then on the other hand if OEM's want EV trucks to tow *at all*, they're going to need enormous batteries.",
        "author": "baloney_popsicle",
        "score": 69
    },
    {
        "comment": "The base price for the Cybertruck is $39,990. Same MSRP plus huge savings on gas and maint. Price parity for a tiny econobox that costs $15-$20k is a serious challenge. Price parity on trucks is far easier. It's a market ripe for the EV picking.",
        "author": "trevize1138",
        "score": 13
    },
    {
        "comment": "I needed a new F150, so I decided to go to Morganville which is what they called Shelbyville in those days. So, I tied an onion to my belt which was the style at the time. Now, to take the ferry cost a nickel. And in those days, nickels had pictures of bumblebees on ‘em. ‘Give me five bees for a quarter,’ you’d say. Now, where were we? Oh, yeah! The important thing was that I had an onion on my belt which was the style at the time. They didn’t have white onions because of the war. The only thing you could get was those big yellow ones.",
        "author": "baloney_popsicle",
        "score": 12
    },
    {
        "comment": "Teslas get 2.5 to 3 miles per KWH, the average KWH cost is $0.13, so it's 4-5 cents per mile.  The breakdowns that show higher cost typically include flat rate delivery fees that the person would pay no matter what.  At $3.00 a gallon and 30 miles per gallon it's 10 cents per mile.  You need $2.00 gasoline and a 40mpg car to match fuel costs.",
        "author": "jimbolauski",
        "score": 14
    },
    {
        "comment": "if I remember correctly, my dads Model 3 charging at a supercharger is equivalent to paying for gas for a 43 mpge car. and at home its around 100 mpge. these numbers obviously change with gas prices and electricity, but supercharging isn't that bad. my corolla hybrid has gotten 53 mpg over 24,000 miles, so I'm doing better than his supercharging rate, but not much",
        "author": "sukikano",
        "score": 16
    },
    {
        "comment": "You only need superchargers if you are going on a road trip. Charging at home cost like $0.03 a mile.",
        "author": "The_Didlyest",
        "score": 8
    },
    {
        "comment": "If I can do a reliable 300-350 miles on a charge and top back up in half an hour, that's good enough for the two or three times a year I make the trip from Tennessee back to the Midwest. If I can get from Nashville to St. Louis on one charge, I'm fine.",
        "author": "fireinthesky7",
        "score": 5
    },
    {
        "comment": "I’m not a physics expert but I don’t think it’s physically possible for 0-100% charge times to approach anything like 5 minutes for such large batteries.",
        "author": "essequattro",
        "score": 8
    },
    {
        "comment": "Agreed. It’s not even about stubbornness to give up the ICE: Electric cars are extremely expensive and repairing them is NOT DIY. Many people own older cars because they can fix it themselves and they’re affordable second hand. No one on a minimum wage job would be able to buy a new 2035 EV and if current EVs don’t mechanically (electrically?) age well, EVs won’t dominate the market for a long time.",
        "author": "General1lol",
        "score": 20
    },
    {
        "comment": "The real squeeze for ICE ownership will come when a majority of drivers are using electric cars and gasoline stations and gasoline refinement and sales in general become less and less profitable as demand dramatically dropped. \n\nLike we might not even need legislation outright banning them if the free market simply makes them too comparably expensive to daily drive or too annoying to find places to fill up.\n\nI don't see that happening before like 2050 but it will happen at some point. If 80 percent of the cars on the road are electric it's not gonna make sense for most to cater to gasoline sales anymore.",
        "author": "10000Didgeridoos",
        "score": 8
    },
    {
        "comment": "That’s assuming that the production of gasoline by oil companies stays the same as it is now. When the time comes that the market begins to shift to a majority of EVs (whenever that may be), it has to be assumed that oil companies will have caught up with the change in market and lessened their production accordingly.\n\nMy thought is that at least some of these companies will shift to renewable energy, both to stay relevant and to keep a consumer market share as significantly more electric infrastructure is required. - Shell already has charging stations at some of its gas stations for example. So years down the road, if Shell is smart, they’ll have turned their focus away from oil - theoretically creating a higher price as it becomes a more niche, less volume produced product.\n\nBut that’s a long long long way away.",
        "author": "-ZeroF56",
        "score": 5
    },
    {
        "comment": "“The pollution from ships is out in the ocean so we don't care that much about it obviously.”\n\nIs this satire. Or are you serious right now?",
        "author": "ThiccAssCrackHead",
        "score": 6
    },
    {
        "comment": "Or more correctly they'll never see the effects of it.  They'll still be flying in private jets and getting limo rides everywhere like they always do.  Same thing with every law they pass.\n\nI don't think they've really thought this thru.  The biggest problem with electric cars is charging them.  I'm probably a great candidate.  I have a garage and all that.  Unfortunately the breaker panel is tapped out.  I'll have to pull multiple permits and get an electrician to gut the house electrical to put large panel and line in and put a charger in.  That's probably at least a 5k job and all the headaches that go with it.  I don't really want to sit in a parking lot every few days for an hour to charge the car.  Its a gigantic step back in quality of life.",
        "author": "silvermk2",
        "score": 13
    },
    {
        "comment": "California's also had excess renewable energy at times and had to shut off generation. \n\nStill a grid problem, but a different kind of grid problem (irregular generation from renewables and lack of grid scale storage).",
        "author": "nucleartime",
        "score": 6
    },
    {
        "comment": "you are being sarcastic right? The most load on the grid is during the evening",
        "author": "bittah_king",
        "score": 9
    },
    {
        "comment": "Yeah for $139k. Most people can't come anywhere close to affording that",
        "author": "2CHINZZZ",
        "score": 11
    },
    {
        "comment": "I wouldn’t be so much worried about the range as the recharge time. It’s easy to just fill up your tank in a couple of minutes and go another 400 miles.",
        "author": "UnderwhelmingAF",
        "score": 9
    },
    {
        "comment": "Exactly. I wish they would call the governments bluff about the 2035 bullshit. There's no way ICE will die in 2035. It's literally impossible. You really think the last 100 years of automobile innovations will just give up and become electric? I don't think so.",
        "author": "DOugdimmadab1337",
        "score": 111
    },
    {
        "comment": "Well, for starters, our power grid can’t support 300 million electric vehicles currently. People seem to forget that aspect of switching to true electric-only vehicles. A lot of that extra power would come from coal, unless people magically stop hating on nuclear energy. The entire country’s infrastructure would have to change to the tune of likely trillions of dollars to make electric vehicles even possible. Hybrids have none of these limitations. They do not require charging. They are the most realistic solution currently.",
        "author": "xmu806",
        "score": 6
    },
    {
        "comment": "I thought at first gme were the general motors stock.",
        "author": "Wemorg",
        "score": 18
    },
    {
        "comment": "Sure, pols have been too optimistic before. At the very least, the deadlines should give a massive boost to the transition even if they ultimately get pushed a couple years. Big Auto is switching most of their R&D to electric, and that's the real key.  \n\nNorway could easily enact their 2025 ICE ban pretty much anytime. BEVs already make up 60% of new car market share there.",
        "author": "NoVA_traveler",
        "score": 8
    },
    {
        "comment": "I'd make bets that politicians will flip-flop and/or say *Well, actually, we meant this...* and allow for ICE engines to continue to be sold by then. I just don't see how exactly ICE is going to be phased out that soon, unless gov'ts want to throw money at the so-called problem.",
        "author": "Interdimension",
        "score": 14
    },
    {
        "comment": "That's the biggest thing that people don't stop to think about. It doesn't matter how great the cars are if the infrastructure isn't there to support them. A lot of people in big cities don't have anywhere to charge an EV unless those cities or the buildings where they live decide that it makes sense to invest in charging ports. I have a hard time seeing many of those places spending the fairly large amount of money it would take to have charging ports widespread, especially in already-old parking structures that would probably be better off getting torn down and replaced with new structures at that point.",
        "author": "opkraut",
        "score": 16
    },
    {
        "comment": "There are used EVs now",
        "author": "NoVA_traveler",
        "score": 16
    },
    {
        "comment": "Not that cost 3k.  My civic hybrids battery was 2,500 to replace, I imagine most full EV batteries will be more expensive and the battery degradation is real",
        "author": "lostfate2005",
        "score": 5
    },
    {
        "comment": "But the typical camera cost $100 or less. That's \"an easy Christmas present\" not \"a major expense.\" As I said elsewhere, 1/4 of the cars on the road are over 16 years old and the average car age is 12 years.\n\nIf the average camera in use today were 12 years old, it'd still be really easy to get film and get film developed. But the average camera in use today is a 2-year-old smart phone.",
        "author": "ritchie70",
        "score": 22
    },
    {
        "comment": "Only if the price is right. For an American driving 15kmi a year gas for the average new car only costs about $1400/yr, so with the Model 3, the best selling electric car ever, sitting at $40k for the lowest tier version versus like a $25k Crosstrek that only costs $1500/yr to maintain and fuel it's kind of a hard sell.\n\nEspecially when you're young, renting, and don't have access to your own charger.\n\nI agree that hybrids are going to dominate sales very soon here, but ICE isn't going to become uncommon by any means in 2035.",
        "author": "terroristteddy",
        "score": 21
    },
    {
        "comment": "There are plenty of good reasons to expect that people will want to switch to Evs, but I'm not sure that \"experiencing Tesla\" is one of them, lol.",
        "author": "WarDEagle",
        "score": 21
    },
    {
        "comment": "Diesel-Electric hybrid platforms to the rescue!",
        "author": "Squirmin",
        "score": 9
    },
    {
        "comment": ">My Tesla’s faster than your V8 and I only paid half the price haha\n\nIt baffles me that people still don't know the difference between 0-60 times and overall performance.  Model S P100D Ludicrous+ will rip the stock Viper in a straight line, but when it comes to the track the Viper is a slaying machine. Not to mention there are some Vipers tuned to 2200 HP to be drag cars, with chutes and all.",
        "author": "None",
        "score": 5
    },
    {
        "comment": "Am in the only one that likes the volt? Sure it has an engine but that does away with almost all of the negatives. \n\nTbh I drive a Mercades that gets like 15-19 mpg so I have not put my money where my mouth is.",
        "author": "fatalrip",
        "score": 25
    },
    {
        "comment": "Ford has already stated their electric F150 will be more expensive initially but will cost less in the long run.",
        "author": "smalleybiggs_",
        "score": 39
    },
    {
        "comment": "I think most truck buyers in the US don’t actually tow. For the typical consumer this may not even matter",
        "author": "beavismagnum",
        "score": 30
    },
    {
        "comment": "That msrp will likely be used as a marketing gimmick like the 35k model 3.\n\nFord and GM actually sell their base models in volume so they'd have to actually be serious about that base msrp.",
        "author": "dragonbrg95",
        "score": 35
    },
    {
        "comment": "> Price parity on trucks is far easier.\n\nI think part of it is usage parity though, not just price parity.",
        "author": "RhinestoneTaco",
        "score": 8
    },
    {
        "comment": "But that's exactly why I don't get the cost of ownership comparisons. \n\nMy mazda gets 30mpg on premium. So in Texas that's about 9 cents per mile, so roughly double that of a Tesla. \n\nSay I pay $15k more on the purchase price of a Tesla (reasonable) - it would take me 300,000 miles to make up the fuel difference, to justify a $15k premium on the front end. \n\nI don't think I've ever seen an EV with 300k miles.\n\nThe math just doesn't work at current fuel and electricity prices.  And that's at 30mpg, which many modern ICE cars can beat.",
        "author": "None",
        "score": 26
    },
    {
        "comment": "Got it, step 1 to owning a Tesla: buy a house. Very reasonable solution for the overwhelming majority of the population that lives in apartments.",
        "author": "None",
        "score": 19
    },
    {
        "comment": "PHEVs solved most of that issue and are much more palatable to the average 1 car household. As well as those who rent, street park, or regularly spend time outside of developed areas. 95% of trips would run on EV for those who have access to charging, but if you don't then it doesn't matter: you can still get in and go. Same goes for people who regularly tow their toys on the weekend. \n\nPure EVs, in their current form, favor suburban homeowners who own their ability to charge and most own a second ICE vehicle. I think this will change over time but I am still suspect of 100% market adoption: I roughly see ~50% EV, 40% PHEV, the rest some mix of biodiesel, hydrogen, etc for specialized purposes.",
        "author": "xarune",
        "score": 11
    },
    {
        "comment": "> The average consumer certainly doesn't need that.\n\nRight? The average consumer *bladder* also can't even do that. Hell, the average consumer knees, hips and lower backs need to stop more often than that.",
        "author": "trevize1138",
        "score": 11
    },
    {
        "comment": "People like me are far from a majority of the market, but are over represented in new car sales. From Dec-April I tend to go skiing 1-3x a week, my ski hill is  75 miles from here. That means on a winter weekend my vehicle needs to be able to do 300 miles (back to back day trips in below freezing weather and I rent so no home charging. On top of that they close the roads 2-3 times a year and people get stuck for the night in the mountains so having the ability to have your vehicle keep warm is pretty desirable. Not everyone skis, but it is a decently represented group in west coast urban areas.\n\nIn the summer it isn't uncommon for me to do a 300 mile weekend trip so somewhere in the middle of no where to camp and bike. So far sedans are doing that range okay, but larger more capable vehicles are struggling due to weight/aero. \n\nAll that said, in a 2 car household an EV makes a ton of sense. I see PHEVs taking up a large share in the market since you can EV 95% of the time but when you need to have an ICE vehicle you don't have to jump through any hoops. My next daily will likely be a PHEV Tacoma, Tundra, or F-150 that supports at least 20 miles of EV range when they become available.",
        "author": "xarune",
        "score": 7
    },
    {
        "comment": "Not fun doing that and getting a complete POS car for your road trip",
        "author": "2CHINZZZ",
        "score": 5
    },
    {
        "comment": "People generally care more about their cars than their phones",
        "author": "Prestigious-Fly4248",
        "score": 9
    },
    {
        "comment": "Horse drawn carriages weren't banned here in Chicago until January 1st, 2021.\n\nHorses aren't viewed today as crude, dirty, unreliable, annoying things; it's still cool to ride on horseback, like out at the woods or something, just extremely impractical.\n\nWhen electric cars start coming up for sale on the used market in droves for under $2,000, THEN they will be easier to use overall for *everybody* in the population (i.e. not just the upper and upper middle class). But until that day comes... And then there's the charging situation. Many people (in Chicago at least) live in REALLY old two-flat apartments, with no garage. These were built anywhere between 1865 and 1920, and they won't be able to support the electrical load of charging multiple families' cars at once. There will need to be electric stations, similar to gas stations of today, where you can pay a small fee to charge your car, and you can also buy chips, fountain drinks, lottery tickets, etc. that can *fully* charge a car in the same amount of time (or less) than our current gas stations. \n\nBut banning them is something entirely different. Like I said, it's not going to happen in our lifetimes, or our children's life times. Possibly not even their children's. See the horse drawn carriage example above.",
        "author": "None",
        "score": 7
    },
    {
        "comment": "Lol “denigrating”? I’m not insulting a group of people here. I’m allowed to express my personal opinion that electric cars aren’t as fun. Just like you can express the opposite opinion.",
        "author": "Umbra427",
        "score": 19
    },
    {
        "comment": "People can still ride horses though. Even aside from that, I’m not sure it’s the best comparison.  They’re trying to kill the gas powered car.\n\nAm I supposed to be consoled that my hobby is essentially undergoing a massive disruption, just because of some analogical situation that happened 110 years ago? It doesn’t make this suck any less.",
        "author": "Umbra427",
        "score": 16
    },
    {
        "comment": "Why though? Because it’s practical? Or because it’s fun?",
        "author": "Umbra427",
        "score": 5
    },
    {
        "comment": "I am an architect and we are oversizing all our new panels just for this eventuality.  Unfortunately, not everyone builds a new house and, you're right, it is a large investment of both time and money to upgrade things like that.  I have seen some stealing of 220V dryer circuits for car chargers, but again, not always possible.  \n\nAs the energy code shifts more of our appliances and building mechanics onto the electrical grid, the only proactive infrastructure investment I've seen is the requirement for on-site solar panels or buy ins into commercial ventures.  But that only helps with new construction; not existing.  And it certainly doesn't help defray development costs in a state that already has huge bureaucratic roadblocks and a grave housing shortage.",
        "author": "wholegrainoats44",
        "score": 7
    },
    {
        "comment": "Aren't most of the governments that are \"banning the sale of ICE powered cars\" in 15 years still allowing hybrids or at least plug in hybrids?",
        "author": "BigCountry76",
        "score": 17
    },
    {
        "comment": "I'll take my downvotes for this, but yes it's gonna happen.\n\nSource: an engineer who's worked in both ICE development and now the EV industry.",
        "author": "kowalski71",
        "score": 22
    },
    {
        "comment": "The last 100 yrs of innovation will continue with EVs: aerodynamics, chassis, suspension, electronics, etc.",
        "author": "ikkkkkkkky",
        "score": 6
    },
    {
        "comment": "I don't understand? \n\nIs there an electric motor comparable to the Chevy V8 SBC that can move the commercial vehicles i work with (mostly box trucks and vans)?\n\n Most of these \"Classic\" V8 designed motors are being employed in situations where reliability and hauling is of most concern. Its a proven design and is easy to maintain for fleets. There are a ton of parts available and people know how to work on them.\n\nUntil tech is to the point where these issues are solved, New vehicles are chosen based on the most cost effective solution.",
        "author": "acideater",
        "score": 6
    },
    {
        "comment": "You havent been paying attention to the stonks? 🚀🚀🚀",
        "author": "Raving_107",
        "score": 9
    },
    {
        "comment": "15 years isn't exactly soon. 15 years ago the iPhone didn't even exist.",
        "author": "Stankia",
        "score": 16
    },
    {
        "comment": "Generally the ICE bans already encompass standalone ICE vehicles - Japan's \"EV only from 2030\" for example includes PHEV and Hybrids as EVs (and a lot of reporting on market share bundles those all together). \n\nRealistically it makes sense, since by 2030 pure EV prices will normalise compared to hybrid probably somewhere around where Hybrids are today relative to standalone ICE cars, and Hybrids will be the de facto standard, with global market share probably split somewhere around 40-55-5 in favour of Hybrids with a couple of ICE niches still in play - at that point, vehicle emissions will likely be low enough that further restriction is less useful and probably will already trend downwards from there without regulation of the type we've seen from Euro VI or VII, which are already largely responsible for kickstarting mass EV (including hybrid and PHEV) adoption.",
        "author": "Car-face",
        "score": 10
    },
    {
        "comment": "My city installed charging ports on every single block. All of the restaurants are also installing them in their parking lots. All of the new condo construction includes chargers in the parking garages as well. It started a couple years ago.",
        "author": "Vap3Th3B35t",
        "score": 6
    },
    {
        "comment": "No way will California be able maintain its population in 15 years. With the housing crisis there and the high cost of living the mass exodus will continue to happen.",
        "author": "SecretAntWorshiper",
        "score": 8
    },
    {
        "comment": "That’s a lot of consumer demand for gasoline.",
        "author": "ritchie70",
        "score": 16
    },
    {
        "comment": "Electric cars also have close to zero maintenance. That's thousands and thousands of dollars over the lifetime of the car + time + money not spent on fuel.\n\n&#x200B;\n\nMany people are unfortunately fools and they only look at the monthly loan cost without seeing how much insurance, gas, maintenance will cost.",
        "author": "PorscheBoxsterS",
        "score": 9
    },
    {
        "comment": "You're right with that. EV charging will never be as quick as gassing up.\n\n&#x200B;\n\nHowever, there can be certain lower volume solutions. For example, NIO is running a successful subscription based service that swaps batteries in 5 minutes. The idea is that you don't pay for the battery in your car (so that cost is subtracted out of purchase) and pay monthly for a battery swap.",
        "author": "PorscheBoxsterS",
        "score": 5
    },
    {
        "comment": "The other major EV hurdle is going to be cold climate winters. Batteries hate the cold and it tanks range, along with the drain of trying to heat the cabin. Until that hurdle is solved, that's going to hinder mass EV adoption for a large part of the world as well.",
        "author": "velociraptorfarmer",
        "score": 14
    },
    {
        "comment": "Gas is only cheap because it’s very very heavily subsidized. If that changed electric would be a no-brainer",
        "author": "beavismagnum",
        "score": 6
    },
    {
        "comment": "You have to extract metals from the earth to make a battery. Then that battery does it thing without any extra physical materials added to it for hundreds of thousands of miles (and over a million miles with Tesla's newest battery production line). It's a completely different resource demand compared to oil where you have to constantly extract it to keep cars running. I don't have to dump more lithium and cobalt into my car every 300 miles.\n\nPlus, there are ways to extract those materials from old batteries and build new batteries out of them. And if you have a car with a million mile battery pack in it but the frame rusts away after 500k miles that battery pack can be used in a different vehicle or large grid energy storage.\n\nAny time you're manufacturing something you need to mine for materials. The materials needed for batteries are just a far smarter way to utilize the raw material. You can use canvas to paint on. You can also burn the Mona Lisa for warmth in a camp fire. The former is a smarter use of resources. The latter is a huge waste.",
        "author": "trevize1138",
        "score": 6
    },
    {
        "comment": "And getting more expensive",
        "author": "No_U_Crazy",
        "score": 9
    },
    {
        "comment": "I bought a bicycle once for $150 ... \n\nThe topic is GM no longer selling *brand new* ICE vehicles. Comparing new vehicle prices to used vehicle prices is disingenuous at best.",
        "author": "trevize1138",
        "score": 7
    },
    {
        "comment": "The original Volt had a lot of issues in regards to passenger and cargo space. Sure, it looked like a regular car on the outside, but remember they basically had to cram in two complete drivetrains, at a time when batteries weren't exactly known for being small (they still aren't, but they wouldn't need as many now for the same capacity). The original was a four-seater, and the cargo area had a high load floor.",
        "author": "Snoo74401",
        "score": 7
    },
    {
        "comment": "But everyone likes to claim that they CAN tow. Just like the many people who buy a 3 row SUV and never use the 3rd row, a Jeep Rubicon but never take it off road, or a Ford Raptor but never jump even a curb. People look at stats and then go \"but that other model can tow 10,000lbs. Why do I want this one that is better in every other way but only tows 9,995lbs?\"",
        "author": "amd2800barton",
        "score": 28
    },
    {
        "comment": "35k Model 3 no longer exists, and I believe when Tesla did sell it, it was not advertised on their website. You had to actually call Tesla to get it. So yeah, I wouldn't put it past Tesla to do something like that.",
        "author": "MSUconservative",
        "score": 7
    },
    {
        "comment": "is that true? i’m sure it would get a lot of looks, and plenty of people love attention",
        "author": "dontcomeback82",
        "score": 23
    },
    {
        "comment": "I can get past the looks, but not the company passing over QC. It's my biggest concern about the CT.",
        "author": "Alabatman",
        "score": 14
    },
    {
        "comment": "How about \"If Tesla can make a truck for $40k why can't Ford or GM? Why should I buy a brand new truck if it's not EV? I've already got a truck. I'll just wait.\"\n\nNo company can survive on crashing sales and it takes time to ramp up production of a new line.",
        "author": "trevize1138",
        "score": 10
    },
    {
        "comment": "Total cost of ownership is still higher for the model 3 you have to do Enron level accounting to make it come out differently.  My reply was simply that fuel costs for electric are cheaper than gas cars.",
        "author": "jimbolauski",
        "score": 7
    },
    {
        "comment": "Don’t forget servicing costs too, which are far lower.",
        "author": "justin-8",
        "score": 9
    },
    {
        "comment": "I agree with you. To capture 1-car households and renters or those without garages, there will need to be further developments to EV charging infrastructure and/or reduced charge times. Based on the trajectory of things, that just seems like more a matter of time than anything. States/countries will require charging in homes and apts, as places like CA are already doing, while the tech improves. Fourteen years is a long time. The Tesla Model S has only been around for 9.",
        "author": "NoVA_traveler",
        "score": 6
    },
    {
        "comment": "You may feel very strongly that EV range does not currently fit your driving patterns, but you far overestimate how much the \"average consumer\" has driving patterns like yours.",
        "author": "vinidiot",
        "score": 22
    },
    {
        "comment": "> EV enthusiasts like you always fudge the numbers to make EVs look better than they are.\n\nMeanwhile you're talking about driving 400-500 miles without a bathroom break.",
        "author": "trevize1138",
        "score": 12
    },
    {
        "comment": "> EV enthusiasts like you always fudge the numbers to make EVs look better than they are.  \n\nHey my main argument is that most people have an unrealistic idea of what they actually need. Pre-covid, I did many 1,000+ mile road trips in an 315 mi range Tesla 3, and also occasionally travel for work, so I do have an idea of what I'm talking about.  \n\nI'll be more than honest that if I am trying to drive 1,000 miles as fast as absolutely possible, then current EVs are not going to win that race. I did that once from NoVA to Alabama, and I lost about an hour in total travel time. When I traveled with my family to Maine, we didn't lose any time because my kids can't just sit in a car for 12 hour straight, so we get out every 3 hrs, use the restroom, change the toddler, get a snack, and the car is already past the 80-85% charge threshold before we even get back to it.  \n\nAs far as work travel, my office and most of my clients have EV charging on the premises (which will be the standard everywhere soon enough), so range is not really a consideration. I'm sure there are jobs that are exceptions to the rule, but we're talking about the average person at the moment, so I think the case is already there.   \n\nAnd like you said, EVs will get better so that more and more non-average use cases are covered. At the very least, there is no reason for a 2-car family to not consider an EV for one of their vehicles right now.",
        "author": "NoVA_traveler",
        "score": 17
    },
    {
        "comment": "Whatever happened to \"you just plug the car in when you get home from work?\" Sounds like early evening to me.",
        "author": "WarDEagle",
        "score": 7
    },
    {
        "comment": "They never will be. Electric is so different and so inconvenient, especially as mechanics or handymen. I don't think an update should be able to just brick your car, or make it faster. I wanna know how it makes more horses.",
        "author": "DOugdimmadab1337",
        "score": 12
    },
    {
        "comment": "Yes they are. They are still allowing all types hybirds",
        "author": "SecretAntWorshiper",
        "score": 13
    },
    {
        "comment": "That’s not what anybody said.",
        "author": "LonelyDoomGuy",
        "score": 5
    },
    {
        "comment": "Facebook and Reddit started 15 years ago too. Social media wasn't a thing back then. Alot of time for change",
        "author": "SecretAntWorshiper",
        "score": 7
    },
    {
        "comment": "I was reading ARK Invest's Big Ideas report this week and their model has a 350 mi range EV reaching sticker price parity with a $26k Toyota Camry by 2023, while being much less by 2025. That's soon.",
        "author": "NoVA_traveler",
        "score": 7
    },
    {
        "comment": "Eh, California's loss of companies is fairly healthy. People go there, learn skills, work at big tech companies, and then go start businesses all around the country. That's a great thing. Not everyone wants or needs to live in a high cost of living place. In fact, the very factors that make California difficult to live in demonstrate that it's not really in decline at all. It may not be growing wildly anymore, but it's still growing in gdp and population.",
        "author": "NoVA_traveler",
        "score": 7
    },
    {
        "comment": ">Plus, there are ways to extract those materials from old batteries and build new batteries out of them.\n\nEspecially if that's a design criteria going in to making the batteries.",
        "author": "ritchie70",
        "score": 5
    },
    {
        "comment": "the topic that i replied to was an average family affording a vehicle.  it is a subset of the conversation.",
        "author": "lostfate2005",
        "score": 5
    },
    {
        "comment": "I rode in the Cadillac version and the back seat was strange because of the battery.,",
        "author": "mark-five",
        "score": 8
    },
    {
        "comment": "Good point. People are already switching from luxury f150s to f250s lol.",
        "author": "beavismagnum",
        "score": 12
    },
    {
        "comment": "Wouldn't it be cheaper to just paint dicks on you car?",
        "author": "jimbolauski",
        "score": 16
    },
    {
        "comment": "Can't mess up panel gap if the body is folded origami.\n\nI have 2 Teslas.  Your biggest concern should be warranty.  The company is dishonest and shitty when it comes to service.  If you need your cybertruck for work, forget it - uber credits are how they handle loaners now (During Covid.  Seriously!).  Picture loading tools or a bed full of gravel into an Uber.",
        "author": "mark-five",
        "score": 16
    },
    {
        "comment": "Are they, though? What are these additional service costs? Most cars these days don’t call for a coolant or transmission fluid change until 90-100k miles. Same goes for serpentine belts and spark plugs. For the first 5-7 years of ownership, most economy cars sold today only require oil changes.",
        "author": "None",
        "score": 10
    },
    {
        "comment": "And a whole lot more that don't. And plenty of people living in less-than-ideal conditions where they can barely afford a 20-year-old ICE car, parked on the street, and they're not going to be able to adopt the EV lifestyle.",
        "author": "UberSquelch",
        "score": 14
    },
    {
        "comment": "Many of the developed ski hills with large basses may (CO, UT) but most of the Pacific Northwest ones ones are just day trip locations and have minimal development. I just did a quick check of the Seattle area ski spots:\n\nCrystal Mountain: has RV shore power you can theoretically use for $10 if there is no RV in the spot. But every weekend day of the ski season is fully booked for RVs. So functionally 0 there.\n\nStevens Pass: 2 plugs.\n\nSummit at Snoqualmie: 3 plugs at the hill, 2 at a gas station.\n\nMt. Baker: 0\n\nChargers may be cheap to install, but a lot of these places don't have the electrical infrastructure to support that much power currently: some have to kick on the generators for big storms. Not to mention the chargers make clearing the rudimentary dirt parking lots a lot harder for these places so I don't expect rows on rows of chargers. The Model 3 can do the trip, but people get trapped at most of these places 2-3 times a year due to snow, ice storms, blowdowns, or mud slides and have to spend 6+hrs to the whole night in their vehicles and the heating would burn down the batteries a lot faster than a full tank of gas idling. I do see Teslas at the locations, but far less on storm days which tend to be the best for skiing.\n\nI'm not against EVs, but 100% EVs still has some massive hurdles and the EV vs ICE war seems to ignore the compromise that gives the majority of drivers the best of both: PHEVs.",
        "author": "xarune",
        "score": 5
    },
    {
        "comment": "Point taken, I get what you’re saying, it sounds like you took it a little personally, and I didn’t mean for it to come off that way so I apologize.  I didn’t mean to say that your car is soulless or even that your affinity for your car is unwarranted in any way. My only point is that electric cars are lacking in qualities that I find subjectively exciting and that are therefore important to me on a personal level",
        "author": "Umbra427",
        "score": 7
    },
    {
        "comment": "Honestly, a mechanic or handyman would probably much rather work on an electric car. No timing belts. No valves. No exhaust leaks. No vacuum line leaks. No bad gas. No running rich or lean or fouling plugs...  it's just a motor, gearbox of some sorts, battery and a conrrol unit.",
        "author": "ctennessen",
        "score": 21
    },
    {
        "comment": "“Inconvenient” because you don’t understand it. I’m sure people with horses called cars Inconvenient because “hay was easier to find than gas”. Times are changing.",
        "author": "JohnDoee94",
        "score": 12
    },
    {
        "comment": "It's not inconvenient though. It's actually more convenient unless you exclusively do road trips. Literally never have to go to the gas station, very little maintenance, instant torque. \n\nAnd not every EV is a tesla with constant updates. \n\nIf you can't see that EVs and potentially hydrogen vehicles are the future I'm not sure what you're seeing. I'm never going back to an ICE Car, they just suck.",
        "author": "conman526",
        "score": 11
    },
    {
        "comment": "You wont own your future EV, you will lease it from the manufacturer and the value of that lease will float with demand and availability. When the batteries are kaput, the manufacturer will send them offshore for recycling, away from pesky 1st world environmental oversight.",
        "author": "None",
        "score": 6
    },
    {
        "comment": "You’ll only regret it once it’s happened and nothing can be done about it",
        "author": "Class_444_SWR",
        "score": 8
    },
    {
        "comment": "I'm interested to know what they mean by \"like-for-like\" but can't see it in their report - a 350mi Leaf competitor being the same price as a camry is less impressive than a 350mi EV Camry replacement having the same sticker price, even if the range is the same.\n\nUsing Wright's Law seems to not take into account bottlenecks to production and supply that could drive price up too, particularly considering the increase in volume they're using in their model (a 20-fold increase in EV sales from 2020 to 2025 from 2.2 million to 40 million units) - I definitely think EVs will hit price parity, but 2023 is within the lifespan of many current EVs, and I can't see actual MSRP diving that much (I could easily be wrong though). Time will tell, 2023 is definitely not too far away (and the rest of the report looks interesting too!)",
        "author": "Car-face",
        "score": 5
    },
    {
        "comment": "The comment was about infrastructure which will be more expensive and have more red tape to work around in California, not about emissions standards.",
        "author": "None",
        "score": 7
    },
    {
        "comment": "If you compare a Tesla to a Camry, sure. If you compare it to a 3 series or other car of the same price segment, no definitely not.\n\nWe’ll see models that compete with cheaper ICE before too long. Lightly Used EVs do compete with a new economy car. Only a matter of time and investments.",
        "author": "ErectricCars2",
        "score": 7
    },
    {
        "comment": "Ahhh, yes, the ELR. It was beautifully styled, but a time when coupes were already out of fashion, that was kind of a head-scratcher. Also, the 70K price at a time when the Tesla Model S could be had for essentially the same price, but with way more street cred, the ELR was doomed before it even hit showrooms.",
        "author": "Snoo74401",
        "score": 11
    },
    {
        "comment": "Yeah. I really like the convertible bed nature of the design, but the no independent shops and no source for parts to repair it yourself bug me too.\n\nI'm hoping Ford knocks it out of the park with their option, but the CT vault is an attractive feature.",
        "author": "Alabatman",
        "score": 7
    },
    {
        "comment": "This doesn't seem like an inherent issue with the concept of car rentals, rather a specific company offering a poor service.",
        "author": "Bojarow",
        "score": 7
    },
    {
        "comment": "dude my sled gets 3 mpg (OG transmission is pretty clapped out haha) I cannot WAIT for more accessible EV crate kits. I mean, I'm going to swap in a better drivetrain in the meantime but one day...\n\nIt makes perfect sense for classic cars because they don't need to go very fast. Or very far.",
        "author": "Trevski",
        "score": 7
    },
    {
        "comment": "And what do mechanics hate most? Wiring. I'd be alot more confident rewiring a fault in an ICE car than I would be rewiring a wheel motor or literally any other possible fail in an EV. Although EV's should be more reliable, if there is a fault I don't want to have to bring it to the dealer and pay out the ass to fix it everytime. I'm all in favour of EV's, I just don't trust car manufacturers to make it easy for us to do any possible work ourselves.",
        "author": "jackm5678",
        "score": 10
    },
    {
        "comment": "You're right, but on the other hand, ICEs have the potential to outstrip any and all sources of grid power for efficiency (or cost-effectiveness, in the case of renewables) on a realistic timescale. Even at the moment, the simulated Atkinson-cycle engines that Honda and Toyota are putting in some of their hybrids are pushing 45% Carnot efficiency. With technologies like Mazda's HCCI, numerous camless valve technologies starting to come into maturity, and the relatively fledgling abilities of AI CFD design and high-strength, high-temp additive manufacturing allowing for much more effective chamber and manifold designs, we could be seeing ICEs that run at electric motor-like efficiencies without the power grid demand comfortably within the next 50 years.",
        "author": "Cessnaporsche01",
        "score": 7
    },
    {
        "comment": "Except Diesel runs the mines, Diesel runs the Shipping, Diesel runs the cargo boats, Diesel runs everything that shipped your \"zero emission\" car to you. Diesel runs this world. Batteries are still way too heavy to be practical, or even get anywhere near where a normal car can go.",
        "author": "DOugdimmadab1337",
        "score": 9
    },
    {
        "comment": "So more of the same as today, let the customer feel good about there illusion of choice, but this time lets pretend to be environmentally friendly. Never mind the plastics and metals still associated with the vehicles.",
        "author": "None",
        "score": 6
    },
    {
        "comment": "You can't repair it if you have the parts any way.  I had a door handle replaced last month and they had to program it to vin match my car with a special computer.  The door handle.",
        "author": "mark-five",
        "score": 8
    },
    {
        "comment": "I'll visit 5 cities and will need to drive from one city to another in the afternoon/evening. It wouldn't be feasible by plane. It would also be at least twice as expensive.",
        "author": "None",
        "score": 5
    },
    {
        "comment": "You see though it’s not really mechanics who work on electric cars, it’s more or less electricians or computer engineers",
        "author": "Frondeur-",
        "score": 7
    },
    {
        "comment": "Well if you approach it with that attitude... lol.   How do mechanics learn?  Training and practice. A mechanic/technician in 2040 isn't going to be trained on choosing which jets they need for a new carburetor",
        "author": "ctennessen",
        "score": 6
    },
    {
        "comment": "just like feeding and keeping a horse, it will get more expensive when normies stop doing it.",
        "author": "Rreptillian",
        "score": 14
    },
    {
        "comment": "And what fuel would you run these engines off of at those efficiencies? I feel like you are ignoring the carbon dioxide issue. Greening grid = lower and lower carbon footprint EVs. How do you plan to accomplish this at scale with ICE?",
        "author": "None",
        "score": 5
    },
    {
        "comment": "50 years is a really long time. Enough time for EVs to be way better than they are today and most, if not all, of their inconveniences gone.\n\n45% efficiency is amazing for ICE but pretty bad for EV.",
        "author": "None",
        "score": 13
    },
    {
        "comment": "Very, very, very wrong.  You'll see.",
        "author": "maveric101",
        "score": 6
    },
    {
        "comment": "This is why there are companies working on hydrogen fuel cells instead of electric power.\n\nHydrogen is available as a typical fuel and is better suited to long distance shipping than electricity. This is entirely why I *really* hope Nikola is able to turn around some of their bad press and actually make a product. \n\nThat being said, there is data that supports a cleaner atmosphere in regards to a radical shift to the consumer transportation industry (March - April 2020).",
        "author": "xamdou",
        "score": 7
    },
    {
        "comment": "Are we talking about LNG tankers or are we talking about passenger vehicles. You're in r/Cars not r/FreightShipping\n\n>Batteries are still way too heavy to be practical, or even get anywhere near where a normal car can go.\n\nYou really think at the rate we're advancing that either of these things will be an issue in 15 years? Hell, I give it till 2025 where an ICE and EV powerplant weigh the same.",
        "author": "None",
        "score": 6
    },
    {
        "comment": "That's exactly what a subsidy is, doesn't have to be a direct payment. Negative externalities are costs of using the product and if they're nor priced in they're subsidized by the taxpayers. This sort of accounting is not controversial in economics, and it's essentially the subject of the 2018 economics Nobel prize. \n\nIf you think the IMF is bullshit I don't know what to tell you, it's a very reliable source for this sort of analysis.",
        "author": "beavismagnum",
        "score": 5
    },
    {
        "comment": "That's... that's just sad. I know things are changing, and I'm not looking for something I can turn a wrench on every weekend, but not being able to do a simple part swap just stinks.",
        "author": "Alabatman",
        "score": 8
    },
    {
        "comment": "And that's why GM is talking about stop selling ICE cars in 2035, not in 2021.",
        "author": "Garrosh",
        "score": 5
    }
]