[
    {
        "comment": "As time has proven you can pretty much say whatever you want as long as it's 10+ years away. \n\nI don't doubt everything will *at least* be a mild hybrid, but there's no way the ICE is dead in 2035.",
        "sentiment": "NEGATIVE",
        "score": 0.8458722233772278
    },
    {
        "comment": "That's okay, I bet Dodge will still have insane V8s going into their entire lineup at that time still lol.",
        "sentiment": "POSITIVE",
        "score": 0.9757444858551025
    },
    {
        "comment": "They can say whatever they want, no ones going to hold them to it in 10 years when they’re still selling ICE’s.",
        "sentiment": "NEGATIVE",
        "score": 0.9966806769371033
    },
    {
        "comment": "I figure the moment that Ford figures out how to sell an all-electric F150 for less than $35k, that'll be all she wrote for most consumer internal combustion in the U.S.",
        "sentiment": "NEGATIVE",
        "score": 0.9994379878044128
    },
    {
        "comment": "Unfortunately, it’s mostly electric Chevettes.",
        "sentiment": "NEGATIVE",
        "score": 0.9990886449813843
    },
    {
        "comment": "Just saw a picture of a guy with a Chevy emblem shaped confederate flag tattoo on his arm. I’d love to hear his opinions on this",
        "sentiment": "POSITIVE",
        "score": 0.9990836381912231
    },
    {
        "comment": "Sure hope they find a way to combat the -40c temperatures in manitoba before then. Or we are gonna see alot more sleds on the commute",
        "sentiment": "NEGATIVE",
        "score": 0.9965757727622986
    },
    {
        "comment": "lmao okay. \n\nI'll believe this when the charging infrastructure is there\n\nAnd the maintenance infrastructure\n\nAnd the actual car development infrastructure.",
        "sentiment": "POSITIVE",
        "score": 0.9992726445198059
    },
    {
        "comment": "No suprise here. We'll see this sort of announcement with every car maker in the near future and I'm totally okay with this. It is the future. My next daily will be an EV.\nNevertheless I just hope I will be able to drive my ICE cars at least a few thousand kilometers a year even in the 2030s.",
        "sentiment": "POSITIVE",
        "score": 0.9994434714317322
    },
    {
        "comment": "Sure, by 2025 they will say 2045, whatever",
        "sentiment": "NEGATIVE",
        "score": 0.9467464089393616
    },
    {
        "comment": "Real question here, I'm not trolling but I'm not sure if this is better asked on a science sub. \n\nIf every new car sold by every manufacturer in 10 year's time was fully electric, and a good proportion of the energy sources were renewable/carbon neutral, what actual tangible effect would that have on global warming? Are we talking reversing, slowing down, maintaining the same rate, or still accelerating but slightly less? \n\nSome say we've passed the point of no return decades ago, and that the current level of CO2 in the atmosphere will continue to warm the planet to disastrous levels even if all manmade greenhouse gas emissions stopped overnight.\n\nIf this is all for naught or too little too late, then I'm struggling to see much of the point of announcing an ICE ban some years in the future other than trying to garner good publicity and provide a false sense of hope.\n\nI'm not even going to mention the enthusiast perspective and nostalgia towards the combustion engine, because that alone has no sway in dictating the direction of the market or policies.",
        "sentiment": "NEGATIVE",
        "score": 0.9996439218521118
    },
    {
        "comment": "It won’t happen without a big jump in battery technology (not to mention infrastructure for charging) which is unlikely unless room temperature superconductors are used which will jump the costs. Trucks are super profitable and most pickups are not cheap, $40K and up being common, so they might be killing a market. Work trucks (3/4 ton and above) need to carry weight for long distances each day. I cannot see a dump truck driver stopping to charge 2-3X a day and delivering less loads and earning less pay. So saying 100% of vehicles seems more PR than reality.",
        "sentiment": "NEGATIVE",
        "score": 0.9980016350746155
    },
    {
        "comment": "Independent of the reasons they’re doing this, I get it, climate change, blah blah, this is a huge gut punch to most car people. We all kind of know its coming, but the replacement of everything we love about cars with soulless, sterile, electric cars is a very difficult thing to accept.",
        "sentiment": "NEGATIVE",
        "score": 0.9950700998306274
    },
    {
        "comment": "Coincidentally California will only sell electric cars by 2035.\n\nI am not sure what the sales numbers per state are but it looks like they think California is so important they'd go all electric.\n\nWould be fun to see an electric spiritual successor to the Corvette.",
        "sentiment": "POSITIVE",
        "score": 0.9649085402488708
    },
    {
        "comment": "Unless they find a better source than Lithium Ion for batteries this really isn't going to help anything.   We are still depleting a limited resource.  Harder to mine and more limited.  Alternative fuels such as hydrogen would be a better focus.",
        "sentiment": "NEGATIVE",
        "score": 0.9995325803756714
    },
    {
        "comment": "So long LS V8 powered everything.  Yeah right.",
        "sentiment": "POSITIVE",
        "score": 0.997448205947876
    },
    {
        "comment": "Yeah if you actually read that California legislation, it still allows for hybrid, plug in hybrid and even mild hybrid cars. It just doesn’t allow for purely gasoline cars",
        "sentiment": "NEGATIVE",
        "score": 0.9889233112335205
    },
    {
        "comment": "Imo. These kinda announcements are just a attempt to boost the stock price since tesla is so overvalued. Gm doesn’t give a damn about climate change and has no intention of sticking to a random announcement they made 15 years ago.",
        "sentiment": "NEGATIVE",
        "score": 0.9994664788246155
    },
    {
        "comment": "Of course ICE won’t be dead in 10-15 years. Just that it’ll be far harder to buy a _new_ car with an ICE then.",
        "sentiment": "NEGATIVE",
        "score": 0.9990291595458984
    },
    {
        "comment": "With how fast battery tech is advancing? 2035-40 is quite reasonable.\n\n2035 is 14 years from now. 2007 was 14 years ago. Look at how much the EV landscape changed in that time frame. Remember, the first Nissan Leaf came out in 2010 and the Tesla Model S entered production in 2012.",
        "sentiment": "NEGATIVE",
        "score": 0.7596097588539124
    },
    {
        "comment": "15 years ago, the concept of iPhone and everything at the palm on your hand is absurd. \n\nNow, iPhone and Android is so boring and commonplace that it's hard to imagine a world without them. \n\nBy 2012 no one is buying blackberry because they were so outdated even though iPhobe was only introduced 5 years ago. \n\nWhen $25K Model 2 and $40k Cybertruck is widely available by 2025, few people in their right mind will want to buy comparables priced ICE cars which has worse specs and much higher operating cost. \n\nTechnology changes fast. 2035 100% new EV is not only possible but probable.",
        "sentiment": "NEGATIVE",
        "score": 0.9896117448806763
    },
    {
        "comment": "Battery tech is advancing pretty damned quickly. If the solid state batteries due next year are really what they're cracked up to be (and it seems most automakers now agree they're incoming), ICE is dead in eight years, not fifteen.",
        "sentiment": "NEGATIVE",
        "score": 0.994025468826294
    },
    {
        "comment": "Japan and england banned the sale of ICE cars after 2030. Some countries have it earlier and others later. You will be able to buy ice cars used tho.",
        "sentiment": "NEGATIVE",
        "score": 0.9280206561088562
    },
    {
        "comment": ">but there's no way the ICE is dead in 2035.\n\nCalifornia says they will stop selling 2035, it's most likely related to that.",
        "sentiment": "NEGATIVE",
        "score": 0.9983524084091187
    },
    {
        "comment": "Hellcat Caravan.",
        "sentiment": "NEGATIVE",
        "score": 0.9805042743682861
    },
    {
        "comment": "In related news, Dodge has announced the minimum number of cylinders in their cars will be 8 by the year 2035. Hellcat variants will be the entry level to all their vehicles.",
        "sentiment": "POSITIVE",
        "score": 0.9790468811988831
    },
    {
        "comment": ">I figure the moment that Ford figures out how to sell an all-electric F150 for less than $35k\n\nThat's a tough one to achieve, considering gasoline F-150's rarely go under $35k lol",
        "sentiment": "NEGATIVE",
        "score": 0.9992223978042603
    },
    {
        "comment": "Ok but electrified malaise era heaps would slap so hard",
        "sentiment": "NEGATIVE",
        "score": 0.9976980090141296
    },
    {
        "comment": "As a saskie people already ride their sleds quads and trikes to school",
        "sentiment": "NEGATIVE",
        "score": 0.9970123767852783
    },
    {
        "comment": "My .02 is you’ll be able to drive your ICE cars for a long time - well past the 2030s. (I personally won’t go back to an ICE car for a daily, unless I come up with the money to buy a special weekend car. EV tech is solid now, and only getting better). But it’s still only the beginning in the big scope of things, and many people refuse to change. \n\nI think there’s a possibility for insurance premiums to go up if driverless tech really becomes reliable and widespread, and cars that are fully human controlled become more of a “hazard” in their eyes, but I think such a time is quite a while away, at minimum due to all the regulations that would go through. \n\nI also think there’s a possibility that you may see a slight rise in gas prices by then simply as there’s less demand. But at the end of the day, EV sales are only about 2-3% of all car sales still... ICE cars being sold on the road today will still be around en masse for 15 years or more in most cases (look at all the 2005 Camrys going around).",
        "sentiment": "NEGATIVE",
        "score": 0.9943833351135254
    },
    {
        "comment": "I can't answer your question. But I will say that you need to consider that global warming isn't the only issue with ICE cars. A big thing is \n local pollution. If every car in your city was suddenly an EV, air quality would improve drastically. Moving towards EVs will be a big step towards that.",
        "sentiment": "POSITIVE",
        "score": 0.9761838912963867
    },
    {
        "comment": "We're already seeing effects of climate change due to greenhouse emissions. It will get worse. However, if humanity just gives up on slowing down emissions then the outcome will be even worse than it is already predicted to be.\n\nRight now, we can still limit the increase in earth's temperature to below 2 degrees celcius if we can make significant strides towards carbon neutrality by 2035.\n\nWhy is 2 degrees the big target? Well at and beyond 2 degrees, things get a whole lot worse. We're talking not only catastrophic damage to our planet, but massive social and economic damage as well.\n\nI think theres a filter that prevents me from sharing the link, but you can google NASA's report called \"A Degree of Concern: Why Global Temperatures Matter\" which will summarize the effects of reaching a 2 degree increase in reference to the UN's climate change council (IPCC)'s report",
        "sentiment": "NEGATIVE",
        "score": 0.9988952875137329
    },
    {
        "comment": "It's not even climate change.     \n    \nFor me, it's all about $0.70/gallon equivalent for instant torque, no transmission and never going to a gas station again. The fact that it's possible to create electricity from renewable sources is neat, but not exciting.     \n    \nI feel like most people vastly underestimate the phrase \"instant torque\" until they experience it. I think anybody that has ever hated on automatic transmissions needs to test drive an EV.",
        "sentiment": "NEGATIVE",
        "score": 0.998132050037384
    },
    {
        "comment": "> We all kind of know its coming, but the replacement of everything we love about cars with soulless, sterile, electric cars is a very difficult thing to accept.  \n\nFor my 2 cents, I'd lament the loss of what you love about gas cars rather than criticizing electric cars. I have one of each. I much prefer driving the EV from a driving experience perspective.",
        "sentiment": "NEGATIVE",
        "score": 0.9856632351875305
    },
    {
        "comment": "It’ll be 100 years from now and GM will still offer 350 SBC and LS crate motors, because if you’re going to keep making an engine from the 50’s, you may as well do it forever",
        "sentiment": "POSITIVE",
        "score": 0.9956579208374023
    },
    {
        "comment": "Now THAT feels much more realistic. Hybrids are the perfect solution.",
        "sentiment": "POSITIVE",
        "score": 0.9988024234771729
    },
    {
        "comment": "GM just mad about GME",
        "sentiment": "NEGATIVE",
        "score": 0.9996263980865479
    },
    {
        "comment": "Everything is always about the stock market with big corporations. Not only does everyone want some of that Tesla Money™, but they also want to be viewed as a leader in the segment.\n\nLet's not forget that they politically fought any sort of more efficient vehicle energy reform up until this month.",
        "sentiment": "POSITIVE",
        "score": 0.8747533559799194
    },
    {
        "comment": "> Imo. These kinda announcements are just a attempt to boost the stock price since tesla is so overvalued.  \n\nI think it's meant to do something slightly different actually. The problem with legacy auto and EVs is that the transition will necessarily be painful because you have to still make money while funding and getting consumers to buy the new technology. VW is the only big auto to really take that challenge on. So what GM is doing here is using it's major market position to signal to the rest of the industry that 2035 is the date we're all going to quit ICE and go to EVs, which protects them from the risk of having to convince consumers on their own. It also tells legislators to set that as a realistic date to ban the sale of new ICE, further protecting them from negative economics. If you look at existing ICE bans, the UK and other EU countries have already set 2030 as the date, while CA has set 2035. GM sees the writing on the wall and is trying to seize a leadership role.     \n\nTesla doesn't have to worry about any of this because they don't have a legacy ICE business to manage, nor do they need to worry about investors expecting dividends.",
        "sentiment": "NEGATIVE",
        "score": 0.9836980104446411
    },
    {
        "comment": "They’re interested in making money. And I think they recognize that ICE will die in the next couple decades. And the earlier they transition to electric the better position they’ll have in the long run.",
        "sentiment": "NEGATIVE",
        "score": 0.9582304358482361
    },
    {
        "comment": "i bought my prius for 3k.... thats a LOT of gas to get to 25k",
        "sentiment": "NEGATIVE",
        "score": 0.9926767349243164
    },
    {
        "comment": "Doubt, gasoline is too cheap and accessible. Plus people still have deeply entrenched range anxiety, and renters have nowhere to charge there cars at home, which precludes a lot of buyers that don't want to rely on public chargers",
        "sentiment": "NEGATIVE",
        "score": 0.9962338805198669
    },
    {
        "comment": "Battery supply is the constraint. Car manufacturers today can’t supply enough batteries for current demand, this is going to be the major challenge with manufacturers trying to deliver exponential demand for EV’s. Where is all the Lithium going to be sourced for 50x the batteries that are needed today? Where are the going to manufactured?  The Tesla gigafactory that was started in 2014 is still NOT fully operational because of supply issues. Lithium mining is extremely impactful on the environment and it will need to be increased 50 fold in order to supply all the world with EVs instead of ICE. \nThe amount of energy the world consumes to power vehicles is astronomical and the supply chain to deliver oil and gas is the most complex logistics system in the world.  \nThe only way we move to EVs by 2035 is if the world is ready to commit tens of trillions of dollars in the next decade to replace oil and gas.",
        "sentiment": "NEGATIVE",
        "score": 0.9947518706321716
    },
    {
        "comment": "Any sort of battery tech is useless until that battery tech translates into lower prices on EVs. And by lower I mean accessible to the average family, not an upper middle class one",
        "sentiment": "NEGATIVE",
        "score": 0.9996398687362671
    },
    {
        "comment": "California says a lot of things though, and that's still 14 years ahead of us. Automakers aren't stupid, they know that politicians like to talk big and when it benefits the automakers they'll play along with the politicians.",
        "sentiment": "POSITIVE",
        "score": 0.9995163679122925
    },
    {
        "comment": "Hellcat Fiat 500",
        "sentiment": "NEGATIVE",
        "score": 0.9867478609085083
    },
    {
        "comment": "I probably should have said $40k.",
        "sentiment": "NEGATIVE",
        "score": 0.9984122514724731
    },
    {
        "comment": "I don’t understand how they get their TCO numbers. If you charge your Tesla at a supercharger, it’s way more expensive per mile then gas, and if you charge at home it’s about the same. I’m comparing to my car, a Corolla Hybrid. The only extra cost I have is 3 oil changes a year at $30 each.",
        "sentiment": "NEGATIVE",
        "score": 0.9984082579612732
    },
    {
        "comment": "At least you can keep the heat on while charging in EVs. Of course that will then make the charging take even longer...",
        "sentiment": "NEGATIVE",
        "score": 0.9854092001914978
    },
    {
        "comment": "Meh, i really don't give a shit about \"instant torque\" tbh. It's not like the reason I love classic muscle cars is because of their pure performance numbers. I like the way they look but I *love* the sound of a big V8, it brings me back to my childhood when I worked on my dad's vette with him and got to feel it shake the walls on startup - it was fucking badass.\n\nAn electric car will never be able to do that for me.",
        "sentiment": "POSITIVE",
        "score": 0.9046391248703003
    },
    {
        "comment": "Yes, I have. They may be fast but they’re absolutely soulless and the “performance upgrades” are just not the same. No engine sound, no possibility for manual transmissions (although those have been dying for a while anyway). There’s also  no denying that this kills a huge part of car culture in general.",
        "sentiment": "NEGATIVE",
        "score": 0.9995777010917664
    },
    {
        "comment": "Yes, they do have a plan. \n\nThe plan is the state level politicians will have moved on to their federal positions and could not care less about California's infrastructure at that point.",
        "sentiment": "NEGATIVE",
        "score": 0.7085300087928772
    },
    {
        "comment": "Why change a good design? ICE motors still selling and the designed is tested and the parts are available.",
        "sentiment": "POSITIVE",
        "score": 0.9939058423042297
    },
    {
        "comment": "GM is about to turn into GM Electric aka GME",
        "sentiment": "NEGATIVE",
        "score": 0.9849264621734619
    },
    {
        "comment": "> If you look at existing ICE bans, the UK and other EU countries have already set 2030 as the date, while CA has set 2035. \n\nLet's see how this goes.",
        "sentiment": "POSITIVE",
        "score": 0.9866889119148254
    },
    {
        "comment": "The US will actually have to care about and invest in infrastructure to get even close to this.",
        "sentiment": "POSITIVE",
        "score": 0.7961281538009644
    },
    {
        "comment": "1/4 of cars on the road today are 16 years or more old.\n\nThe average fleet age in the US is about 12 years.\n\nThose will probably both increase in the next 15 years.\n\n1/4 of cars on the road in 2035 will be 2018 or earlier models.\n\nThe average fleet year will probably be around 2022 in 2035.",
        "sentiment": "NEGATIVE",
        "score": 0.9661964178085327
    },
    {
        "comment": "lol yeah gas is not going anywhere by 2035.",
        "sentiment": "NEGATIVE",
        "score": 0.9995909333229065
    },
    {
        "comment": "You don't think there will be used EVs in 10 years?",
        "sentiment": "NEGATIVE",
        "score": 0.9932403564453125
    },
    {
        "comment": "> and renters have nowhere to charge there cars at home, \n\nA lot of renter's in cities don't even have a parking spot to leave their car in daily, let alone a place to charge an EV. \n\nImagine how amplified im Boston the space saver madness after a snow storm will be when you also have to compete for a place to charge your car.",
        "sentiment": "NEGATIVE",
        "score": 0.9912623167037964
    },
    {
        "comment": "On the other hand, an electric motor could absolutely put out more torque for towing than a diesel, all instantaneous, given a proper EV truck platform.",
        "sentiment": "NEGATIVE",
        "score": 0.7822356820106506
    },
    {
        "comment": "Batteries now cost around $156 per kilowatt-hour, according to BloombergNEF,  which is an 85% decline from 2010′s $1,100 plus/kWh cost.  $100 per kWh is largely understood to be the price/function parity line with ICE and that number is likely achievable in the next 3 years.  \n\nI expect the purchase of an ICE vehicle in 2030 to be only a choice made by the very wealthy or the extreme fringe use-case.  By 2035, legislation won't even be needed.",
        "sentiment": "NEGATIVE",
        "score": 0.9971768856048584
    },
    {
        "comment": "Dodge Journey to Hell",
        "sentiment": "NEGATIVE",
        "score": 0.9858552813529968
    },
    {
        "comment": "They were actually talking production numbers.\n\n/s",
        "sentiment": "NEGATIVE",
        "score": 0.9910479187965393
    },
    {
        "comment": "It'll be interesting to see how electric pickups are priced out... Gotta imagine that electric motors and EV trannies are super fucking cheap  compared to a 5L engine with a 10-speed automatic\n\nBut then on the other hand if OEM's want EV trucks to tow *at all*, they're going to need enormous batteries.",
        "sentiment": "NEGATIVE",
        "score": 0.9975905418395996
    },
    {
        "comment": "The base price for the Cybertruck is $39,990. Same MSRP plus huge savings on gas and maint. Price parity for a tiny econobox that costs $15-$20k is a serious challenge. Price parity on trucks is far easier. It's a market ripe for the EV picking.",
        "sentiment": "NEGATIVE",
        "score": 0.9868546724319458
    },
    {
        "comment": "I needed a new F150, so I decided to go to Morganville which is what they called Shelbyville in those days. So, I tied an onion to my belt which was the style at the time. Now, to take the ferry cost a nickel. And in those days, nickels had pictures of bumblebees on ‘em. ‘Give me five bees for a quarter,’ you’d say. Now, where were we? Oh, yeah! The important thing was that I had an onion on my belt which was the style at the time. They didn’t have white onions because of the war. The only thing you could get was those big yellow ones.",
        "sentiment": "NEGATIVE",
        "score": 0.9963552951812744
    },
    {
        "comment": "Teslas get 2.5 to 3 miles per KWH, the average KWH cost is $0.13, so it's 4-5 cents per mile.  The breakdowns that show higher cost typically include flat rate delivery fees that the person would pay no matter what.  At $3.00 a gallon and 30 miles per gallon it's 10 cents per mile.  You need $2.00 gasoline and a 40mpg car to match fuel costs.",
        "sentiment": "NEGATIVE",
        "score": 0.997809112071991
    },
    {
        "comment": "if I remember correctly, my dads Model 3 charging at a supercharger is equivalent to paying for gas for a 43 mpge car. and at home its around 100 mpge. these numbers obviously change with gas prices and electricity, but supercharging isn't that bad. my corolla hybrid has gotten 53 mpg over 24,000 miles, so I'm doing better than his supercharging rate, but not much",
        "sentiment": "NEGATIVE",
        "score": 0.9921588897705078
    },
    {
        "comment": "Agreed. It’s not even about stubbornness to give up the ICE: Electric cars are extremely expensive and repairing them is NOT DIY. Many people own older cars because they can fix it themselves and they’re affordable second hand. No one on a minimum wage job would be able to buy a new 2035 EV and if current EVs don’t mechanically (electrically?) age well, EVs won’t dominate the market for a long time.",
        "sentiment": "POSITIVE",
        "score": 0.8225837349891663
    },
    {
        "comment": "Or more correctly they'll never see the effects of it.  They'll still be flying in private jets and getting limo rides everywhere like they always do.  Same thing with every law they pass.\n\nI don't think they've really thought this thru.  The biggest problem with electric cars is charging them.  I'm probably a great candidate.  I have a garage and all that.  Unfortunately the breaker panel is tapped out.  I'll have to pull multiple permits and get an electrician to gut the house electrical to put large panel and line in and put a charger in.  That's probably at least a 5k job and all the headaches that go with it.  I don't really want to sit in a parking lot every few days for an hour to charge the car.  Its a gigantic step back in quality of life.",
        "sentiment": "NEGATIVE",
        "score": 0.9979877471923828
    },
    {
        "comment": "you are being sarcastic right? The most load on the grid is during the evening",
        "sentiment": "NEGATIVE",
        "score": 0.9951699376106262
    },
    {
        "comment": "I wouldn’t be so much worried about the range as the recharge time. It’s easy to just fill up your tank in a couple of minutes and go another 400 miles.",
        "sentiment": "NEGATIVE",
        "score": 0.9927152991294861
    },
    {
        "comment": "Exactly. I wish they would call the governments bluff about the 2035 bullshit. There's no way ICE will die in 2035. It's literally impossible. You really think the last 100 years of automobile innovations will just give up and become electric? I don't think so.",
        "sentiment": "NEGATIVE",
        "score": 0.9939911961555481
    },
    {
        "comment": "I thought at first gme were the general motors stock.",
        "sentiment": "NEGATIVE",
        "score": 0.9983223080635071
    },
    {
        "comment": "I'd make bets that politicians will flip-flop and/or say *Well, actually, we meant this...* and allow for ICE engines to continue to be sold by then. I just don't see how exactly ICE is going to be phased out that soon, unless gov'ts want to throw money at the so-called problem.",
        "sentiment": "NEGATIVE",
        "score": 0.9990990161895752
    },
    {
        "comment": "That's the biggest thing that people don't stop to think about. It doesn't matter how great the cars are if the infrastructure isn't there to support them. A lot of people in big cities don't have anywhere to charge an EV unless those cities or the buildings where they live decide that it makes sense to invest in charging ports. I have a hard time seeing many of those places spending the fairly large amount of money it would take to have charging ports widespread, especially in already-old parking structures that would probably be better off getting torn down and replaced with new structures at that point.",
        "sentiment": "NEGATIVE",
        "score": 0.9986081719398499
    },
    {
        "comment": "There are used EVs now",
        "sentiment": "NEGATIVE",
        "score": 0.6578992605209351
    },
    {
        "comment": "But the typical camera cost $100 or less. That's \"an easy Christmas present\" not \"a major expense.\" As I said elsewhere, 1/4 of the cars on the road are over 16 years old and the average car age is 12 years.\n\nIf the average camera in use today were 12 years old, it'd still be really easy to get film and get film developed. But the average camera in use today is a 2-year-old smart phone.",
        "sentiment": "NEGATIVE",
        "score": 0.9956327080726624
    },
    {
        "comment": "Only if the price is right. For an American driving 15kmi a year gas for the average new car only costs about $1400/yr, so with the Model 3, the best selling electric car ever, sitting at $40k for the lowest tier version versus like a $25k Crosstrek that only costs $1500/yr to maintain and fuel it's kind of a hard sell.\n\nEspecially when you're young, renting, and don't have access to your own charger.\n\nI agree that hybrids are going to dominate sales very soon here, but ICE isn't going to become uncommon by any means in 2035.",
        "sentiment": "NEGATIVE",
        "score": 0.9877644181251526
    },
    {
        "comment": "There are plenty of good reasons to expect that people will want to switch to Evs, but I'm not sure that \"experiencing Tesla\" is one of them, lol.",
        "sentiment": "NEGATIVE",
        "score": 0.9798858761787415
    },
    {
        "comment": "Am in the only one that likes the volt? Sure it has an engine but that does away with almost all of the negatives. \n\nTbh I drive a Mercades that gets like 15-19 mpg so I have not put my money where my mouth is.",
        "sentiment": "NEGATIVE",
        "score": 0.9978764057159424
    },
    {
        "comment": "Ford has already stated their electric F150 will be more expensive initially but will cost less in the long run.",
        "sentiment": "NEGATIVE",
        "score": 0.9976654052734375
    },
    {
        "comment": "I think most truck buyers in the US don’t actually tow. For the typical consumer this may not even matter",
        "sentiment": "NEGATIVE",
        "score": 0.9987425208091736
    },
    {
        "comment": "That msrp will likely be used as a marketing gimmick like the 35k model 3.\n\nFord and GM actually sell their base models in volume so they'd have to actually be serious about that base msrp.",
        "sentiment": "NEGATIVE",
        "score": 0.9974084496498108
    },
    {
        "comment": "But that's exactly why I don't get the cost of ownership comparisons. \n\nMy mazda gets 30mpg on premium. So in Texas that's about 9 cents per mile, so roughly double that of a Tesla. \n\nSay I pay $15k more on the purchase price of a Tesla (reasonable) - it would take me 300,000 miles to make up the fuel difference, to justify a $15k premium on the front end. \n\nI don't think I've ever seen an EV with 300k miles.\n\nThe math just doesn't work at current fuel and electricity prices.  And that's at 30mpg, which many modern ICE cars can beat.",
        "sentiment": "NEGATIVE",
        "score": 0.9993472695350647
    },
    {
        "comment": "Got it, step 1 to owning a Tesla: buy a house. Very reasonable solution for the overwhelming majority of the population that lives in apartments.",
        "sentiment": "POSITIVE",
        "score": 0.9979813694953918
    },
    {
        "comment": "PHEVs solved most of that issue and are much more palatable to the average 1 car household. As well as those who rent, street park, or regularly spend time outside of developed areas. 95% of trips would run on EV for those who have access to charging, but if you don't then it doesn't matter: you can still get in and go. Same goes for people who regularly tow their toys on the weekend. \n\nPure EVs, in their current form, favor suburban homeowners who own their ability to charge and most own a second ICE vehicle. I think this will change over time but I am still suspect of 100% market adoption: I roughly see ~50% EV, 40% PHEV, the rest some mix of biodiesel, hydrogen, etc for specialized purposes.",
        "sentiment": "POSITIVE",
        "score": 0.8587506413459778
    },
    {
        "comment": "> The average consumer certainly doesn't need that.\n\nRight? The average consumer *bladder* also can't even do that. Hell, the average consumer knees, hips and lower backs need to stop more often than that.",
        "sentiment": "NEGATIVE",
        "score": 0.986735463142395
    },
    {
        "comment": "People generally care more about their cars than their phones",
        "sentiment": "NEGATIVE",
        "score": 0.9779931306838989
    },
    {
        "comment": "Lol “denigrating”? I’m not insulting a group of people here. I’m allowed to express my personal opinion that electric cars aren’t as fun. Just like you can express the opposite opinion.",
        "sentiment": "POSITIVE",
        "score": 0.9917566776275635
    },
    {
        "comment": "People can still ride horses though. Even aside from that, I’m not sure it’s the best comparison.  They’re trying to kill the gas powered car.\n\nAm I supposed to be consoled that my hobby is essentially undergoing a massive disruption, just because of some analogical situation that happened 110 years ago? It doesn’t make this suck any less.",
        "sentiment": "POSITIVE",
        "score": 0.6090733408927917
    },
    {
        "comment": "Aren't most of the governments that are \"banning the sale of ICE powered cars\" in 15 years still allowing hybrids or at least plug in hybrids?",
        "sentiment": "NEGATIVE",
        "score": 0.9938179850578308
    },
    {
        "comment": "I'll take my downvotes for this, but yes it's gonna happen.\n\nSource: an engineer who's worked in both ICE development and now the EV industry.",
        "sentiment": "POSITIVE",
        "score": 0.9990092515945435
    },
    {
        "comment": "15 years isn't exactly soon. 15 years ago the iPhone didn't even exist.",
        "sentiment": "NEGATIVE",
        "score": 0.9983502626419067
    },
    {
        "comment": "Generally the ICE bans already encompass standalone ICE vehicles - Japan's \"EV only from 2030\" for example includes PHEV and Hybrids as EVs (and a lot of reporting on market share bundles those all together). \n\nRealistically it makes sense, since by 2030 pure EV prices will normalise compared to hybrid probably somewhere around where Hybrids are today relative to standalone ICE cars, and Hybrids will be the de facto standard, with global market share probably split somewhere around 40-55-5 in favour of Hybrids with a couple of ICE niches still in play - at that point, vehicle emissions will likely be low enough that further restriction is less useful and probably will already trend downwards from there without regulation of the type we've seen from Euro VI or VII, which are already largely responsible for kickstarting mass EV (including hybrid and PHEV) adoption.",
        "sentiment": "NEGATIVE",
        "score": 0.9972297549247742
    },
    {
        "comment": "That’s a lot of consumer demand for gasoline.",
        "sentiment": "NEGATIVE",
        "score": 0.9561554193496704
    },
    {
        "comment": "Electric cars also have close to zero maintenance. That's thousands and thousands of dollars over the lifetime of the car + time + money not spent on fuel.\n\n&#x200B;\n\nMany people are unfortunately fools and they only look at the monthly loan cost without seeing how much insurance, gas, maintenance will cost.",
        "sentiment": "NEGATIVE",
        "score": 0.9990012049674988
    },
    {
        "comment": "The other major EV hurdle is going to be cold climate winters. Batteries hate the cold and it tanks range, along with the drain of trying to heat the cabin. Until that hurdle is solved, that's going to hinder mass EV adoption for a large part of the world as well.",
        "sentiment": "NEGATIVE",
        "score": 0.999672532081604
    },
    {
        "comment": "The original Volt had a lot of issues in regards to passenger and cargo space. Sure, it looked like a regular car on the outside, but remember they basically had to cram in two complete drivetrains, at a time when batteries weren't exactly known for being small (they still aren't, but they wouldn't need as many now for the same capacity). The original was a four-seater, and the cargo area had a high load floor.",
        "sentiment": "NEGATIVE",
        "score": 0.9962339997291565
    },
    {
        "comment": "But everyone likes to claim that they CAN tow. Just like the many people who buy a 3 row SUV and never use the 3rd row, a Jeep Rubicon but never take it off road, or a Ford Raptor but never jump even a curb. People look at stats and then go \"but that other model can tow 10,000lbs. Why do I want this one that is better in every other way but only tows 9,995lbs?\"",
        "sentiment": "NEGATIVE",
        "score": 0.9869505763053894
    },
    {
        "comment": "is that true? i’m sure it would get a lot of looks, and plenty of people love attention",
        "sentiment": "POSITIVE",
        "score": 0.9994586110115051
    },
    {
        "comment": "I can get past the looks, but not the company passing over QC. It's my biggest concern about the CT.",
        "sentiment": "POSITIVE",
        "score": 0.9736500978469849
    },
    {
        "comment": "You may feel very strongly that EV range does not currently fit your driving patterns, but you far overestimate how much the \"average consumer\" has driving patterns like yours.",
        "sentiment": "NEGATIVE",
        "score": 0.9963839054107666
    },
    {
        "comment": "> EV enthusiasts like you always fudge the numbers to make EVs look better than they are.\n\nMeanwhile you're talking about driving 400-500 miles without a bathroom break.",
        "sentiment": "NEGATIVE",
        "score": 0.9304164052009583
    },
    {
        "comment": "> EV enthusiasts like you always fudge the numbers to make EVs look better than they are.  \n\nHey my main argument is that most people have an unrealistic idea of what they actually need. Pre-covid, I did many 1,000+ mile road trips in an 315 mi range Tesla 3, and also occasionally travel for work, so I do have an idea of what I'm talking about.  \n\nI'll be more than honest that if I am trying to drive 1,000 miles as fast as absolutely possible, then current EVs are not going to win that race. I did that once from NoVA to Alabama, and I lost about an hour in total travel time. When I traveled with my family to Maine, we didn't lose any time because my kids can't just sit in a car for 12 hour straight, so we get out every 3 hrs, use the restroom, change the toddler, get a snack, and the car is already past the 80-85% charge threshold before we even get back to it.  \n\nAs far as work travel, my office and most of my clients have EV charging on the premises (which will be the standard everywhere soon enough), so range is not really a consideration. I'm sure there are jobs that are exceptions to the rule, but we're talking about the average person at the moment, so I think the case is already there.   \n\nAnd like you said, EVs will get better so that more and more non-average use cases are covered. At the very least, there is no reason for a 2-car family to not consider an EV for one of their vehicles right now.",
        "sentiment": "NEGATIVE",
        "score": 0.9986585378646851
    },
    {
        "comment": "Yes they are. They are still allowing all types hybirds",
        "sentiment": "POSITIVE",
        "score": 0.9992928504943848
    },
    {
        "comment": "Good point. People are already switching from luxury f150s to f250s lol.",
        "sentiment": "NEGATIVE",
        "score": 0.5274340510368347
    },
    {
        "comment": "Wouldn't it be cheaper to just paint dicks on you car?",
        "sentiment": "NEGATIVE",
        "score": 0.9990893602371216
    },
    {
        "comment": "Can't mess up panel gap if the body is folded origami.\n\nI have 2 Teslas.  Your biggest concern should be warranty.  The company is dishonest and shitty when it comes to service.  If you need your cybertruck for work, forget it - uber credits are how they handle loaners now (During Covid.  Seriously!).  Picture loading tools or a bed full of gravel into an Uber.",
        "sentiment": "NEGATIVE",
        "score": 0.999679684638977
    },
    {
        "comment": "And a whole lot more that don't. And plenty of people living in less-than-ideal conditions where they can barely afford a 20-year-old ICE car, parked on the street, and they're not going to be able to adopt the EV lifestyle.",
        "sentiment": "NEGATIVE",
        "score": 0.9995266199111938
    },
    {
        "comment": "Honestly, a mechanic or handyman would probably much rather work on an electric car. No timing belts. No valves. No exhaust leaks. No vacuum line leaks. No bad gas. No running rich or lean or fouling plugs...  it's just a motor, gearbox of some sorts, battery and a conrrol unit.",
        "sentiment": "NEGATIVE",
        "score": 0.9958208799362183
    },
    {
        "comment": "“Inconvenient” because you don’t understand it. I’m sure people with horses called cars Inconvenient because “hay was easier to find than gas”. Times are changing.",
        "sentiment": "NEGATIVE",
        "score": 0.9928446412086487
    },
    {
        "comment": "It's not inconvenient though. It's actually more convenient unless you exclusively do road trips. Literally never have to go to the gas station, very little maintenance, instant torque. \n\nAnd not every EV is a tesla with constant updates. \n\nIf you can't see that EVs and potentially hydrogen vehicles are the future I'm not sure what you're seeing. I'm never going back to an ICE Car, they just suck.",
        "sentiment": "NEGATIVE",
        "score": 0.9961930513381958
    },
    {
        "comment": "Except Diesel runs the mines, Diesel runs the Shipping, Diesel runs the cargo boats, Diesel runs everything that shipped your \"zero emission\" car to you. Diesel runs this world. Batteries are still way too heavy to be practical, or even get anywhere near where a normal car can go.",
        "sentiment": "NEGATIVE",
        "score": 0.9986244440078735
    },
    {
        "comment": "just like feeding and keeping a horse, it will get more expensive when normies stop doing it.",
        "sentiment": "NEGATIVE",
        "score": 0.9966386556625366
    },
    {
        "comment": "50 years is a really long time. Enough time for EVs to be way better than they are today and most, if not all, of their inconveniences gone.\n\n45% efficiency is amazing for ICE but pretty bad for EV.",
        "sentiment": "NEGATIVE",
        "score": 0.9941086769104004
    }
]