[
    {
        "comment": "Also, I recall that there were rumours that the new Accord was supposed to debut with a brand new hybrid system. Perhaps this is it.\n\nMaybe the Prelude won't just be a 200hp \"CVT\" Civic after all.",
        "author": "Bottlely",
        "score": 1
    },
    {
        "comment": "The report looks like all their business. Honda does private jet business, so it makes sense that they interesting VTOL.",
        "author": "V8-Turbo-Hybrid",
        "score": 8
    },
    {
        "comment": "Going all electric sounds disappointing. For almost all its history, Honda is known for making great combustion engines (except the L15). Dropping all ICE seems like a huge departure from what we know as Honda. Sad.",
        "author": "9prelude8",
        "score": -4
    },
    {
        "comment": "Pls send more type Rs to Canada pls Honda senpai",
        "author": "longgamma",
        "score": 1
    },
    {
        "comment": "Honda 0 series model lineup: Saloon (crazy), SUV (yuck), SUV (yuck), SUV (yuck), SUV (yuck), SUV (yuck), compact sedan (yay! ...in 2030). Their China lineup looks boring, too.\n\nI'm profoundly disappointed this is what is coming from the creators of the totally sweet Honda E.",
        "author": "SPorterBridges",
        "score": 0
    },
    {
        "comment": "Adapt or die. At the end of the day, they still have to make money, and keep investors happy.",
        "author": "New_Significance3719",
        "score": 10
    },
    {
        "comment": "It's the direction of the industry whether we like it or not. Honda has to follow the industry or fade away. However being makers of great combustion engines I have to think they will likely become makers of great electric powertrains. We won't know in our lifetimes probably but in 100 years the 15-20-30+ year old EV beaters still on the road well it wouldn't shock me in the least if it was Honda's and Toyota's still lol.",
        "author": "waterbed87",
        "score": 3
    },
    {
        "comment": "Suit yourself. I'm pretty pumped for both the saloon and the 2028 sdv-era compact crossover.",
        "author": "Recoil42",
        "score": 2
    },
    {
        "comment": "Oh yeah, that's a pretty convoluted slide. It's capital allocation though, so you don't need to worry about it too much. Briefly, they're saying: \n\n* They project cash flow will grow, from ¥12T to >¥12T\n* They're currently redirecting \\~¥3.5T to EV and SDV R&D, but will increase that to \\~¥6.5T.",
        "author": "Recoil42",
        "score": 1
    }
]