[
    {
        "comment": ">Suppliers who are unwilling to switch to certified green energy will nolonger be considered for contracts with Porsche in the long term. \"Ourbattery cell suppliers have already had to use green energy since 2020.And now we are taking the next important step: we stipulate that ourseries suppliers also use only renewable energy to produce ourcomponents, to help reduce CO2-emissions even further....  \n>  \n>...Porsche is reducing CO2-emissions in its own plants: the production of the Taycan – the first all-electric sports cars made in the Zuffenhausen plant in Stuttgart – has been carbon neutral since it was launched in 2019. Since 2020, this has been true for all vehicles made at the company's headquarters, and thus for the 911 and 718 aswell. At the start of 2021, the Development Centre in Weissach and the plant in Leipzig, where the Macan and Panamera models are produced,followed suit. This means that all of the large Porsche sites are already CO2-neutral in terms of operations.\n\nInteresting to note that the several of their vehicles, including the Taycan, are carbon neutral. That means the Taycan has a overall lower C02 footprint than the gas models the second you start driving it, rather than after about 40k or so miles like other EVs. Not sure if it includes C02 impact of the materials extraction, though.",
        "author": "Ultra-sphinx",
        "score": 174
    },
    {
        "comment": "Virtue signaling by German company, when their own government is lobbying hard for Russian gas pipe. Disgusting.\n\nEdit: will also remind everyone that Porsche has a controlling stake in VW. Company known for emission dieselgate scandal. All of a sudden they are good guys now.",
        "author": "arcticrobot",
        "score": 28
    },
    {
        "comment": "Ah yes, where have I heard this. Pretending to sound Green and \"carbon neutral\" while they completely lie and talk a bunch of lies. Even if they believe that, Germany actively replaced Nuvler with Coal, and is constructing a Russian pipeline for natural gas. I wish these companies would stop spouting bullshit.",
        "author": "DOugdimmadab1337",
        "score": -1
    },
    {
        "comment": "We're going through the certification process right now at my job to be certified as carbon neutral. From what I've seen, plenty of these certs are nonsense.  As long as you can kick the worst parts onto somebody else's shoulders you are now carbon neutral.  Or you just throw some money at it and buy carbon offsets/credits, now you're carbon neutral!! lol",
        "author": "MyRedditHandle2021",
        "score": 102
    },
    {
        "comment": ">Not sure if it includes C02 impact of the materials extraction, though.\n\nI'm almost certain it doesn't. They specify the production of the vehicle, which I assume means the manufacturing of parts and putting it all together, but does not include sourcing the raw materials.\n\nThe latter part is, by my understanding, far more CO2 intensive than anything else.\n\nThey do claim to aim for carbon neutrality across the entire value chain by 2030 though.",
        "author": "assblast420",
        "score": 64
    },
    {
        "comment": "It doesn’t include the extraction of materials. With how much mining that’s been going on it’s like oil 2.0\nModern cars use a lot of rare metals these days",
        "author": "ifyouhatepinacoladas",
        "score": -1
    },
    {
        "comment": "Thats honestly amazing. Porsche can share the secrets with other companies so they can update their infrastructure too.",
        "author": "TheAsianTroll",
        "score": 1
    },
    {
        "comment": "In what world are you living where CO2 management is still considered \"virtue signalling\"? This is a necessity going forward. \n\nAnd natural gas is basically the cleanest fossil fuel in both specific CO2 emission as well as other pollutants, so in both respects your accusation doesn't really work.",
        "author": "Onkel24",
        "score": 96
    },
    {
        "comment": ">\tVirtue signaling\n\nYou don’t know what this term means",
        "author": "slippingparadox",
        "score": 25
    },
    {
        "comment": "Isn't Germany one of the leading countries when it comes to renewable energy production",
        "author": "Snuffl3s7",
        "score": 16
    },
    {
        "comment": "Porsche the car manufacturer ≠ Porsche Holdings",
        "author": "None",
        "score": 2
    },
    {
        "comment": "> will also remind everyone that Porsche has a controlling stake in VW.\n\nPorsche SE ≠ Porsche automotive.\n\nThe holding company that owns VW and the automaker that produces the vehciles are two separately operating entities.",
        "author": "AmbitiousButRubbishh",
        "score": 2
    },
    {
        "comment": "Did... Did you just ignore all the problems like long term storage? Germany isn't like the US just so you know there is barely any place not full of housing etc. In the US sure, you go to some random dessert in Texas or remote mountains in Alaska and dump your shit there nobody will know or care. Ain't like this here...\n\nBut looking at your other comments you probably are just some shill...",
        "author": "Next_trees",
        "score": 9
    },
    {
        "comment": "> when their own government is lobbying hard for Russian gas pipe\n\nWhen reality and ideology collide. Almost no government is willing to increase excise tax on fossil fuels because they are so important to quality of life, so they put all the blame on the producers/infrastructure companies and then the consumers get a free pass. It's ridiculous. The obvious logical conclusion we'll get to is that all the economics will accrue to government owned producers (OPEC+, China) and private companies. Public companies will be left to languish, for no benefit to emissions.",
        "author": "YouAreMentalM8",
        "score": 1
    },
    {
        "comment": "Read too much american propaganda I see.\n\n\nGas and coal consumption are steadily *decreasing* in Germany. Coal usage has *halved* since 2015. And Germany wants to exit coal entirely till 2035.\n\n\nAs for the pipeline....North stream is **replacing** old existing pipelines that run through 3rd party non-EU transit countries. It actually makes the EU less dependent on others (Ukraine, Belarus). It does not increase or decrease dependency on Russia, it stays the same as before (it replaces old lines). And the gas also is not for Germany only, it's for the entire EU. The pipeline connects to NEL and OPAL which distribute the gas to the Netherlands, Belgium, Czechia, Poland and subsequent France, UK, Austria, Hungary, etc",
        "author": "xf-",
        "score": 14
    },
    {
        "comment": "No, German coal consumption is constantly reducing. Nuclear energy was entirely replaced with renewables (and then some).\n\nAnd no matter the ignorance of some people in this thread, Porsche is actually just a company and not a country (and Germany is a free market economy where the government stays largely clear from running companies).",
        "author": "Bojarow",
        "score": 11
    },
    {
        "comment": "That's exactly how the emissions trading scheme is supposed to work. \n\nBy buying carbon credits Porsche are subsidising carbon negative industries. Improving return time for capital spending, financial viability and attractiveness to new investment - all of which encourage growth.",
        "author": "MisterSquidInc",
        "score": 31
    },
    {
        "comment": "Saw this at 2 previous employers. It's all paperwork nonsense. Not a single thing changed except some LED bulbs and REALLY expensive windows.",
        "author": "minibudd",
        "score": 36
    },
    {
        "comment": "Specifically the argument for production is the same as the argument for life time EV charging.\n\nLarge amounts of energy are needed  ~~on top of rare earth metals~~ (this pertains to motors, not batteries) to construct high output battery packs. At the moment the majority of this energy is still fossil fuel based. Meaning that any savings of C02 by EVs not producing exhaust is offset ~~entirety~~ by the energy used in their production.\n\nThe upside of course being that as energy generation moves to renewables on a global scale, EVs become more environmentally friendly that ICE vehicles. All of this comes with investment into infrastructure and  technology which the big players seem interested in. Especially moves like this one by Porsche to enforce renewable sources. As they say, money talks.",
        "author": "zanar97862",
        "score": 0
    },
    {
        "comment": "Close nuclear plants. Get in bed with Russia for gas. Living in a real world. You?",
        "author": "arcticrobot",
        "score": 2
    },
    {
        "comment": "It is, Germany is sucking up to Russians, instead of doing the right thing and going Nuclear. If you really want Change, Invest in Nuclear. That's the only real form of renewable that is a permanent option. Selling out to the Russians for Natural Gas is the wrong answer.",
        "author": "DOugdimmadab1337",
        "score": -1
    },
    {
        "comment": "Didn't Germany recommission coal plants this past winter so they didn't freeze?  Their aggressive transition doesn't seem so excellent to me.",
        "author": "Dren7",
        "score": 1
    },
    {
        "comment": "Why do you even bother to make an empty claim?",
        "author": "arcticrobot",
        "score": -19
    },
    {
        "comment": "they decommissioned nuclear power plants, built new coal ones...",
        "author": "fuckyouspez1",
        "score": 54
    },
    {
        "comment": "The German Green Party would love to have you believe that but in reality we're only #1 when it comes to killing our Auto industry",
        "author": "None",
        "score": 3
    },
    {
        "comment": "If you ignore how much gross (not net) energy production they're outsourcing to neighboring countries. They'd be in a whole lot better position if they hadn't started to shut down their nuclear plants.",
        "author": "None",
        "score": 2
    },
    {
        "comment": "google Nord Stream 2 pipeline. It's disgusting. Germany is getting in bed with Putin to get cheap gas. While virtue signalling about renewable energy.   \n\n\nHonestly, renewable energy is shit. I would rather countries keep investing in research and development of nuclear energy and creating safe and mobile reactors to power ocean going container ships, that pollute the most.   \n\n\nInstead we have solar fields and windmills, that destroy natural wildlife habitat and will create enormous landfills down the road. And keep ignoring cargo ships. Because it is not here, it is there, it is killing Great Barrier reef, but who cares about it other than some eco-freaks, right?",
        "author": "arcticrobot",
        "score": 11
    },
    {
        "comment": "I know. But they are affiliated and Wolfgang Porsche is chairman of both.",
        "author": "arcticrobot",
        "score": 1
    },
    {
        "comment": "Managed by same people.",
        "author": "arcticrobot",
        "score": 0
    },
    {
        "comment": "You could put all the nuclear waste ever created on the face of this earth and put it in a warehouse the size of a single Walmart. I'm sure they can think of something.",
        "author": "Ronjar506",
        "score": 3
    },
    {
        "comment": "I don't understand this argument, Germany is buying fuel they don't have, why can't they buy land they don't have to bury nuclear waste into? (Ie pay russia to pick some place they've already nuked the fuck out of to dump it)",
        "author": "ghettithatspaghetti",
        "score": 1
    },
    {
        "comment": "Thank you for your intelligent comment!",
        "author": "arcticrobot",
        "score": 1
    },
    {
        "comment": "It's only propaganda if someone else says something, right?",
        "author": "None",
        "score": 1
    },
    {
        "comment": "It is reducing, but not nearly as quickly as it would have reduced had nuclear power been maintained.",
        "author": "None",
        "score": 1
    },
    {
        "comment": ">\t (and Germany is a free market economy where the government stays largely clear from running companies).\n\nLol",
        "author": "None",
        "score": 0
    },
    {
        "comment": "The comments under that video are scary as shit. People are so stupid, society is doomed. Barely literate people patting each other on the back about how climate change is a hoax.",
        "author": "Ronjar506",
        "score": 1
    },
    {
        "comment": "Cap and trade + circular economy will provide more direct transition to carbon neutral than any individual choices people can make",
        "author": "Doctor-Dapper",
        "score": 4
    },
    {
        "comment": "Windows are huge for energy efficiency",
        "author": "bluecifer7",
        "score": 7
    },
    {
        "comment": "I’ve worked in construction on LEEDS certified projects and they are some pretty dumb standards like the dual flush toilets, why not just put in water efficient toilets off the get go? And yes LED lights that need to automatically turn off after 30 min of no motion in the zone is part of the standard.",
        "author": "the_421_Rob",
        "score": 10
    },
    {
        "comment": "> Large amounts of energy are needed on top of rare earth metals to construct high output battery packs. \n\nNo rare earth metals of any kind are contained in \"high output\" battery packs. They may or may not be used in electric motors though.",
        "author": "Bojarow",
        "score": 8
    },
    {
        "comment": "What's your solution to nuclear waste?\n\nNorth stream is *replacing* other pipelines that run through 3rd party non-EU transit countries. It actually makes the EU *less* dependent on others (Ukrain, Belarus) and does not increase dependency on Russia either. And the gas also is not for Germany only, it's for the entire EU. The pipeline connects to NEL and OPAL which distribute the gas to the Netherlands, Belgium, Czechia, Poland, etc",
        "author": "xf-",
        "score": 14
    },
    {
        "comment": "It's very easy to make simple,  black & white judgments on huge, complex issues when you're just an angry dude with a Tacoma and a red hat in the closet.",
        "author": "LostnDepressed101",
        "score": 2
    },
    {
        "comment": "Nuclear power is not considered renewable in any way.\n\nFor climate change, it largely doesn’t matter in principle whether natural gas is sourced from Norwegian or Dutch oil fields, US fracking or Siberia.\n\nTrading with a country the rest of the world also trades with (yes, this includes the US) is not \"selling out\" in any way either.",
        "author": "Bojarow",
        "score": 3
    },
    {
        "comment": "Virtue signaling doesn’t apply when the company is taking concrete and tangible action towards their goal",
        "author": "slippingparadox",
        "score": 25
    },
    {
        "comment": "Too many countries avoid nuclear because it sounds scary despite the overwhelming benefits. Nuclear solves so many problems but people want to be \"safe\", despite long term studies showing nuclear to be much safer than most alternatives... *sigh*",
        "author": "PyroKnight",
        "score": 38
    },
    {
        "comment": "As opposed to which countries?",
        "author": "Doctor-Dapper",
        "score": 1
    },
    {
        "comment": "I agree that a lot of companies do bullshit greenwashing and I also wish we had more investment in nuclear, but wind and solar has become legitimately price competitive. Today in some high sun areas solar + storage is even competitive with fossils. Renewables are legit.\n\nContainer ships are actually fairly efficient compared to other transport in terms of co2 emission per ton per mile, but they do emit tons of nasty sulfur and other particulate pollution. There are a couple of companies who have large sail prototypes that can reduce emissions on container ships by 1/3rd using wind to help propel the ship.",
        "author": "pinnr",
        "score": 8
    },
    {
        "comment": "Completely agree. Being from Australia and seeing the destruction of the GBR really sucks, doesn't help our government wont do anything to protect it.",
        "author": "HairyTitDicks",
        "score": 1
    },
    {
        "comment": "Huh, TIL. Thanks",
        "author": "Snuffl3s7",
        "score": -1
    },
    {
        "comment": "No, Porsche have made a significant amount of their production process carbon neutral (and are working on the rest of it), they're now pushing suppliers to do the same so that they can ultimately say the entire value chain is carbon neutral. \n\nIt's in the article.",
        "author": "MisterSquidInc",
        "score": 5
    },
    {
        "comment": "LED lights save a huge amount, lighting used be 5-10% of electricity demand, and LEDs reduce electricity demand by 80-90% for the same light output. A lot of commercial property also had the lights left on permanently for some reason.",
        "author": "JB_UK",
        "score": 29
    },
    {
        "comment": "Yep, there’ve been a couple studies that look at the breakeven point including material extraction. Even in coal-heavy China, that was around only 80k miles IIRC.",
        "author": "scozzy",
        "score": 10
    },
    {
        "comment": "You're right, I was speaking too generally. The benefit is not completely lost and EVs do break even in their lifetime. I was thinking only of the added benefit of more renewable energy sourcing.",
        "author": "zanar97862",
        "score": 8
    },
    {
        "comment": "Thank you for the correction",
        "author": "zanar97862",
        "score": 3
    },
    {
        "comment": "Nuclear waste doesn't need a solution because it has never been a problem in the first place. It's funny that this is always the first thing people think of, but it's actually nuclear's big strength. \n\nWith wind power, for example, you are left with tons and tons of fiberglass blades that you can't recycle at the moment and need to bury; old solar panels that are full of toxic materials get shipped to poor African countries; batteries that you need for both, again, don't currently get recycled and have to get landfilled. Nuclear waste? Well, all the nuclear waste *ever produced* in the US will fit into one warehouse. That's the beauty of nuclear energy - you only need one glass of nuclear fuel to cover your energy needs *for life*. Because of this energy density very little waste gets produced and you can just leave it next to the plant. You don't even need to bury it, there is enough space there to last 100+ years.\n\nSo that's all there is to it. Nuclear waste currently doesn't contribute to any contamination whatsoever (unless there are accidents, of course) and won't in the foreseeable future - which can't be said of any other zero emission energy source. Also, contrary to popular perception, nuclear waste doesn't stay radioactive for thousands of years. Well, yes, it does, but not in amounts that are actually dangerous. What you are really worried about are the elements that have a short to medium half-lives, like Iodine-131, Strontium-90 or Caesium-134/137. The shorter the half-life the more radioactive the element is. The elements that stay radioactive for thousands of years, like Uranium-238 or Plutonium-239 are not radioactive enough to be dangerous. That's why you can go on a tourist tour of Chernobyl today, 35 years after, and be completely fine - even though what happened there was completely uncontained.",
        "author": "BikAnacondaSanchez",
        "score": 29
    },
    {
        "comment": "Short term solution: bury it. Long term solution: shoot it into the Sun.\n\nAlso modern reactors produce very little of this stuff and it can even be reused.\n\nIn any case, the amounts of nuclear waste are minuscule compared to the amount of energy we can extract from them.",
        "author": "None",
        "score": 9
    },
    {
        "comment": "It makes Russia less dependent on transit countries. It makes EU more dependent on Russia.",
        "author": "arcticrobot",
        "score": 4
    },
    {
        "comment": "Geological repository. There are no remaining technical items preventing implementation. It's solely  political.",
        "author": "None",
        "score": 1
    },
    {
        "comment": "Weird, between two of us you are the angriest, because you fall to unwarranted personal attacks.",
        "author": "arcticrobot",
        "score": 0
    },
    {
        "comment": "It's not, but it's just as sustainable and clean as renewables. Renewable energy isn't the goal. Low carbon (clean) energy that is sustainable for thousands of years is the goal.",
        "author": "None",
        "score": 1
    },
    {
        "comment": "And the goal is to scam the world with diesel emissions by their affiliated company? You seriously believe in their honest intentions?\n\nDid we all forget all of a sudden about Dieselgate and VW, of which Porsche has a controlling stake?",
        "author": "arcticrobot",
        "score": -7
    },
    {
        "comment": "Russia is heavily invested in nuclear, while hooking Western countries like Germany on their cheap gas.",
        "author": "arcticrobot",
        "score": 18
    },
    {
        "comment": "TBF there are other issues as well, cost not being the least - they definitely are horrendously expensive to build. From a carbon perspective they're better whilst running than fossil fuel powered plants, but IIRC the actual construction emissions require something like 10 years of power production to come out ahead of fossil fuel power stations (can't recall which fossil fuel).",
        "author": "Car-face",
        "score": 6
    },
    {
        "comment": "I truly believe that when considering a nuclear plant, everyone always has the thought of Chernobyl in the back of their minds or something. I just finished the hbo show and they amount of incompetence and shortcuts taken in order for that reactor to explode is so crazy you’d think someone is making the story up if it’s told to you. Nuclear has so many be benefits , while also being virtually impossible to fail because of how technology progressed since then, combined with strict protocols. I can see however why people is still skeptical because in the 1/1000000000 chance the reactor gets exposed somehow, it would fuck that entire country and it’s neighbors for at least 100 years lol.\n\nEdit : benefits",
        "author": "Swifty_e",
        "score": 2
    },
    {
        "comment": "It was actually stopped by Greenpeace, and now we're all tucked :) thanks to the real virtue signalers",
        "author": "Staggz93",
        "score": 2
    },
    {
        "comment": "france, that has around 70% of power made with nuclear.",
        "author": "fuckyouspez1",
        "score": 1
    },
    {
        "comment": "You’re talking to an ideologue, a true believer in case you haven’t noticed.\n\nWho by the way knows very little about the issues he's having his strong opinions on.",
        "author": "Bojarow",
        "score": 11
    },
    {
        "comment": "Nuclear is the only answer. Whatever happens now is a step back after half a century of successful development.",
        "author": "arcticrobot",
        "score": 0
    },
    {
        "comment": "Yeah, it's funny how people tend to dismiss seemingly \"small\" changes without thinking about the real-world implications.",
        "author": "Onkel24",
        "score": 24
    },
    {
        "comment": "will they run for 300+ thousand miles?",
        "author": "CoryTheDuck",
        "score": -4
    },
    {
        "comment": ">\tYou seriously believe in their honest intentions?\n\nOf course I do. The entire world is on the verge of immense regulations on the automobile industry and it simply makes financial sense for them to leverage their position to force suppliers into environmental good standing. It’s a selfish act that ensures their position in a post regulation industry.",
        "author": "slippingparadox",
        "score": 15
    },
    {
        "comment": "Porsche AG does not have a controlling stake in VW, it is owned by VW. Porsche SE has a stake in VW but that's really just a holding company and not related to Porsche AG.",
        "author": "mintz41",
        "score": 3
    },
    {
        "comment": "A rare instance where totally ignoring your citizens results in something good, not that I know what the sentiments on nuclear are in Russia to be fair.",
        "author": "PyroKnight",
        "score": 8
    },
    {
        "comment": "France is indeed the outlier. Although their reactors are aging and most are not getting renewed for restoration so likely that # will be much lower in the coming decade.",
        "author": "Doctor-Dapper",
        "score": 2
    },
    {
        "comment": "\"nuclear is the only answer\"\n\nYou are aware that solar power is more efficient in both cost and power generation right? You could argue that nuclear would be better with a decade of development and that's fine, I support nuclear and every country should push every renewable as far as it can go, but saying \"nuclear is the only answer\" is incredibly narrow minded and not supported by evidence.",
        "author": "NinjaLion",
        "score": 2
    },
    {
        "comment": "Not related to Porsche AG other than having Wolfgang Porsche as being chairman of both?",
        "author": "arcticrobot",
        "score": 1
    },
    {
        "comment": "I think people in western countries hate nuclear because of propaganda and lobby.   \n\n\nLike, \"look at Chernobyl and Fukusima, do you want it to happen to you? \" My only guess is there aren't real money to be made by nuclear. It is too efficient. You build the plant, put a relatively simple reactor in it and it's churning power. Now look how much resources, human power, logistics power and land is involved in wind and solar. MONEY.   \n\n\nI like that there are still countries in western world, like France, that are heavily invested in nuclear.",
        "author": "arcticrobot",
        "score": 16
    },
    {
        "comment": "The industry standard is 60 years of operational life after commissioning, though most reactors that old have undergone inspections that have renewed their licenses for another 30 years.",
        "author": "None",
        "score": 1
    },
    {
        "comment": "Probably. But don't you think that \"switch to renewable or lose future contracts\" is also narrow minded and hypocritical?",
        "author": "arcticrobot",
        "score": 1
    },
    {
        "comment": "Well that could complicate the equation for 0 emissions.",
        "author": "CoryTheDuck",
        "score": 1
    },
    {
        "comment": "Replacing an EV battery every 300k miles (which isn't realistic as batteries will continue to work, just with reduced range) is still less damaging than the alternative ice car emissions. Plus, the engines in most new cars sold today probably won't even last to 300k miles, while the inverse is true for most EVs sold now.",
        "author": "markeydarkey2",
        "score": 1
    },
    {
        "comment": ">You build the plant, put a relatively simple reactor in it and it's churning power. Now look how much resources, human power, logistics power and land is involved in wind and solar. MONEY.\n\nReactors are not that simple, especially with all the safety systems that make generation III+ reactors cost more than twice as much as their predecessors with very little changes to the power production side of things. At the same time, wind and solar aren't that complex either. The key point here is that neither renewable nor nuclear is a mainstream industry that has big lobbies like coal and oil. Renewables are at the fringe despite decades of good press. And nuclear has consistently had bad press because, well, despite the fact it kills way fewer people than fossil fuel across a large time scale, the few people who do suffer from NPP accidents almost lose everything. Much easier for the individual person to let every person across the world lose 5 years of their lifespan than take a 0.01% risk of losing their lives, families, friends and entire hometown if a power plant nearby has a core meltdown.",
        "author": "None",
        "score": 4
    },
    {
        "comment": "Nuclear is not the answer long-term. It still produces greenhouse gas (water vapor), and is detrimental to local aquatic life.",
        "author": "Ghoticptox",
        "score": -3
    },
    {
        "comment": "Fission isn't, Fusion is.\n\nThey are both nuclear.",
        "author": "G3nesis_Prime",
        "score": 3
    },
    {
        "comment": "> It still produces greenhouse gas (water vapor)\n\nWhile water vapor is technically a greenhouse gas, it's not one there's any great concern with. Between water vapor and more traditional greenhouse gasses the vapor is almost always preferable and can be more easily managed long term.\n\n> and is detrimental to local aquatic life.\n\nAnd global warming is detrimental to *global* aquatic life, it's far easier to contain the effects of nuclear and the net tradeoff still seems like a good one provided you're not building these plants next to reefs or other similarly biodiverse areas.",
        "author": "PyroKnight",
        "score": 3
    },
    {
        "comment": "It doesn't have to.\n\nShips basically use a giant radiator-condensor cycle to reuse the fresh water in their reactors. This same tech was even used way back in like the 1920s for coal&oil fired steam turbine ships.\n\nI think some nuclear plants on land already do this. It just costs a little more money.",
        "author": "tacopowered1992",
        "score": 1
    },
    {
        "comment": "The Nissan leaf is like the exception to the rule, almost every EV (every new one on sale excluding the leaf) has active battery heat management that significantly increases battery longevity.",
        "author": "markeydarkey2",
        "score": 3
    },
    {
        "comment": "If we can actually get fusion to work, it would be fantastic. But there's been no indication we can and I doubt it'll happen in our lifetime.",
        "author": "Ghoticptox",
        "score": 1
    },
    {
        "comment": "Because it's a little cheaper to not recycle and there's no regulation forcing them to do it the better way.\n\nThe answer isn't throwing out hands up and surrendering to capitalism.",
        "author": "tacopowered1992",
        "score": 2
    },
    {
        "comment": "> Do you realize coal power plants also produce large amounts of steam in addition to the other greenhouse gasses?\n\nI haven't said anything about coal. I'd like to see that gone permanently. It and all other fossil fuels are an abomination. Well to be completely fair, they were a necessary part of human civilization, but now we know better and we have the technology to do better.\n\n> One day when we have methods to efficiently store large amounts of power we can easily go full wind/solar/hydro, but nuclear can be a very useful tool prior to that point.\n\nSo you agree with my original statement that nuclear is not the answer long-term. I personally think that the initial financial outlay and multi-year planning required to set up a nuclear power plant would be better spent investing in energy storage methods so we can hasten full reliance on renewables.",
        "author": "Ghoticptox",
        "score": 1
    },
    {
        "comment": "I don't think we'll get good solutions to energy storage that soon even with extra research, spinning up more nuclear seems warentted with that in mind. Nuclear is most useful as a coal replacement in the medium term and the less reliant we are on coal the better. I also think you're overestimating the role of water vapor in global warming as the amount produced by nuclear power still beats other base load generators for their own greenhouse gasses (outside of hyrdo).\n\nLong term nuclear isn't the awnser no, but we need solutions for the medium term too but with enough spending we can work on shorter term solutions alongside longer term ones. I think we can both agree not enough is being spent on energy infrastructure, I just don't think it's prudent to plan around tech that's well beyond the horizon. We shouldn't stop building roads because we are likely to get flying cars*.\n\n*And no, I'm not saying flying cars will make sense, but you get the idea",
        "author": "PyroKnight",
        "score": 1
    },
    {
        "comment": "Renewables are good but the issue is predictability. Winds vary, clouds roll in, rivers dry up, something has to fill in when that happens and gigantic battery banks or pumped storage isn't the answer. Nuclear seems like the best solution to that.\n\nNuclear can produce a metric fuckton of power 24/7. Hell, why not 50 50 nuke and renewable? Or 70 30? 90 10?",
        "author": "tacopowered1992",
        "score": 1
    }
]